[
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/melania-trump-says-7-more-ukrainian-children-reunited-families-part-initiative-russia",
        "title": "Melania Trump says 7 more Ukrainian children reunited with families as part of initiative with Russia",
        "publish_date": "December 4, 2025 12:53pm EST",
        "author": "ByGreg NormanFox News",
        "content": "Senior foreign affairs correspondent Greg Palkot discusses President Donald Trump’s meeting with Russian President Vladimir Putin as peace talks continue on ‘Special Report.’\nFirst ladyMelania Trumpannounced Thursday that an additional seven Ukrainian children have returned to their families in the war-torn country as part of a Russia-Ukraine youth reunification initiative.\n\"My dedication to guaranteeing the safe return of children to their families in this region is unwavering,\" Melania Trump said in a statement shared by the White House, which noted that six boys and one girl were involved.\n\"I commend the leadership and persistent diplomacy of Russia and Ukraine in the pursuit of the reunification of children and families. Their bridge-building has created a tangible collaborative environment — an anchor for optimism. This cooperation will continue to drive the process forward through the next phase,\" she added.\n\"In close partnership, my representative and I have providedhumanitarian supportfrom the United States to enhance the reunification initiative’s outcome. My hope is that, ultimately, our collective efforts will lead to broader regional stability,\" Melania Trump also said.\nSENS KLOBUCHAR AND GRASSLEY: AMERICA CAN'T IGNORE RUSSIA KIDNAPPING UKRAINIAN CHILDREN\nFirst lady Melania Trump speaks before building Red Cross holiday care packages and writing holiday cards to military service members, Monday, Dec. 1, 2025, at Joint Base Andrews, Md.(Julia Demaree Nikhinson/AP)\nThe first lady previously wrote a \"peace letter\" to Russian President Vladimir Putin telling him \"it is time\" to protect children and future generations around the globe, Fox News Digital reported in August.\nPresidentDonald Trumpthenhand-delivered the messageto the Russian leader before their summit in Alaska that month.\nFIRST LADY MELANIA TRUMP'S ‘PEACE LETTER’ TO PUTIN: ‘IT IS TIME’\nPresident Donald Trump greets Russian President Vladimir Putin as he arrived at Joint Base Elmendorf-Richardson on Aug. 15, 2025 in Anchorage, Alaska.(Getty Images/ Andrew Harnik)\nIn October, Melania Trump saideight Ukrainian children displacedduring the ongoing war with Russia had been reunited with their families.\n\"Each child has lived in turmoil because of the war in Ukraine. Three were separated from their parents and displaced to the Russian Federation because of frontline fighting. The other five were separated from family members across borders because of the conflict, including one young girl who has now been reunited from Ukraine to Russia,\" Melania Trump said at the time.\nResidents stand near their apartment building damaged during a Russian drone strike, which happened late Monday in the city of Kramatorsk, Ukraine.(Anatolii Stepanov/Reuters)\n\"My ongoing mission is twofold: to prioritize and optimize a transparent, free flow of health-related information surrounding all children who have [fallen] victim to this war, and to facilitate the reunification of children with their families until each individual returns home,\" Melania Trump said.\nFox News Digital's Brooke Singman and Rachel Wolf contributed to this report.\nGreg Norman is a reporter at Fox News Digital.",
        "scraped_at": "2025-12-28T19:03:38.233519",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukraines-underground-railroad-rescues-abducted-ukrainian-children-from-russian-reeducation-camps",
        "title": "Ukraine’s 'Underground Railroad' rescues abducted Ukrainian children from Russian reeducation camps",
        "publish_date": "February 7, 2024 7:33pm EST",
        "author": "ByJennifer Griffin,Liz Friden,Nana SajaiaFox News",
        "content": "Fox News national security correspondent Jennifer Griffin has the latest on reports that more than 19,000 Ukrainian children have been abducted by Russian soldiers and forced into reeducation camps on 'Special Report.'\nAs the 2nd anniversary of Russia's invasion of Ukraine approaches, more evidence has emerged that Moscow's goal is to redraw the map of Europeand erase Ukraine, according to the testimony of three formerly abducted Ukrainian teenagers.\nAuthorities in Kyiv have provided evidence to the International Criminal Court that more than 19,000 Ukrainian children have beendeported bythe Russian militaryfrom Ukraine and sent to reeducation camps inside Crimea and Russia.\nUKRAINE SAYS RUSSIA'S BLACK SEA FLEET SUFFERED DEBILITATING LOSSES SINCE COLLAPSE OF GRAIN DEAL\n\"We do not know how many of our children have been abducted,\" testified Ukraine Ambassador Oksana Markarovabefore Congress onJanuary 31. \"We hear Russians bragging about 700,000 children. We know that our soldiers already registered more than 19,000. But the matter of the fact, until we liberate all Ukraine, until we win this war, we will not know how many of our children and our civilians have been abducted or killed.\"\nThree Ukrainian teens who escaped from these camps with the help of their relatives and a group called Save Ukraine spoke to FOX News after testifying before theCongressional Helsinki Commission. 19-year-old Ksenia was kidnapped from their home in Kharkiv by Russian troops two years ago with her brother who was 10 years old at the time.\n19-year-old Ksenia was kidnapped from their home in Kharkiv by Russian troops two years ago with her brother who was 10 years old at the time.(Courtesy of Save Ukraine)\n19-year-old Ksenia was kidnapped from their home in Kharkiv by Russian troops two years ago with her brother who was 10 years old at the time.(Courtesy of Save Ukraine)\n\"I was sent to school and my little brother was sent to a ‘summer camp’,\" Ksenia told FOX. \"My brother was under pressure all the time. He was told Ukraine has no future that nobody remembers him in Ukraine. He was told that Ukrainians are dumb, that Ukrainians know nothing, they're Nazis. They were telling him, warwould destroy Ukrainesoon and there was no point going back, that he shall stay in Russia, where he can have future.\"\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.\nUKRAINE'S DIMINISHED FORCES DRIVE RECRUITMENT PUSH, PROPOSAL TO LOWER DRAFT AGE\n\"At the camps, they were telling us that very soon Ukraine will be part of Russia, that it is Russian land,\" Denys said during a visit to Washington DC. \"They were pressuring us to become Russians.\"\nRostyslav recently celebrated his 18th birthday with other children rescued from the Russian reeducation camps.\n\"We were supposed to sing the Russian national anthem.\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.(Courtesy of Save Ukraine)\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.(Courtesy of Save Ukraine)\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.(Courtesy of Save Ukraine)\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.(Courtesy of Save Ukraine)\nDenys was 16 years old when he was abducted 2 years ago. He spent 10 months in a Russian camp in Occupied Crimea until he was rescued by volunteers from Save Ukraine. He was living in Kherson with his two deaf parents, who could not speak and could not fight back when Russian troops abducted him.(Courtesy of Save Ukraine)\nAnd if you refused, you were punished,\" Rostyslav explained. \"If you did not sing for the third time, they would put you in a tiny solitary cell with no window and no phone. I was there four times in 35 days.\"\nRostyslav spoke to us in Ukrainian. Save Ukraine is the largest network of volunteers rescuing Ukrainian children deported to Russia in violation ofthe Geneva Convention. Its founder, Mykola Kuleba, compares it to \"The Underground Railroad.\" He says they have rescued 232 Ukrainian children in the last 18 months and more than 100,000 other Ukrainians after Russia’s invasion, Feb 24, 2022.\nVIDEO CLAIMS TO SHOW UKRAINE DRONE STRIKE ON RUSSIAN VESSEL\n\"It's very hard. The searching in social media. We receive information on our hotline and check this information. We connect with relatives, with friends, and then we provide rescue operations,\" Kuleba explained after testifying before US lawmakers. \"It's very complicated. But we have success.\"\nRostyslav recently celebrated his 18th birthday with other children rescued from the Russian reeducation camps.(Courtesy of Save Ukraine)\nRostyslav recently celebrated his 18th birthday with other children rescued from the Russian reeducation camps.(Courtesy of Save Ukraine)\nRostyslav recently celebrated his 18th birthday with other children rescued from the Russian reeducation camps.(Courtesy of Save Ukraine)\nA dangerous journey for the relatives who are trained to sneak behind enemy lines into Russia, pass interrogations by Russian agents working for the FSB, the internal spy agency, and find their missing children, before they are brainwashed and matched to a Russian family for a speedy adoption.\nKuleba explained what it was like for these children inside Russia’s reeducation camps:\n\"Every day, you should wake up in the morning and sing Russian anthem. You cannot speak your language. You should speak only Russian language. You should attend every day classes and learn how Russian Empire is powerful. That everybody want to hurt you. And you have to be prepared well to fight.\"\nJennifer Griffin currently serves as a national security correspondent for FOX News Channel (FNC) and is based out of the Washington D.C. bureau. She joined the network in October 1999 as a Jerusalem-based correspondent.",
        "scraped_at": "2025-12-28T19:03:40.789991",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/humanitarian-aid-expert-rescue-children-ukraine",
        "title": "Humanitarian aid expert reveals dramatic rescue of children from Ukraine to safety",
        "publish_date": "March 7, 2022 2:00am EST",
        "author": "ByMaureen MackeyFox News",
        "content": "Fox News national security correspondent Jennifer Griffin provides an update on the one million refugees who have crossed the border into Poland.\nYael Eckstein, president and CEO of The International Fellowship of Christians and Jews (IFCJ), told Fox News Digital via an email exchange this weekend amid her latest trip to Europe that she \"thought she had seen it all.\"\nShe elaborated, \"I have worked inthe humanitarian aid fieldfor over 16 years. I thought I had seen it all. But in the past seven days,\" she added — referring to Russia's assault on Ukraine — \"I have witnessed suffering and desperation that I have never seen in my lifetime.\"\nEckstein said that for her, \"the most heartbreaking thing was seeing orphans whom The Fellowship supports [caught] in the middle of a war zone.\"\nAmid that suffering and desperation, however, comes a dramatic story of planning, escape, care and — at least for now — a semblance of calm during the storm that is most of Ukraine right now. And it wouldn't have happened if not for the support, the prayers and the help of many people, including those who have donated to important charities over the years.\nThe Fellowship shared with Fox News Digital details of the successful rescue of about 100 children from Ukraine over the past few days — and the latest news about where they've landed.\nUKRAINE MOTHER DESCRIBES RUSSIA'S ATTACKS AS ‘EVIL’\nIt all began in Zhytomyr, Ukraine, where a woman named Malcki Bukiat was running an orphanage for children from \"socially challenged families,\" The Fellowship reported to Fox News Digital. Some of these children are orphans; others had parents who couldn't care for them. For the bulk of the year — from the age of 4 years old until age 17 — the students lived at the orphanage.\nYael Eckstein is a mother of four and president of The International Fellowship of Christians and Jews. She and members of her team and others helped arrange for the dramatic rescue of children and orphans from Ukraine on Sunday, March 6, 2022, amid the tragedy and violence of Russia's attacks on Ukraine, which began on Feb. 24, 2022.\nYet when the war on Ukraine began, Bukiat \"found herself responsible for the lives of the children at the orphanage,\" as well as for the children of two other Jewish families that lived together with the school community — plus her own five children.\nSaid Bukiat, \"We knew the situation [was] very dangerous. We saw that it became even worse in the last day, before we left. We were theoretically ready to take the kids toward the border — but, practically, it was very complicated.\"\nAwakening to the sound of explosions one morning at 5 a.m., Bukiat said she knew she had to evacuate the children immediately.\nAn aerial view shows a residential building destroyed by shelling, as Russia's invasion of Ukraine continues, in the settlement of Borodyanka in the Kyiv region, Ukraine, on March 3, 2022. This image was taken with a drone.(REUTERS/Maksim Levin/File Photo)\n\"When you have to organize a trip of nearly 60 children — not including [your own] children [and other children] — with their basic needs, their documents and the papers from families, and at the same time you have to try to keep them calm and mentally balanced, it is not easy,\" she said.\n\"It took us a couple of hours. We told the kids to take only the most important things: clothes, personal medicines. We prepared some food for the way, as we knew the way was going to be very long,\" she added. \"And we left Zhytomyr, moving to the west, in [a] bus.\"\n\"The [children] were very scared and some of them cried\" during the trip westward.\nThe International Fellowship of Christians and Jews, along with Chabad, planned this rescue mission for these children. The group mapped out the route based on what they knew about the path and the terrain — and about the bombings that were going on in Ukraine.\nBukiat shared that during this bus trip, \"it was very difficult to keep the children calm. They were not used to seeing tanks, military vehicles and soldiers. They were very scared and some of them cried,\" she said.\n\"They needed us to support them, and we had to convey calmness to protect them from trauma.\" The trip took 15 hours, Bukiat said.\nThese Ukrainian children and others were evacuated from the Zhytomyr children's home — and in this image, are shown sheltering in Chernovtsi, in western Ukraine.(The International Fellowship of Christians and Jews)\n\"The traffic jam was endless. Thousands of people were trying to escape to the borders. People were out of gas, food and water,\" she said.\n\"Some of these [travelers] had been [on the road] for three days or more,\" she said, \"hiding from bombs and rockets in the open areas because they couldn’t arrive [at proper] shelters.\"\nShe said that \"in the gas station, each vehicle could buy only 10 liters of gas. Thank God, we had our gas tank full.\"\nADOPTIVE MOM SHARES MESSAGE FOR PUTIN: ‘UKRAINE IS UKRAINE! LET IT BE’\nThroughout this rough journey, things were \"not easy\" for Bukiat, she said. She finally realized that she needed help. So \"I gathered the elder children, ages 14-15, and I [told] them I needed them to take care of the little ones. Everybody got an important role, and they did a fantastic job. We declared that our slogan was ‘everybody for everybody,’ and the children acted according to this principle.\"\nChildren from an orphanage in Zhytomyr (in western Ukraine) are shown here. A rabbi reported that 60 children, ages 6-17, were evacuated on Feb. 24 to Chernivtsi, which is close to the border with Moldova. The children woke up on Feb. 24, 2022, to sounds of explosions. They decided to act immediately to evacuate all the children to a safer region. They tried to organize another bus for Jewish families in Zhytomyr to send them even further west. IFCJ has supported this children's home for many years.(The International Fellowship of Christians and Jews)\nShe said they drove through open areas, \"and it was scary. We passed checkpoints, we met some other people and I could not always be sure if they were harmless or dangerous,\" she added.\"The [journey] was challenging. We prayed a lot.\"\nBukiat said the group then \"finally arrived at the area of the [Carpathian] mountains, where Chabad members rented us a hotel. The first thing we needed\" to do, she said, was \"get some necessities — clothes, toothpaste, shampoo — all the different things that the kids [had left behind, at the orphanage].\"\nPRAYERS FOR UKRAINE: AMERICAN FAITH LEADERS SHARE FERVENT CONCERNS\nAfter that, she said the adults created \"a day program that was the closest we could do to the one they were used to. The best way to calm the children,\" she said wisely, \"was to bring them back to their routine.\"\nSome of the travelers who made their way from an orphanage in western Ukraine, amid the shellings and bombings from Russia, are shown here — with the ultimate goal of safely reaching Israel, where people were waiting to help them and care for them during this traumatic time.(The International Fellowship of Christians and Jews)\nBukiat said that on Sunday, however, she \"began to feel that the situation [had become even] worse than before. We heard more explosions and people who came to the hotel told us that this area wasn't safe anymore. We decided that there was no choice — we [had] to take the kids to the other side of the border.\"\nThe group made its way to Romania, across the border — and Bukiat reported that there, all the children were \"safe.\" From that point, the group prepared to fly to Israel.\nUKRAINE'S ORPHANS ARE TOP OF MIND FOR ADOPTIVE DAD AND HIS ORGANIZATION\nBukiat shared this important note about the treacherous trip: \"You know, I didn’t [see] any difference between my own biological children and the schoolchildren. We were raised on the Jewish brotherhood principle — every Jew is precious to me. You ask me if I was scared at some point. Yes, I was, of course.\"\nThis little one got out of Ukraine safely, with the help of many people and multiple organizations.(The International Fellowship of Christians and Jews)\nYet \"I am a believing woman,\" she added. \"And, you know, you can believe in God and you can fully trust God.\" She said she fully \"trusted God\" and said she felt that \"everything [would] be all right.\"\n\"These innocent children endured days of fear and treacherous travel,\" said members of The Fellowship. The groups worked nonstop for days preparing for the trip.\n\"I shed tears of joy when I heard they crossed the border out of Ukraine,\" said Yael Eckstein.\nOn Sunday, March 6, the children finally arrived in Israel, via several flights. The trip was a joint operation by Israel’s Aliyah and Absorption Ministry, the Jewish Agency, and The Fellowship, the latter group explained.\nThe International Fellowship of Christians and Jews was one of the groups that helped arrange this successful flight amid multiple challenges in Ukraine. Vulnerable Ukrainian children are now being cared for in Israel.(The International Fellowship of Christians and Jews)\nThe Fellowship also told Fox News Digital that it worked tirelessly with government officials to ensure that the children had the travel documentation necessary for the trip.\nUpon arrival, they were greeted by The Fellowship's Eckstein — as well as by Israel Prime Minister Naftali Bennett.\nEVERYDAY UKRAINIANS STRUGGLE TO STAY ALIVE, ARE GRATEFUL FOR HELP, PRAYERS\nThe orphans will be staying, for now at least, at a school campus in Israel. The Fellowship team is providing \"immediate temporary housing and aid for their basic essentials,\" the group said.\nIn total, approximately 300 immigrants made it safely to Israel as part of this overall operation.\nIsrael’s Prime Minister, Naftali Bennett, holds a child who made it safely out of Ukraine amid the war; Bennett is accompanied by his wife, Gilat Bennett.(The International Fellowship of Christians and Jews/Office of the Prime Minister of Israel)\n\"Thank God that generous friends, especially Christians, had already provided over $3 million to help Ukraine's Jews over the last week,\" Eckstein told Fox News Digital earlier.\n\"We are so grateful they've helped us help them — but we're going to need more.\"\nEckstein also told Fox News Digital, \"I followed their evacuation closely from Israel, with anticipation and prayer. I shed tears of joy when I heard they crossed the border out of Ukraine.\"\n\"Now,\" she added, \"The Fellowship is so blessed to be able to bring them home to Israel, where they will be cared for and loved.\"\nShe said her Fellowship group was able \"to do this lifesaving work quickly and effectively because we’ve been on the ground in the former Soviet Union for 30 years.\"\nAdded Eckstein, \"We have the vast network of staff, partners and volunteers to get things done efficiently and effectively, even in a time of war.\"\nShe also said, \"I truly believe that when my father founded The Fellowship nearly 40 years ago, it was leading up to being able to provide people in the greatest need with aid and comfort in a time like this.\"\nMaureen Mackey is managing editor of Lifestyle at Fox News Digital.",
        "scraped_at": "2025-12-28T19:03:44.310660",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/unicef-gives-aid-russia-ukraine-refugees",
        "title": "Half a million children become refugees as Russia-Ukraine war destroys homes and services",
        "publish_date": "March 3, 2022 4:49pm EST",
        "author": "ByCortney D. MooreFox News",
        "content": "Fox News' Benjamin Hall reports on Ukraine's efforts to defend against Russia.\nUNICEF is aiming to raise money to helpchildrenandfamilieswho have become refugees during theRussia-Ukrainewar.\nAbout half a million children have fled Ukraine following Russia’s attacks, according to estimates collected by the United Nations.\nThe intergovernmental peace organization reports that it has verified the deaths of 17 children who were killed from the munition attacks while 30 have been injured. In a press release issued on Thursday, March 3, UNICEF said it’s likely that the child death and injury toll is higher than what’s on record so far.\nOn March 1, 2022, a family travels with small children to the Lviv-Holovnyi railway station in Lviv, Ukraine as the Russia-Ukraine war continues.(UNICEF/Viktor Moskaliuk)\n\"The use of explosive weapons in cities could quickly turn this crisis into a catastrophe for Ukraine’s children,\" said UNICEF Regional Director Afshan Khan, who covers the organization’s Europe- and Central Asia-focused operations.\n\"There are no armed operations of this scale that do not result in children being harmed. The consequences will be tragic,\" Khan continued. \"UNICEF is on the ground, doing its best to meet children’s basic needs, but the only way out of the tragedy unfolding in Ukraine is for the conflict to end.\"\nUKRAINE'S CHILDREN: HOW TO HELP VULNERABLE KIDS AMID RUSSIA'S ATTACK\nHomes, schools, orphanages, health centers and several other essential service providers have been damaged or destroyed along with critical water infrastructure systems in Ukraine, UNICEF reports.\nUNICEF is working with partner organizations to aid refugees with clean drinking water, medical supplies, shelter, sanitation services and education.\nUNICEF Executive Director Catherine Russel speaks to volunteers at the Ukraine-Romania border crossing at Sighetu Marmatiei, on March 2, 2022.(UNICEF/Adrian Câtu)\nThe organization also intends to scale its response to the Russia-Ukraine refugee crisis in neighboring countries by addressing the \"urgent needs of children and families\" who have recently crossed border lines.\nUKRAINIAN PROFESSOR RECALLS COUNTRY'S INDEPENDENCE DAY IN LIGHT OF WAR: 'UKRAINE WILL WIN'\nA part of UNICEF’s relief efforts will go toward building additional \"Blue Dot\" hubs along transit routes, which will serve as \"safe spaces\" where children and mothers can get access to the services they need. So far, the organization has operational Blue Dot hubs in Romania and Moldova.\nUNICEF currently estimates that it will need $276 million to fund its plannedhumanitarianefforts in Ukraine along with an additional $73 million to help Russia-Ukraine refugees in surrounding countries.\nUKRAINIAN YOUTH GROUPS AND SCHOOLS HOLD PRAYER VIGILS, PEACE RALLIES IN RESPONSE TO WAR\nDonations are being accepted on UNICEFUSA.org.\nKarina and her daughter Luna, 3, speak with the UNICEF Regional Director for Europe and Central Asia Afhsan Khan inside the first Blue Dot hub in Romania.(UNICEF/Alex Nicodim)\nUNICEF reports that the Russia-Ukraine refugee crisis could become one of Europe’s largest population displacements since World War II.\nRussia began its invasion of Ukraine on Thursday, Feb. 24. The war is entering its second week.\nCortney Danielle Moore is a writer on the lifestyle team at Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-28T19:03:46.818062",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/ukraine-refugee-children-war-help-kids",
        "title": "Ukraine's refugee children: Amid the war, how to help kids suffering from trauma",
        "publish_date": "March 18, 2022 10:33am EDT",
        "author": "ByAngelica StabileFox News",
        "content": "Tina Hauser, mother of Tyler Hauser, pleads for her son’s safe return and fears she may never see him again.\nAs theRussia-drivenwar continues in Ukraine, thousands of children in that country have been forced — and still are being forced, right at this moment — to leave their homes and venture to safer ground however they can.\nOver 1.5 million children have fled the country since Feb. 24, totaling more than 75,000 kids, UNICEF reported.\nJames Elder, a UNICEF spokesperson, said this week that at each moment, 55 children flee Ukraine. That's almost one child per second.\nDr. Maryam S. Sharifian, a James Madison University assistant professor of education specializing in refugee children, expressed to Fox News Digital her concern for the suffering Ukrainian children as they abandon family members, friends and belongings for a foreign destination that is still, during their treks and travels, unknown to them, in many cases.\n\"We all have heard [of] separation anxiety as a phenomenon during the early childhood stage,\" she said. \"This process is confusing, stressful and difficult to comprehend for children.\"\nA mother in Ukraine cries with her young son before getting a train to Lviv at the Kyiv station, Ukraine, on March 3, 2022. (AP Photo/Emilio Morenatti)\nDr. Sharifian said children exposed to war can exhibit such PTSD symptoms as fear, frustration, anxiety, fluctuation in physical activity, lack of sleep, clinging (to parents, siblings or teachers), decreased concentration, loss of appetite and angry outbursts or tantrums.\nUKRAINIAN REFUGEE CHILDREN FACING DISORIENTATION, EXPLOITATION DURING DANGEROUS TREK FROM HOME\nVarious studies, the doctor also indicated, show that more than half of all children exposed to war trauma exhibit these kinds of PTSD symptoms.\nOne out of every four children attending school have been exposed to an event that can impact learning and behavior, she also said.\nUKRAINIAN PASTOR REMAINS AMID WAR TO HELP THE SUFFERING\n\"War trauma not only affects the current health conditions of children — their future education may also be severely affected by these experiences,\" she said.\nA woman and children taken refuge in a school bomb shelter in Sartana village, which is under the control of the Government of the Donetsk People's Republic, some 11 miles northeast of Mariupol, Ukraine, on March 16, 2022.(AP Photo/Alexei Alexandrov)\nOther professionals such as Fox News medical contributor Dr. Marc Siegel have also expressed concern, highlighting the potential long-term effects of disorientation and exploitation that kids may encounter on the journey far from home.\n\"If the parents show [the children] courage and show them the way forward — kids will respond and they will heal.\"\nDr. Siegel spoke with Save the Children's U.K. senior humanitarian health lead Ayesha Kadir, saying that refugee children face a \"very high\" mortality rate due to these high-stakes elements.\nUKRAINE BOY'S ADOPTION STALLS AMID RUSSIA'S ATTACKS: ‘IT’S MY KID,' ALABAMA MAN SAYS\nBut Siegel said that kids can easily recover through the right therapy.\n\"Kids are resilient,\" he said on\"America’s Newsroom\"last week. \"If the parents show them courage, and they show them the way forward, kids will respond and they will heal.\"\nEven though children are often always the first victims during wartime, Dr. Sharifian also told Fox News Digital that learning from successful strategies in history can help prevent permanent psychological damage.\nStudies in Israel and Syria, for example, explore Building Resilience Intervention (BRI) for students.\nA woman carries a crying child as she arrives at the train station in Zahony, Hungary, on March 5, 2022. (AP Photo/Darko Vojinovic)\n\"Strategies such as enhancing self-esteem, self-efficacy and optimism in children by teaching them decision-making skills, achievable tasks and spirituality have much potential,\" she said.\n\"Resilience is an important factor in preparing them to move on to a healthy and successful future.\"\n\"[Parents] should also help children to identify and label emotions and feelings, express their feelings and ask for help.\"\nThe professor encouraged parents and caretakers of struggling refugee children to establish routines and rituals and have open conversations about safety.\nShe also suggested using relaxation tactics such as breathing exercises, music and exercise.\nEXPLAINING WAR TO KIDS AS RUSSIA INVADES UKRAINE\n\"They should also help children to identify and label emotions and feelings, express their feelings and ask for help,\" she said.\n\"Parents can also role-play and ask children what they would tell a best friend, toy, or stuffed animal to do when they are scared. It is also a practical strategy … to help them navigate their feelings [and] to learn about coping strategies.\"\nCivilians are shown in Irpin, Ukraine, as they continue to flee from Russia's ongoing attacks on the Ukrainian people on March 8, 2022.(Photo by Emin Sansar/Anadolu Agency via Getty Images)\nA variety of organizations have joined in to help spread awareness and take in donations for Ukraine's kids.\nThat includesUNICEF USA and Save the Children;as Fox News Digital has previously reported, the latter provides access to education, psychosocial support, hygiene kits and cash grants to families in need.\nAlso, anyone can donate to the Red Cross during this Russia-Ukraine war —contributions now exceed $9 million for FOX Corporation's supportof the Red Cross in Ukraine.\nAngelica Stabile is a lifestyle reporter for Fox News Digital.",
        "scraped_at": "2025-12-28T19:03:53.331543",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/thousands-ukrainian-children-forcibly-deported-russia-july-us-security-official-says",
        "title": "'Thousands' of Ukrainian children forcibly deported to Russia in July, US security official says",
        "publish_date": "September 22, 2022 8:03am EDT",
        "author": "ByCaitlin McFallFox News",
        "content": "Fox News correspondent Jeff Paul reports from Kyiv, Ukraine where Russian President Vladimir Putin announced ahead of a United Nations summit that he plans to annex new regions in the war-torn nation on 'America Reports.'\nThousands of children wereforcibly deported from Ukraineto Russia in July as part of Moscow’s \"filtration\" operation, a U.S. security official said Thursday.\n\"The United States has information that over the course of July, thousands of children were transferred from Russia-controlled areas of Ukraine to Russia,\" U.S. Ambassador to the Organization for Security and Cooperation in Europe, Michael Carpenter, told sitting officials on the permanent council, including Russia. \"Some of these children have no identity documents or information on the location of their parents.\"\nA Ukrainian soldier walks with children passing destroyed cars due to the war against Russia, in Bucha, on the outskirts of Kyiv, Ukraine, Monday, April 4, 2022.(AP)\nUKRAINE BRACES FOR RUSSIA'S FURY OVER MILITARY LOSSES IN KHARKIV\nCarpenter took direct aim at Russia in his fiery address and said that these children \"have been torn from their families\" by the same government whose \"representatives sit here at this table and prattle incessant lies and propaganda.\"\nThe ambassador’s comments come as occupying forces in Ukraine look to hold \"referendums\" this week in four regions including, Donetsk, Luhansk, Zaporizhzhiaand Kherson in an attempt to annexportions of Ukraine.\nWestern officials and Kyiv have slammed this push as a falsified attempt to justify Russia’s illegal invasion that has left tens of thousands dead and millions displaced, including an estimated 6 million who have fled across neighboring borders, while 7 million are believed to be internally displaced.\nCarpenter said Russia’s push to hold \"sham\"referendums is nothing newand pointed to steps Moscow took in 2014 following its invasion of Crimea and subsequent election which allegedly showed that some 97% of voters supported Russia annexing Crimea.\nPeople with children wait after arrival from the Ukrainian city of Tokmak at a center for displaced people in Zaporizhzhia, Ukraine, Monday, May 2, 2022.(AP Photo/Evgeniy Maloletka)\nPUTIN TO PAY FAMILIES 10,000 RUBLES IN OCCUPIED UKRAINE TO SEND KIDS TO SCHOOL AMID RUSSIAN WAR\nReporting later showed that only30% of Crimeansare believed to have voted, and just 15% actually supported Crimea joining Russia.\n\"We know…that Russia has almost no support in southern and eastern Ukraine and is now being driven out of this territory,\" Carpenter said.\nThe ambassador said Russia’s filtration operation was a \"social engineering\" scheme to allow proxy authorities to clamp down on opposition and dissent in occupied areas of Ukraine.\nReports of arbitrary detentions, torture and deportations have surfaced since the onslaught of the war and de-occupied cities and towns in northern Ukraine have shown additional signs of gross human rights abuses.\nEmergency workers move a body during an exhumation in the recently retaken area of Izyum, Ukraine, Friday, Sept. 16, 2022.(AP Photo/Evgeniy Maloletka)\nCarpenter said the U.S. will never recognize \"cheap parodies of the electoral process.\"\n\"We must all continue to make clear that such propaganda stunts will never be recognized as legitimate,\" he added.\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news.",
        "scraped_at": "2025-12-28T19:03:55.824354",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukrainian-children-death-toll-humanitarian-crisis-food",
        "title": "Ukrainian child death toll mounts, humanitarian crisis worsens with some cities left with 3 to 4 days of food",
        "publish_date": "March 22, 2022 10:35am EDT",
        "author": "ByDanielle WallaceFox News",
        "content": "Brett Velicovich, an Army veteran working with HARP Rescue, joined 'The Next Revolution' to discuss what life is like on the ground in Ukraine as Putin's assault continues.\nThe humanitarian crisis inUkraineis a growing concern as at least 117 children have been killed as of Tuesday, though the true figure is likely higher, and aid organizations estimate areas that have seen some of the most intense fighting have just three to four days of essentials, such as food.\nAccording to its most recent report published Tuesday, the Office of theUnited NationsHigh Commissioner for Human Rights (OHCHR) confirmed at least 925 civilians have been killed and 1,496 have been injured in Ukraine since the onset of the Russian invasion 27 days ago on Feb. 24. Estimates of Russian deaths vary, but even conservative figures are in the low thousands.\nIn an address to Italian Parliament Tuesday, Ukrainian President Volodymyr Zelenskyy said that at least 117 children have died so far in the first 27 days of the war in his country.\nDEFENSE SEC AUSTIN SAYS RUSSIAN CAMPAIGN IN UKRAINE ‘STALLED,’ PUTIN'S STRATEGY FEEDS TROOPS IN ‘WOOD CHIPPER’\n\"And we know that every next day of war will take more lives of our children. 117 is not the final number,\" he said. \"The Russian invasion will still destroy families and destinies.\"\nThat means at least 38 more children have been killed since Zelenskyy spoke at a rally in Florence and to European leaders more than a week ago, urging them to remember the number 79.\n\"Such is the price of procrastination,\" Zelenskyy told Italian parliament of the dozens more children dead. \"Calling for pressure on Russia to stop this cruel war. 117 children, thousands of adults. Thousands of people are injured. Tens of thousands of families devastated. Hundreds of thousands of destroyed destinies. Millions and millions of abandoned homes. And it all started with one man.\"\nUkrainian President Volodymyr Zelenskyy addresses the Italian parliament via video link, in Rome, Tuesday, March 22, 2022.((Roberto Monaldo/LaPresse via AP))\nMore than 70,000 Ukrainian refugees, including some 25,000 children, are currently in Italy, Zelenskyy said, noting in connection to pregnant refugees, that the first Ukrainian baby was born in Italy.\nThe global nongovernmental organization Mercy Corps said Tuesday that one of the largest areas of concern in Ukraine is the vulnerability of the supply chain. Most municipalities that have seen some of the heaviest fighting only have between three and four days of food as \"the humanitarian system is entirely broken down,\" Mercy Corps’ Ukraine humanitarian response adviser, Steve Gordon, told CNN.\nWhile the U.N. has been able to get aid to some areas, humanitarian corridors have been largely blocked and compared to what’s normally a \"high-functioning, coordinated international aid effort\" in other conflict zones, many people in Ukraine are only surviving due to small Ukrainian civil society organizations, including church volunteers, who are coordinating deliveries of food and medical supplies, he said.\nRussian President Vladimir Putin’s forces are increasingly concentrating their air power and artillery on Ukraine’s cities and the civilians living there. Moscow’s invasion has driven nearly 3.5 million people from Ukraine, according to the U.N., with another 6.5 million displaced inside the country.\nU.S. and British officials say Kyiv remains Russia’s primary objective. The bulk of Moscow’s forces remain miles from the city center, but missiles and artillery have destroyed apartment buildings and a large shopping mall, which was left a smoking ruin after being hit late Sunday by strikes that killed eight people, according to emergency officials.\nUKRAINIAN DEPUTY MAYOR OF HOME TO EUROPE'S LARGEST NUCLEAR PLANT ABDUCTED BY RUSSIAN OCCUPYING FORCES\nThe OHCHR said it believes that the actual figures for civilian casualties are considerably higher, especially in territory still controlled by the Ukrainian government and especially in recent days.\nThe U.N. agency said information has been delayed and many reports are pending corroboration from areas where intense hostilities have been going on such as in the southern port city of Mariupol and Volnovakha in the Donetsk region, Izium in the Kharkiv region, Sievierodonetsk and Rubizhne in the Luhansk region, and Trostianets in Sumy region, amid claims of numerous civilian casualties there.\nIn areas like Sumy, there are about 800,000 people \"nearly entirely reliant\" on aid shipped in on a day-to-day basis, Gordon said.\nIn Mariupol, with communications crippled, movement restricted and many residents in hiding, the fate of those inside an art school flattened on Sunday and a theater that was blown apart four days earlier was unclear. More than 1,300 people were believed to be sheltering in the theater, and 400 were estimated to have been in the art school.\nFirefighters try to extinguish a fire amid the destruction caused after shelling of a shopping center, in Kyiv, Ukraine, Monday, March 21, 2022.((AP Photo/ (AP Photo/Rodrigo Abd))\nA woman holds a child in an improvised bomb shelter in Mariupol, Ukraine, Monday, March 7, 2022.((AP Photo/Mstyslav Chernov))\nPeople carry wooden boards to cover the windows of a building damaged by a bombing the previous day in Kyiv, Ukraine, Monday, March 21, 2022. As Russia intensified its effort to pound Mariupol into submission, its ground offensive in other parts of Ukraine has become bogged down. Western officials and analysts say the conflict is turning into a grinding war of attrition, with Russia bombarding cities.((AP Photo/Vadim Ghirda))\nIt is not clear how close Mariupol's capture might be. Ukraine’s Defense Ministry said Tuesday that their forces were still defending the city and had destroyed a Russian patrol boat and electronic warfare complex.\nOver the weekend, Moscow had offered safe passage out of Mariupol — one corridor leading east to Russia, another going west to other parts of Ukraine — in return for the city’s surrender before daybreak Monday. Ukraine flatly rejected the offer well before the deadline.\nMariupol had a prewar population of about 430,000. Around a quarter were believed to have left in the opening days of the war, and tens of thousands escaped over the past week by way of the humanitarian corridors. Other attempts have been thwarted by the fighting. Mariupol's officials said on March 15 that at least 2,300 people had died in the siege, with some buried in mass graves. There has been no official estimate since then, but the number is feared to be far higher after six more days of bombardment.\nZelenskyy’s count of dead children was two more than the 115 total recorded by the Prosecutor General’s Office of Ukraine as of 8 a.m. local time Monday. At least 148 more children had been injured by then, according to the prosecutor’s office. The U.N. said it was still working to corroborate a report from the Head of the Investigative Department of the National Police of Kharkiv Region saying 276 civilians, including 15 children, had been killed in the region as of Monday at 6 p.m. local time.\nThe OHCHR has been documenting civilian casualties in Ukraine since 2014, the same year Russia annexed Crimea, but since the Russian military invaded on Feb. 24, the UN Human Rights Monitoring Mission in Ukraine has been unable to visit places of incidents and interview witnesses and victims.\nAs a result, the U.N. explained that the usual method of corroboration and crosschecking information was disrupted in Ukraine, so the current figures are based on individual civilian casualty records where the \"reasonable grounds to believe\" standard of proof was met.\nThe Associated Press contributed to this report.\nDanielle Wallace is a breaking news and politics reporter at Fox News Digital. Story tips can be sent to danielle.wallace@fox.com and on X:@danimwallace.",
        "scraped_at": "2025-12-28T19:03:58.544627",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/just-evil-top-republican-details-russias-horrific-mass-abductions-ukrainian-children",
        "title": "'Just evil': Top Republican details Russia's 'horrific' mass abductions of Ukrainian children",
        "publish_date": "January 25, 2025 4:00am EST",
        "author": "ByElizabeth ElkindFox News",
        "content": "Trump's special envoy to Russia and Ukraine Keith Kellogg joined 'America's Newsroom' to discuss how he believes the war will eventually end through an economic means amid growing pressure for a peace deal.\nMore than 200,000 children have been abducted by Russia since the start of its invasionof Ukraine, Chairman Emeritus of the House Foreign Affairs Committee Michael McCaul, R-Texas, said, citing U.S. estimates.\n\"If a foreign adversary took 260,000 of our kids, and they were in indoctrination camps, I mean, how would we feel about that?\" McCaul asked Fox News Digital.\nThe Texas Republican was recently term-limited in his time as chairman of the foreign affairs panel, but he is continuing to work on the world stage, in part by raising awareness about Russia’s atrocities in Ukraine. Among the most egregious is the relocation of thousands of Ukrainian children into Russia, the vast majority of whom have not been returned.\nSome parents would be coerced into giving up their children because Russian forces were threatening to bomb their city, McCaul said, while other times \"they just invade and capture the children.\"\nPUTIN, XI VOW TO ‘DEEPEN’ ALLIANCE HOURS AFTER TRUMP RE-ENTERS THE WHITE HOUSE\nRep. Michael McCaul, chairman emeritus of the House Foreign Affairs Committee, left, discussed his efforts to bring awareness to the thousands of Ukrainian children taken into President Vladimir Putin's Russia.(Getty Images)\nThe International Criminal Court issued arrest warrants in February 2023 for Russian President Vladimir Putin and Russia’s commissioner for children’s rights, Maria Lvova-Belova, \"for the war crime of unlawful deportation of [children] and that of unlawful transfer of [children] from occupied areas of Ukraine.\"\nLvova-Belova was sanctioned last year by the U.S. over her part in the scheme, which has been widely condemned by western governments.\nHowever, the Kremlin has denied war crime allegations and maintained it is doing humanitarian work facilitating homes for Ukrainian children,NPR reported.\nExisting accounts from returned children and elsewhere paint a picture of forced indoctrination within Russia’s borders, however. Some of those children are given military training, according to theYale Humanitarian Research Lab, likely in preparation to fight on Russia’s front lines.\nZELENSKYY LAMBASTS PUTIN FOR CHRISTMAS STRIKES: ‘WHAT COULD BE MORE INHUMANE?’\nEmergency services work to rescue civilians trapped under the rubble of a destroyed building after a Russian attack on Zaporizhzhia, Ukraine on Dec. 10, 2024.(Photo by Zaporizhzhia Regional Military Adminstration / Handout/Anadolu via Getty Images)\nEstimates on how many children have been taken to Russia vary between 20,000 to upwards of 250,000.\nPart of McCaul’s work raising awareness about Russia’s treatment of Ukrainian children will include a screening ofa documentary titled, \"Children in the Fire: Ukraine’s War Through the Children’s Eyes\" by filmmaker Evgeny Afineevsky, at the Munich Security Conference next month.\nHe has also worked with the nonprofit Save Ukraine, which is working to return children.\n\"In the documentary, the child's brought into this prison where it looks like adults are being— basically they're using electrodes to shock them, you know, under their fingernails and their genitals, and it's just very, very barbaric,\" McCaul said.\nHe also held a hearing last year on the issue while leading the foreign affairs committee.\nMcCaul said Russia’s abduction of children is among the most vile of its alleged violations of the Geneva Conventions. He compared it to infamous Nazi physician Josef Mengele’s experiments on Jewish children and adults.\nUkrainian President Volodymyr Zelenskyy has led the country through Russia's invasion.(GENYA SAVILOV/AFP via Getty Images)\n\"It's just evil. I mean, any civilization that would capture— I mean, it's one thing if you're on the battlefield killing the enemy, from their point of view,\" McCaul said. \"But to capture the children to re-indoctrinate them is sort of reminiscent of, you know, Mengele’s experiments on kids…And I don't think we've seen anything like this in recent society.\"\nThe House passed a resolution last year condemning Russia’s abduction of Ukrainian children in a bipartisan 390 to 9 vote.\n\"It's just horrific. I can't imagine, as a father, my children being, you know, taken away by the Russian Federation and then not knowing where they are or what's happening to them,\" McCaul said. \"But this is all part of Putin's game, is to try to indoctrinate the children in Ukraine to go against their own country and belief system.\"\nElizabeth Elkind is a politics reporter for Fox News Digital leading coverage of the House of Representatives. Previous digital bylines seen at Daily Mail and CBS News.\nFollow on Twitter at @liz_elkind and send tips to elizabeth.elkind@fox.com",
        "scraped_at": "2025-12-28T19:04:01.158996",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/trump-administration-ends-program-track-kidnapped-ukrainian-children-russia-lawmakers-say",
        "title": "Trump administration ends program to track kidnapped Ukrainian children in Russia, lawmakers say",
        "publish_date": "March 19, 2025 5:44am EDT",
        "author": "ByLandon MionFox News",
        "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nThe U.S. State Department has ended funding for tracking thousands of Ukrainian children abducted by Russia, and a U.S. database with information on the victims may have been deleted, according to a letter U.S. lawmakers plan to send to Trump administration officials on Wednesday.\nA group of Democratic U.S. lawmakers penned the letter to Secretary of StateMarco Rubioand Treasury Secretary Scott Bessent, urging the administration to restore the program that helps track the abducted Ukrainian children.\nThe administration has ended a government-funded initiative led by Yale University's Humanitarian Research Lab that tracked the mass deportation of children from Ukraine, meaning researchers have lost access to a significant amount of information — including satellite imagery — on roughly 30,000 children kidnapped from Ukraine.\n\"We have reason to believe that the data from the repository has been permanently deleted. If true, this would have devastating consequences,\" the letter, led by Ohio Rep. Greg Landsman, said.\nPRESIDENT TRUMP TOUTS 'GREAT' PHONE CALL WITH RUSSIA'S VLADIMIR PUTIN\nA group of Democratic U.S. lawmakers penned a letter to Secretary of State Marco Rubio and Treasury Secretary Scott Bessent.(Reuters)\nNews of the letter came on Tuesday, the same day U.S. President Donald Trump spoke with Russian President Vladimir Putin, who stopped short of agreeing to a 30-day truce in Moscow'swar against Ukraine.\nA person familiar with the tracking program said the canceled State Department contract led to the deletion of $26 million in war crimes evidence.\n\"They took $26 million of U.S. taxpayers money used for war crimes data and threw it into the woodchipper, including the dossiers on all the children,\" the person told Reuters.\n\"If you wanted to protect President Putin from prosecution, you nuke that thing. And they did it. It’s the final court-admissible version with all the metadata,\" the person added.\nThe U.S. State Department has ended funding for tracking thousands of Ukrainian children abducted by Russia.(Celal Gunes/Anadolu Agency/Getty Images)\nThe letter to administration officials also calls for sanctions to punish officials in Russia and its ally Belarus who are involved in abducting children.\n\"These egregious, openly acknowledged violations of the rights of children afforded under international law demand consequences,\" the letter said.\nYale University's Humanitarian Research Lab also no longer has access to the satellite imagery needed to track the abducted children, according to the lawmakers.\n\"Our government is providing an essential service – one that does not require the transfer of weapons or cash to Ukraine – in pursuit of the noble goal of rescuing these children. We must, immediately, resume the work to help Ukraine bring these children home,\" the letter said.\nRUSSIA WANTS ‘IRONCLAD’ GUARANTEE THAT UKRAINE WILL BE BARRED FROM NATO: OFFICIAL\nNews of the letter came on Tuesday, the same day U.S. President Donald Trump spoke with Russian President Vladimir Putin.(Getty Images / Fox News Digital)\nUkraine has described the abductions of tens of thousands of its childrentaken to Russiaor Russian-occupied territory without parental consent as a war crime that meets the U.N. treaty definition of genocide.\nRussia has claimed it has been evacuating people voluntarily to protect vulnerable children from being caught in the crossfire.\nIn March 2023, the International Criminal Court issued warrants for the arrest of Lvova-Belova and Putin in connection with the abduction of Ukrainian children, a move Russia denounced as \"outrageous and unacceptable.\"\nEurojust, Europe's agency for criminal cooperation, said on Tuesday it learned the U.S. government was ending its support for the International Centre for the Prosecution of the Crime of Aggression against Ukraine, which was collecting evidence to prosecute Putin and others. The U.S. special prosecutor at Eurojust, Jessica Kim, would leave as part of the move.",
        "scraped_at": "2025-12-28T19:04:03.958280",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/opinion/sens-klobuchar-grassley-america-cant-ignore-russia-kidnapping-ukrainian-children",
        "title": "SENS KLOBUCHAR AND GRASSLEY: America can't ignore Russia kidnapping Ukrainian children",
        "publish_date": "September 18, 2025 5:00am EDT",
        "author": "BySen. Amy Klobuchar,Sen. Chuck GrassleyFox News",
        "content": "National security expert Andrew Borene breaks down what's next as the president continues to work to end the fighting as Russia escalates attacks.\nLast winter, a Ukrainian mother received the call she had been waiting for: her daughter, taken across the border to Russia months earlier, was finally coming home. When they embraced, the girl hugged tightly, afraid she might be pulled away again. She hardly spoke, afraid to use the Ukrainian language after being forced to speak only Russian.\nThat reunion was a miracle for this mother, but thousands and thousands of parents are still waiting. Just 1,600abducted childrenhave returned home.\nIn the three and a half years since Russian President Vladimir Putin’s unprovokedinvasion of Ukraine, Russia has kidnapped an estimated 20,000Ukrainian children. The real number is likely much higher, because Russia has targeted orphanages and vulnerable kids who may not be identified. It’s also difficult to trace everyone in the midst of war and occupation. Russia itself claims over 700,000 children have been so-called \"evacuated.\"\nUKRAINE’S STOLEN CHILDREN CRISIS LOOMS LARGE AS NATO MEETS ON RUSSIA’S WAR\nThe more time that goes by, the harder it will be to find these kids. Their names and origins are being obscured. Their faces and voices change as they grow up, making them harder to identify. Some are so young they may entirely forget where they came from.\nA new report from Yale University’s Humanitarian Research Lab makes clear just how systematic this program has become. Researchers have identified at least 210 facilities where Ukrainian children have been held across Russia and occupied Ukraine — from summer camps and sanatoriums to cadet schools, a monastery and even a military base. At more than130 of these sites, children undergo forced \"re-education\" programs designed to erase their Ukrainian identity and instill loyalty to Russia. And at nearly 40 locations, children are subjected to military-style training, including grenade-throwing, weapons assembly and drone operation.\nDisturbingly, this Yale report confirms that Putin’s government directly manages more than half of these facilities. Russia’s actions are right out of the KGB’s playbook, when the Soviets deported tens of thousands of women and children from the occupied Baltic countries in the 1940s and all native Crimean Tatars from the Crimean Peninsula.\nToday, these abducted children are given new names, forced into Russian citizenship and adopted into Russian families without consent. They are told to forget their language, their culture and their parents. Those who make it home carry invisible scars: disrupted education, broken trust and a trauma that can last a lifetime.\nWe cannot accept a world where kids are being abducted during war and we cannot allow children to be used as a form of hostage-taking for negotiations. Protecting children in conflict isn’t optional. It’s our humanitarian obligation and it’s a legal requirement under international law.\nAllowing these abductions to stand emboldens future aggressors, undermines international norms and betrays America’s most basic values.\nThat’s why we worked across the aisle to convene a bipartisan coalition of senators to introduce a resolution in May condemning Russia’s actions. Our measure also calls for the unconditional return of abducted Ukrainian children before any peace agreement is signed.\nThe resolution has earned endorsements from faith-based, child protection and human rights organizations, showing that Americans of all backgrounds understand these children’s basic rights.\nOur work to support these kids shows how both parties can come together to speak in one clear voice. We believe this unity tells parents in Ukraine and all over the globe, that America stands with them when theirchildren are in danger. After discussing the issue with EU Commission President Ursula von der Leyen, PresidentDonald Trumpwas right to say that \"it is a subject at the top of all lists\" and that we must work to solve it.\nAlongside the resolution, we introduced the bipartisan Abducted Ukrainian Children Recovery and Accountability Act. This bill does three key things.\nFirst, it enhances support for Ukraine’s efforts to investigate and track the abducted children.\nSecond, it helps those children who do make it back home and need psychological, social and educational support during that difficult transition.\nThird, it reinforces efforts to hold those who commit these crimes accountable, including through sanctions that are aligned with our allies. Ukraine’s prosecutors have opened tens of thousands of war crimes cases, and they need sustained support from us and our allies.\nNo peace can be just and no agreement credible until every child is safely returned. AsFirst Lady Melania Trumpwrote in her letter to Putin ahead of the Alaska Summit: \"it is time\" to end these children’s suffering.\nIt’s unacceptable that these kids are being treated like prisoners of war — used for Putin’s propaganda and forced to do military training and join the ranks of Russia’s army. They must not become pawns used in any negotiations.\nThe mother who was reunited with her daughter was one of the lucky few. Tens of thousands of other parents are still waiting for that same call, for the day they can wrap their arms around their children again. Until then, the world must not look away.\nRepublican Chuck Grassley represents Iowa in the United States Senate.\nDemocrat Amy Klobuchar is the senior senator from Minnesota.",
        "scraped_at": "2025-12-28T19:04:06.754426",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/rescuers-continue-search-kyiv-childrens-hospital-hit-russian-missile",
        "title": "Rescuers continue the search at Kyiv children's hospital hit by Russian missile",
        "publish_date": "July 9, 2024 9:05am EDT",
        "author": "Associated Press",
        "content": "NATO Secretary General Jens Stoltenberg joins ‘Fox & Friends Weekend’ to discuss world leaders attending the NATO summit in Washington D.C. this week.\nRescue operations stretched into a second day at a major Kyiv children’shospital struck by a Russian missile, Ukraine President Volodymyr Zelenskyy said Tuesday, as officials raised the countrywide casualty toll to 42 dead and almost 200 injured in the previous day's intense daytime barrage that smashed into multiple cities.\nZelenskyy said on the social platform X that 64 people were hospitalized in the capital, as well as 28 in Kryvyi Rih and six in Dnipro — both cities in central Ukraine.\nIt was Russia’s heaviest bombardment of Kyiv in almost four months and one of the deadliest of the war, hitting seven of the city’s 10 districts. The strike on the Okhmatdyt children’s hospital, which interrupted open-heart surgery and forced young cancer patients to take their treatments outdoors, drew an international outcry.\nRUSSIAN MISSILES HIT CHILDREN'S HOSPITAL IN KYIV AS UKRAINIAN PRESIDENT ZELENSKYY VOWS RETALIATION\nThe 10-story hospital, which is Ukraine's largest medical facility for children, was caring for some 670 patients at the time of the attack, Okhmatdyt’s Director General, Volodymyr Zhovnir, said Tuesday. The missile hit a two-story wing of the hospital.\n\"The building where we conducted dialysis for children with kidney failure or acute intoxication is ruined entirely,\" he told reporters, estimating the overall damage to the hospital at $2.5 million.\nDanielle Bell, the head of a U.N. team tracking human rights violations in Ukraine, said at least two people were killed at the hospital and some 50 people were injured, including seven children.\nEmergency services work at the site of Okhmatdyt children’s hospital hit by Russian missiles, in Kyiv, Ukraine, on July 8, 2024.(AP Photo/Evgeniy Maloletka)\nThe casualty figure would have been much higher if patients hadn't been taken to a bunker when air raid sirens first sounded, she added.\nAuthorities were working to restore the hospital's power and water supply, Zhovnir said.\nKyiv city administrators declared Tuesday an official day of mourning. Entertainment events were prohibited and flags were lowered in the capital.\nRussia denied responsibility for the hospital strike, insisting it doesn’t attack civiliantargets in Ukrainedespite abundant evidence to the contrary, including Associated Press reporting.\nKremlin spokesman Dmitry Peskov on Tuesday repeated that position, pointing to a Russian Defense Ministry statement that blamed a Ukrainian air defense missile for partially destroying the hospital.\nBell, the head of the U.N. team, dismissed that argument. She said an assessment of video footage and findings on site indicated the hospital \"took a direct hit, rather than receiving damage due to an intercepted weapons system.\"\nThe hospital likely was struck by a Russian Kh-101 cruise missile, Bell said. Ukrainian officials said the same.\nThe bodies of three more people were found Tuesday under the rubble of a residential building in the Shevchenkivskyi district of Kyiv, officials said, bringing the death toll in the single building to 10.\nThe Russian onslaught Monday came on the eve of a NATO summit in Washington where alliance countries are expected to pledge newmilitary and economic support for Ukraine.\nRussian President Vladimir Putin, meanwhile, was hosting India’s Prime Minister Narendra Modi in Moscow.\nNew Delhi’s importance as a key trading partner has grown since the Kremlin sent troops into Ukraine in February 2022.\nZelenskyy was deeply critical of Modi’s visit, saying on X late Monday: \"It is a huge disappointment and a devastating blow to peace efforts to see the leader of the world’s largest democracy hug the world’s most bloody criminal in Moscow on such a day.\"\nMeanwhile, Russian military and regional officials said Tuesday that Ukrainian drones targeted six Russian regions overnight, in what appeared to be a bigger-than-usual aerial attack by Kyiv's forces.\nRussia’s Defense Ministry said air defense systems in five Russian southern and western regions \"destroyed and intercepted\" a total of 38 Ukrainian drones.",
        "scraped_at": "2025-12-28T19:04:09.875969",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/children-traumatized-war-ukraine-mentors-places",
        "title": "Children traumatized by war in Ukraine find mentors from unexpected places",
        "publish_date": "July 31, 2022 11:38am EDT",
        "author": "ByMaureen MackeyFox News",
        "content": "Fox News correspondent Lucas Tomlinson shares what has stood out to him during his time reporting in Ukraine on his last night on ‘Special Report.’\nImagine being a child whose entire home — entire school, entire village, entire way of life,everything— has been brutally destroyed in war.\nThis is the plight ofmany Ukrainian childrenright now.\nAs the Russia-Ukraine war receives less attention than previously, many people have been stepping up to help those less fortunate — and many did so at the outset and have continued to do so.\nRUSSIA-UKRAINE WAR: FAITH LEADER SAYS HUMAN LIFE ‘MORE SACRED THAN LAND OR RESOURCES’\nIn Warsaw, Poland, a 5-year-old girl’s drawing at a summer camp caught the eye recently of one of her counselors.\nWhy did she use black and white, and not red or pink, to make a heart? asked Rabbi Ilana Baird, as the Associated Press reported.\nAfter Russia invaded Ukraine on Feb. 24 of this year, people across Poland sprang into action to welcome and help refugees from the neighboring country.\nThe girl, sighing heavily, said it was black like the dog she left behind in Ukraine.\nRabbi Baird of California volunteered with several other Jews who were originally from Russia or other parts of the former Soviet Union to mentor Ukrainian refugee children at the camp in Warsaw.\nPeople with children wait after arrival from the Ukrainian city of Tokmak at a center for displaced people in Zaporizhzhia, Ukraine, on May 2, 2022.(AP Photo/Evgeniy Maloletka)\nThe program, which ended this past Friday, was created to bring some joy to youngsters traumatized by war, to help prepare them for a new school year in Poland — and to give their struggling and burdened mothers a little bit time to themselves.\nAfter performing puppet shows and reading stories toher group of 5- and 6-year-old campers, painting a lot of little faces and dispensing lots of big hugs, the rabbi saw another heart drawing.\nBaird, 48, was happy to see cheerful colors and rainbows also emerging in the artwork of other children under her care at the Kef Be Kayitz camp, a Hebrew name that means Fun in the Summer.\nA Ukrainian boy stands atop a depleted Russian military tank in Lyiv.(Fox News)\nFor the volunteers, the decision to take time off from their usual jobs in the United States and tofly to Polandto work with Ukrainian children was driven by a desire to help those in need, a value that is universal and a central part of Jewish religious teachings.\n\"Jewish people have suffered so much in the past. We suffered pogroms, we suffered the Holocaust and we suffered anti-Semitism,\" Baird told the AP.\n\"We have a sense of obligation to help people who are suffering right now.\"\n\"And we have a sense of obligation to help people who are suffering right now.\"\nAfterRussia invaded Ukraine on Feb. 24of this year, people across Poland sprang into action to welcome and help refugees from the neighboring country.\nPoland has accepted more of the war’s refugees than any other nation.\nLocal and international Jewish organizations also began working immediately to meet the most urgent needs: to house and feed Ukrainians, most of whom are women and children.\nAMID WAR'S TRAGEDIES, UKRAINE'S KIDS PAINT EGGS TO KEEP ‘LIFE’ GOING\nWith the war soon entering its sixth month, the camp at the Lauder Morasha School in Warsaw has reflected the type of programming being developed to meet the changing needs of refugees.\nA local resident walks next to a house that was destroyed in a Russian shelling in Kramatorsk, Ukraine.(AP Photo/Andriy Andriyenko)\nMany Ukrainians realize they won’t be able to go home soon — or perhaps ever — Helise Lieberman, director of the Taube Center for Jewish Life and Learning, told the AP.\nMornings were devoted to Polish, English and math lessons so the children will be in a stronger position to adapt to school.\nSome Ukrainian refugee mothers need to look for jobs — while others are severely depressed.\nMany of the Ukrainian kids who arrived in Poland since February finished the Ukrainian academic year remotely — but will start at Polish schools in September.\nCampers spent afternoons doing arts and crafts, playing sports and making excursions to city museums and parks.\nAbout a third of the 90 childrenwho attended the camp are Jewish, according to Marta Saracyn, the head of the Jewish Community Center of Warsaw.\n\"It’s a lovely bubble for kids to be kids,\" Saracyn told the AP.\nRefugees with children walk after fleeing the war from neighboring Ukraine at a railway station in Przemysl, Poland, on March 22, 2022.(AP Photo/Sergei Grits)\nSome of the Ukrainian refugee mothers need to look for jobs — while some are severely depressed after being separated from their partners and relatives back home, organizers said.\nThe Taube Center and the Jewish Community Center of Warsaw organized the camp in conjunction with the Jewish Federations of North America, the Jewish Agency for Israel and the American Joint Distribution Committee.\nThe Jewish Federations of North America recruited nearly 90 Russian-speaking educators and rabbinic leaders to help Ukrainian refugees in Poland and Hungary, and 10 helped out at the Warsaw camp, said Hannah Miller, who runs the volunteer program.\n\"You don’t need to be from Ukraine to help others,\" the rabbi said. \"You just need to be human.\"\nThe 10 camp volunteers are Russian-speaking immigrants who left the Soviet Union decades ago, or the children of Russian Jewish immigrants.\nOnly a couple spoke Ukrainian, so they mostly spoke to the children in Russian, which is also widely used in much of Ukraine.\nBaird recalled painting the face of a boy who became upset when he realized she wasn’t from Ukraine.\nIn this photo provided by the Ukrainian Presidential Press Office, Ukraine's president, Volodymyr Zelenskyy, left, listens to a report about the front line in the Donetsk region, Ukraine, on Sunday, June 5, 2022.(Ukrainian Presidential Press Office via AP, File)\n\"Because you don’t need to be from Ukraine to help others,\" the rabbi answered. \"You just need to be human.\"\nSimilarly, an extraordinary journey to bear witness to the struggle and strife of displaced Ukrainians — and to comfort them as well as observe relief efforts on their behalf — took place recently when a group from Temple Emanu-El's congregation on the Upper East Side of Manhattan traveled to the border of Ukraine and Poland.\nThe mission was one of faith, compassion, care and giving.\nNEW YORK CITY TEMPLE MEMBERS TRAVEL TO UKRAINE BORDER TO BRING COMFORT AND ‘BEAR WITNESS’\nWhen most Americans were just beginning to embrace the beginning of summer on Memorial Day weekend, the group from Temple Emanu-El — New York City’s leading Reform Jewish congregation — traveled to Ukraine instead.\nAs Rabbi Joshua M. Davidson told his congregation ahead of the mission, \"Together we will bring much-needed supplies, offer comfort to those fleeing the war — and bear witness both to the suffering and to the extraordinary efforts of the agencies offering relief from that suffering.\"\nRabbi Joshua Davidson described a special mission to the Ukraine border recently to his congregation in New York City during a Friday evening service.(Temple Emanu-El of New York City)\nThe group from Temple Emanu-El brought duffel bags filled with donated supplies from temple members for the desperate Ukrainians who have fled for their lives, said Martin Bell, one of the travelers on the mission.\nEvery place the group went, Bell related to Fox News Digital recently, they saw the relief efforts that had been \"started initially by everyday Poles\" — who have continued to run them to help the displaced Ukrainians, who are mostly women and children.\n\"We also made [the journey] to bear witness to the suffering of the Ukrainian people.\"\nHe said, \"The part about bearing witness — that's what really resonated with me and with everyone in our group. In part, that's maybe a Jewish reaction in a world wherethere are Holocaust deniers,\" said Bell.\n\"We wanted to go there so that we could then come back and tell other people what we saw.\"\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\"It's a story that should be told. It's a story that must be told,\" he also said, as Fox News Digital reported earlier.\n\"We made the journey to bring relief,\" said Rabbi Davidson at a recent Friday evening temple service as he described the mission afterward to the congregation.\n\"But we also made it to bear witness to the suffering of the Ukrainian people, in a world that too often not only turns a blind eye to human suffering but allows it to be written out of history altogether.\"\n\"We just know from our own experience that bearing witness is a sacred duty.\"\nThe Associated Press contributed reporting to this article.\nMaureen Mackey is managing editor of Lifestyle at Fox News Digital.",
        "scraped_at": "2025-12-28T19:04:15.307915",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/ukrainian-children-cancer-evacuated-poland-war",
        "title": "Ukrainian children battling cancer are evacuated to Poland during war",
        "publish_date": "March 22, 2022 10:00am EDT",
        "author": "ByAnn W. SchmidtFox News",
        "content": "The panel reacted to new images depicting a children's hospital being targeted in Putin's assault on Ukraine.\nAs theRussia-Ukrainewar continues, young Ukrainian cancer patients are gettingtreatmentin a safer place.\nMore than 400 Ukrainianchildrenwith cancer have been evacuated to the Unicorn Clinic of Marian Wilemski in Bocheniec, Poland, according to The Associated Press.\nFrom there, stable patients are then placed in one of about 200 hospitals in 28 countries, where they can continue their treatment in safety, AP reported.\nMeanwhile, patients who need more attention are stabilized in Polish hospitals before returning to the clinic. Once they’re able to travel, those patients are also sent on to the hospitals in other countries, according to AP.\nYeva Vakulenko, almost 2 years old, was receiving treatment for leukemia in a Lviv hospital when Russia invadedUkraineon Feb. 24.\nNadia Kryminec holds her 22-month-old granddaughter Yeva Vakulenko, who has leukemia, at a clinic in Bocheniec, Poland, on Thursday, March 17, 2022.(AP Photo/Pawel Kuczynski)\nThe invasion disrupted her treatment and forced her to shelter in the hospital’s basement for hours at a time. Her grandmother and caregiver, Nadia Kryminec, told AP that when doctors gave her granddaughter the opportunity to evacuate to Poland, she immediately took it.\n\"It is very difficult for children to go somewhere in the middle of the night and sit in the basement for a long time,\" Kryminec told AP.\n\"We were told that she was in stable condition, and we should try to go. Otherwise, she is simply doomed to death,\" she added.\nUKRAINE’S REFUGEE CHILDREN: AMID THE WAR, HOW TO HELP KIDS SUFFERING FROM TRAUMA\nAnna Riabiko, from Poltava, Ukraine, also spoke to AP from the Unicorn Clinic. Riabiko was there with her daughter Lubov, who has neuroblastoma, AP reported.\nChildren eat lunch at a clinic in Bocheniec, Poland, on Thursday, March 17, 2022.(AP Photo/Pawel Kuczynski)\n\"Treatment is currently impossible in Ukraine,\" Riabiko told AP. \"Fighting is taking place, there are no doctors, it is impossible to have surgery or chemotherapy. And even maintenance therapy is also impossible to obtain.\"\n\"So we had to look for salvation somewhere,\" she added.\nUKRAINIAN BAKER WHO RAISED $150K FOR HER HOME COUNTRY HELPS FAMILY REACH SAFETY AMID RUSSIA-UKRAINE WAR\nAP reported that St. Jude, the Polish Society of Pediatric Oncology and Hematology, Poland's Fundacja Herosi (Heroes Foundation), and the Ukrainain charity Tabletochki have been working together to evacuate young cancer patients since Russia invaded Ukraine.\nThe Unicorn Clinic of Marian Wilemski in Bocheniec, Poland, on Thursday, March 17, 2022.(AP Photo/Pawel Kuczynski)\nThe World Health Organization said last week that one of the major health challenges resulting from the Russia-Ukraine war is cancer.\n\"Cancer itself is a problem, but treatment interruptions, stress and risk of infection mean that hundreds of children might die prematurely,\" Dr. Roman Kizyma, head of the Western Ukrainian Specialized Children’s Medical Centre in Lviv, said, per AP.\nAP reported that pediatric oncology patients are first stabilized at the Western Ukrainian Specialized Children’s Medical Centre in Lviv before they are sent across the border into Poland.\nThe Associated Press contributed to this report.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nAnn W. Schmidt is an associate on Fox Business' Strategic Initiatives team.",
        "scraped_at": "2025-12-28T19:04:18.287690",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukraines-top-prosecutor-speaks-evil-russian-atrocities",
        "title": "Ukraine's top prosecutor speaks of 'evil' Russian atrocities",
        "publish_date": "April 19, 2023 3:43pm EDT",
        "author": "Associated Press",
        "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nRussia's invading forcesare deliberately using rape, torture and kidnapping to try and sow terror among civilians in Ukraine, the top prosecutor in Ukraine told U.S. lawmakers in graphic testimony Wednesday.\nProsecutor General Andriy Kostin said that nearly 80,000 cases ofwar crimeshave been registered in Ukraine since the war began in February 2022.\nFocusing on just one area of the country that has felt the brunt of the war, Kostin described some of the discoveries made when the Ukrainian military liberated Kherson last November. He said some 20 torture chambers were found and more than 1,000 survivors have reported an array of abuses, including the use of electric shocks, waterboarding, being forced to strip naked, and threats of mutilation and death.\nKostin said more than60 cases of rapewere documented in the Kherson region alone. In areas still controlled by Russian forces, residents, including children, are being forcefully relocated to other occupied territories or to Russia.\nJUDGE DELAYS LEAKED DOCUMENTS SUSPECT JACK TEIXEIRA'S COURT HEARING AFTER DEFENSE ASKS FOR MORE TIME\nThe House Foreign Affairs Committee invited Kostin to testify. The chairman, Rep. Michael McCaul, R-Texas, believes that spotlighting the brutality of Russia's actions will show lawmakers and voters why the United States is in the right in supporting Ukraine.\n\"This is happening right now. They are monsters and they need to be brought to justice,\" McCaul said. He added: \"These are more than war crimes. These are more than crimes against humanity. What we are witnessing in Ukraine is genocide.\"\nMcCaul also issued a challenge to fellow lawmakers, saying \"history will judge us by what we do here and now.\"\n\"No country can remain neutral in the face of such evil,\" McCaul said.\nCongress approved about $113 billion in economic, humanitarian and military spending in 2022 to assist Ukraine.President Joe Bidenhas repeatedly said the United States will help Ukraine \"as long as it takes\" to repel the Russian invasion that began in late February of last year, though support for that aid has softened, polling shows.\nUkrainian Prosecutor General Andriy Kostin listens before testifying at a House Foreign Affairs Committee hearing on war crimes committed by Russia in Ukraine, on April 19, 2023, on Capitol Hill in Washington.(AP Photo/Jacquelyn Martin)\nCongressional leadersanticipate that Ukraine will need billions of dollars in additional assistance in the months ahead.\nOn Tuesday, Ukrainian President Volodymyr Zelenskyy tweeted that he spoke by telephone with House Speaker Kevin McCarthy, R-Calif., and thanked him for bipartisan support from Congress. Zelenskyy also outlined the \"situation at the front\" and Ukraine’s \"urgent defense needs in armored vehicles, artillery, air defense & aircraft.\"\nThe House committeealso heard from a war crimes survivor, a 57-year-old woman, who said she was taken to a torture chamber for five days, beaten, forced to strip and endured threats of rape and murder. At one point, she was forced to dig her own grave. She said her house was looted. She has escaped, but other Ukrainians still experience such treatment in Russian-controlled territories, she said.\n\"These terrible crimes need to be stopped,\" she told lawmakers. Her identity was not revealed out of concerns about retribution.\nKostin said exposing atrocities is not enough.\n\"Only with discovering and determining truth, bringing perpetrators to responsibility and providing adequate reoperations to victims and survivors, we can say justice has been done,\" Kostin said.\nThe International Criminal Courtissued an arrest warrant last month for Russian President Vladimir Putin for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine. But the practical implications are limited as the chances of Putin facing trial at the court are highly unlikely because Moscow does not recognize the court’s jurisdiction or extradite its nationals.",
        "scraped_at": "2025-12-28T19:04:20.895566",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/half-ukraine-children-displaced",
        "title": "Half of Ukraine's children displaced: 'A grim milestone'",
        "publish_date": "March 24, 2022 12:20pm EDT",
        "author": "ByAudrey ConklinFox News",
        "content": "More than 4.3 millionUkrainianchildren — over half of the estimated 7.5 million children in the country — have been displaced due toRussia'swar, according to the U.N.\nThe 4.3 million figure represents more than 1.8 million refugee children who have crossed into neighboring countries and 2.5 million children who are internally displaced withinUkraine.\nA local police officer helps a Ukrainian refugee girl who was apparently separated from her mother on the Moldova- Ukraine border.( Siegfried Modola/ UNICEF)\n\"The war has caused one of the fastest largescale displacements of children since World War II,\" UNICEF Executive Director Catherine Russell said in a Thursday statement. \"This is a grim milestone that could have lasting consequences for generations to come. Children’s safety, wellbeing and access to essential services are all under threat from non-stop horrific violence.\"\nThe Office of the U.N. High Commissioner for Human Rights estimates that 81 children have been killed and 108 have been injured since Russian military forces invaded on Feb. 24., though that figure may be higher.\nThe Lviv Regional Children’s Specialized Clinical Hospital is catering to sick children, including children with cancer, who have fled other regions in the country, seeking safety and treatment.(Viktor Moskaliuk/ UNICEF)\nThe World Health Organization (WHO) reports that Russian forces have executed 52 attacks against Ukrainian health care facilities over the last four weeks, and the Ukrainian Ministry of Education and Science estimates damage to more than 500 education facilities. More than 450,000 Ukrainian children are in need of food and other support, according to UNICEF.\nUKRAINIAN CHILD DEATH TOLL MOUNTS, HUMANITARIAN CRISIS WORSENS WITH SOME CITIES LEFT WITH 3 TO 4 DAYS WORTH OF FOOD\n\"In just a few weeks, the war has wrought such devastation for Ukraine’s children,\" said Russell. \"Children urgently need peace and protection. They need their rights. UNICEF continues to appeal for an immediate cease-fire and for the protection of children from harm. Essential infrastructure on which children depend, including hospitals, schools and buildings sheltering civilians, must never come under attack.\"\nEmpty strollers were placed in neat rows at the central square in Lviv, Ukraine, March 17, to symbolize children killed in the ongoing war.(Aleksey Filippov/ UNICEF)\nUNICEF has so far delivered medical supplies and other necessities to 49 hospitals in nine regions across Ukraine, benefiting some 400,000 people.\nMore than 3.6 million Ukrainians have fled the country since Feb. 24, with most fleeing to Poland, Romania, Moldova, Slovakia, Hungary and Russia.\nAudrey Conklin is a former digital reporter for Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-28T19:04:23.339058",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/us/tennessee-first-state-receive-child-cancer-patients-ukraine",
        "title": "Tennessee becomes first state to take in young Ukrainian hospital patients",
        "publish_date": "March 23, 2022 2:38pm EDT",
        "author": "ByHaley Chi-SingFox News",
        "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nTennessee became the first stateto receive child cancer patients from Ukraine amid the Russian invasion.\n\"Our promise to children with catastrophic diseases extends around the globe, and we are honored to play a part in helping these families move to safety to continue their children’s treatment,\" St. Jude President and CEO James R. Downing said in apress releaseTuesday.\nRUSSIAN ATTACKS ON UKRAINIAN HOSPITALS 'COULD BE WAR CRIMES,' HUMAN RIGHTS LAWYER SAYS\nFour children and their families arrived Tuesday at St. Jude Children's Hospital in Memphis, the first U.S. hospital to take in Ukrainian patients. The children's ages range from nine months to 9 years old.\nThe children and their families traveled aboard a U.S. government-operated medical transport aircraft from Krakow, Poland,where more than 2 million Ukrainian refugees currently reside.\nThe children will receive intensive medical care alongside cancer treatment, including \"trauma-informed psychosocial therapy to address psychological, social, emotional and cultural needs,\" according to the press release.\nA brother and sister arrive at St. Jude Children’s Research Hospital in Memphis after traveling from Ukraine as a part of the St. Jude Global SAFER Ukraine project. The girl is among the first group of Ukrainian pediatric cancer patients to come to the United States to continue their long-term cancer treatment. SAFER Ukraine is a humanitarian effort launched following the Russian invasion to provide safe passage for childhood cancer patients and their families out of Ukraine.(St. Jude)\nUKRAINE REFUGEES FLEEING RUSSIAN INVASION REACHES 2 MILLION, UN SAYS\nSt. Jude said it will develop a school curriculum for the patients and their siblings.\nAfter the start of the war, St. Jude establishedSAFER Ukraine,a humanitarian program to increase the survival rates of children with cancer and other serious diseases. St. Jude said it has assisted more than 600 patients via the program.\nFirst lady Jill Biden's officeannounced Tuesday she will visit St. Jude's hospital in Memphis on Friday to support programs helping pediatric cancer patients, according toFox 13 Memphis. Her office did not specify in the announcement if the first lady will meet with the Ukrainian patients.\nHaley Chi-Sing is a politics writer for Fox News Digital. You can reach her at @haleychising on X.",
        "scraped_at": "2025-12-28T19:04:26.495006",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/premature-babies-ukraine-rescued-ambulance-kyiv-shelling",
        "title": "Premature babies in Ukraine rescued via ambulance escort during Kyiv shelling",
        "publish_date": "March 8, 2022 2:53pm EST",
        "author": "ByCortney D. MooreFox News",
        "content": "Project Dynamo co-founder Bryan Stern and father of the twins Sasha Spektor join 'America's Newsroom' to discuss the 'hard-fought win.'\nThree prematurebabieshave been safely transported fromUkraineto Poland as the Russia-Ukraine war continues.\nProject DYNAMO, an American civilian and allyrescue nonprofitbased in Tampa, launched a mission that successfully evacuated twin baby boys and one baby girl from Kyiv on Monday, March 7.\nThe rescue mission, which the organization is calling \"GEMINI,\" was accomplished with help from two doctors, two neonatal specialists, one nurse and a Ukrainian ambulance crew — and comes 11 days after Russia launched its attack on Ukraine.\nTwo Project DYNAMO volunteers prep the ambulance that transported three premature babies from Ukraine to Poland. The special rescue mission was codenamed 'GEMINI.'(Project DYNAMO)\nUkraine’s capital city Kyiv remains an active war zone as Russian forces continue shelling. Many families have evacuated the city and country as a result.\nHALF A MILLION CHILDREN BECOME REFUGEES AS RUSSIA-UKRAINE WAR DESTROYS HOMES AND SERVICES\nIn a press release, Project DYNAMO wrote that rescue volunteers report that they heard shelling \"within earshot of the hospital\" during their departure.\n\"During operational planning and execution, I was anxious because premature babies, under the best of circumstances in the best hospitals, are fragile and vulnerable,\" Project DYNAMO Co-founder Bryan Stern told Fox News Digital. \"When we put them in a war zone surrounded by Russian artillery and troops, that presents a complicated medical situation and makes it much scarier.\"\n\"From an evacuation perspective, having to move these fragile babies through these war zones by vehicle, is wrought with peril and danger. I'm overcome with joy and happiness to be able to help the family by delivering Lenny and Moishe,\" Stern continued. \"The Project DYNAMO team, in concert with others, all worked together to deliver these bundles of joy to two happy families. Once the operation was complete, with happy parents, I felt like a delivery room doctor introducing children to their parents for the very first time.\nMedical staff and volunteers in Ukraine who worked on Project DYNAMO's rescue mission 'GEMINI' pose for a picture.(Project DYNAMO)\nThe babies that Project DYNAMO evacuated were transported in incubators via ambulance, which received an escort made up of the nonprofit’s volunteers.\nProject DYNAMO describes its team members as \"humanitarians\" and says many of them are \"current and former members of the U.S. military\" who have experience in \"special operations and intelligence communities.\"\nFOREIGNERS WHO FLED UKRAINE AMID WAR WITH RUSSIA NOW HELP OTHERS DO THE SAME\nThe rescue vans traveled more than 700 miles west from Kyiv to Hospital PRO-FAMILIA in Rzeszow, Poland, where the American twin boys and the British baby girl werereunitedwith their families and respective national consular service providers.\nPremature twin babies Lenny and Moishe rescued by Project DYNAMO's mission 'GEMINI.' The babies were transported from Ukraine to Poland.(Project DYNAMO)\nProject DYNAMO reports that the GEMINI mission also led to the safe evacuation of two Ukrainian women and a British couple.\nSo far, the organization reports that 150 civilians have been rescued in 14 missions.\nUKRAINIAN PROFESSOR RECALLS COUNTRY'S INDEPENDENCE DAY IN LIGHT OF WAR: 'UKRAINE WILL WIN'\nThe nonprofit has received more than 14,000 evacuation requests from people around the world in relation to the Russia-Ukraine war, including the U.S., U.K, Canada, France, Romania, Nigeria, Mexico and Afghanistan.\nProject DYNAMO rescue volunteers encounter armed military guarding roads between Ukraine and Poland during its 'GEMINI' rescue mission.(Project DYNAMO)\nProject DYNAMO rescue volunteers for mission 'GEMINI' see blocked streets between Ukraine and Poland.(Project DYNAMO)\nEvacuation requests have also come from \"citizens and residents from other European nations,\" Project DYNAMO wrote in its release, \"many of whom include children and the elderly and members of the Jewish community in Ukraine.\"\nUpdated evacuation numbers from the United Nations state that more than two million people have fled Ukraine since Russia launched its attack on the country on Feb. 24, 2022.\nThe intergovernmental agency estimates that these evacuation numbers could potentially double.\nKYIV ZOO STAFF, FAMILIES HIDE AMID RUSSIA-UKRAINE WAR IN 'ZOO MILITARY COMMUNE'\nA Monday press release from UNICEF says \"hundreds of thousands\" of Ukraine evacuees are children and many of them \"are unaccompanied or have been separated from their parents or family members.\"\nProject DYNAMO volunteers for mission 'GEMINI' see empty streets between Ukraine and Poland.(Project DYNAMO)\nAs the fight between Russia and Ukraine shows no sign of slowing at this time, Project DYNAMO reports that it will continue evacuation operations.\nIt recommends that people in need of help submit Ukraine evacuation requests onprojectdynamo.organd through theU.S. State Department’s Smart Traveler Enrollment Program (STEP).\nThe privately run and donor-funded rescue organization derives its name from \"Operation Dynamo,\" the code name used during the Dunkirk evacuation operations of World War II from 1940.\nCortney Danielle Moore is a writer on the lifestyle team at Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-28T19:04:29.425863",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/entertainment/jessica-chastain-shares-footage-life-changing-ukraine-trip-displaced-children-destruction",
        "title": "Jessica Chastain shares footage from 'life-changing' Ukraine trip showing displaced children and destruction",
        "publish_date": "September 2, 2022 2:36pm EDT",
        "author": "ByPhillip NietoFox News",
        "content": "NSC Strategic Communications Coordinator John Kirby provides an update on the state of Ukraine's nuclear power plant on 'Your World.'\nJessica Chastainrevealed how she felt during her trip to Kiev in which she met with President Volodymyr Zelenskyy amid Ukraine's ongoing war with Russia.\nThe 44-year-old shared footage and a message about the trip on Instagram and Twitter on Thursday, writing she \"needed a few weeks to process everything I saw from my trip to Kyiv.\"\nHer trip started with a four-hourdrive in Poland, where she eventually took another 11-hour train before arriving to the capital.\n\"I was nervous and the length of the journey gave me time to calm myself. I’m going to now start sharing with you guys what I saw,\" she wrote with a video showing destroyed buildings and displaced children. She noted the refugees crisis andinternal displacement Ukraineis suffering from as a result of the invasion.\nUKRAINE NUCLEAR PLANT WORKER SAYS RUSSIA EVACUATED ITS PERSONNEL AHEAD OF ATTACKS ON ZAPORIZHZHIA\nThe actress visited Ukraine President Volodymyr Zelenskyy in early August amid the ongoing war with Russia.\n\"So the number of refugees from Ukraine now stands at 5.1 million who’ve left for the European Union countries, another 7.7 million who are internally displaced,\" Chastain adds. \"The population of Ukraine before the war was 44 million. War crimes have resulted in the deaths of 6,710 civilians, including 359 children; 8,741 civilians, including 700 children, were injured.\"\nChastain's video showed her visiting a local children's hospital and a child giving her a gift.\nUN NUCLEAR TEAM ARRIVES AT UKRAINE'S ZAPORIZHZHIA PLANT AFTER SHELLING DELAYED TRAVEL\n\"One of the experiences from this life-changing trip was my visit to the children’s hospital: Ohmatdyt. I had the opportunity to meet incredible children and the director, Volodymyr Zhovnir. The children amazed me with their hope and strength,\" she told the audience. \"Many had been displaced from their homes and spent months in the hospital. It is a huge humanitarian crisis going on in Ukraine. We can’t forget the innocent ones affected by senseless acts of violence.\"\n\"I am grateful to have met these sweet little kids with big brave hearts.\"",
        "scraped_at": "2025-12-28T19:04:32.356435",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/media/ukrainian-mother-fleeing-country-with-her-son-details-escape-i-wish-i-never-experienced-that",
        "title": "Ukrainian mother fleeing country with her son details escape: 'I wish I never experienced that'",
        "publish_date": "February 27, 2022 8:35am EST",
        "author": "ByBailee HillFox News",
        "content": "Ukrainian citizen and social worker Natalia Gusak joined 'Fox & Friends' to share her story.\nAUkrainianmother is sharing her story of how she and her son fled Kyiv after taking refuge in a bomb shelter as thewar with Russiarages on.\nZELENSKYY SEEKING VOLUNTEERS, CALLS FOR ‘INTERNATIONAL’ TEAM TO FIGHT RUSSIA\nUkrainian citizen and social worker Natalia Gusak joined\"Fox & Friends Weekend\"Sunday to share her experience, detailing her harrowing trek to safety over the weekend as explosions continue to rock various cities across the country.\n\"I wish I never experienced that,\" Gusak said. \"We left… hospital in Kyiv at seven AM in the morning, and we were trying to get to Western Ukraine. Usually it takes around four hours driving, but that day it was around 16 or 14 hours… It was not safe.\"\n\"There were bombings around us and there were explosions,\" she continued.\nGusak explained she was forced to leave the nation's capital in order to receive the necessary medical treatment for her son, who was being treated forCOVID-19.\nREFUGEES FLEEING UKRAINE NUMBER NEARLY 120,000, COULD REACH 4 MILLION AS RUSSIAN INVASION INTENSIFIES: UN\n\"Now I'm getting better and feel myself and my son more safety here because I'm in the Western Ukraine,\" Gusak stated.\n\"It was impossible to get necessary treatment there, so that's why… we left the place, and we were driving to the Western Ukraine just to get any medical support here,\" she continued.\nThe United Nationsestimatesover 150,000 Ukrainians have fled the country to seek safety as Russian forces continue to try to take over the country.\nThat number could climb tofour millionpeople, experts warn.\nUkrainians are fleeing to neighboring countriesPoland, Moldova, Hungary, Romania, and Slovakia.CLICK HERE TO GET THE FOX NEWS APP\n\"It was really dangerous,\" Gusak said. \"And there was traffic jams for kilometers… we were moving so slowly onto this bomb and explosions.\"\nSecretary of State Antony Blinken announced on Saturday the U.S. would continue to support the Ukrainian resistance, sending another $350 million to bolster defense forces.\nBailee Hill is an associate editor with Fox News Digital. Story ideas can be sent to bailee.hill@fox.com",
        "scraped_at": "2025-12-28T19:04:34.807368",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/lifestyle/franklin-graham-ukraine-war-children",
        "title": "Rev. Franklin Graham on Ukraine war: 'Children always suffer the most during war'",
        "publish_date": "May 3, 2022 6:00am EDT",
        "author": "ByMaureen MackeyFox News",
        "content": "Reps. Mike Turner and Seth Moulton discuss what further aid U.S. lawmakers are debating to provide Ukraine with on ‘Special Report.’\nRev. Franklin Graham, CEO and presidentof Samaritan's Purse, told Fox News Digital on Monday evening in an exclusive message, \"It seems children always suffer the most during a war. Nearly two-thirds of all Ukrainian children have been displaced — and I’m sure that many of these boys and girls are wondering if they’ll ever see their homes or be reunited with their fathers again.\"\nHe added urgently, \"They need our prayers.\"\nHe said, \"Samaritan’s Purse is providing medical care in six locations across Ukraine, as well as food and other critical relief supplies — but we also wanted to do something special for these children to let them know that God cares for them and they’re not forgotten.\"\n\"We have prepared and are airlifting 17,500 backpacks to Ukraine on our DC-8 cargo plane.\"\n\"This is why,\" he announced, \"we have prepared and are airlifting 17,500 backpacks to Ukraine on our DC-8 cargo plane.\"\nGraham, the eldest son of Billy Graham and Ruth Bell Graham, is also CEO and president of the Billy Graham Evangelistic Association. He told Fox News Digital as well, \"These book bags give children something to put their belongings in as they flee.\"\n\"We have also put some things inside that will be a blessing to them. We included a stuffed teddy bear that says ‘God Loves You’ in Ukrainian on the front — as well as crayons, a sketch pad, a knit hat, a ball and a booklet in Ukrainian that reminds them God loves them.\"\n\"Please pray that God would protect them and bring an end to this devastating crisis.\"\nThe Christian leader added, \"We need to keep praying for the people of Ukraine. Their lives have been turned upside down and they’re hurting.\"\n\"Please pray,\" he added, \"that God would protect them and bring an end to this devastating crisis.\"\nRev. Franklin Graham (at left) is shown praying with a team of volunteers on the ground in Ukraine during an April 2022 trip to the war-torn country.(Samaritan's Purse)\nSamaritan's Purse, an international Christian relief and evangelism organization headquartered in North Carolina, helps meet the needs of refugees, victims of war and natural disasters, the sick, the poor and the suffering in more than 100 countries.\nThe group on Monday evening shared its latest data — in terms of relief efforts to help the Ukrainian people — with Fox News Digital.\nThe organization is operating six medical sites across Ukraine — \"and our teams of doctors and nurses have treated more than 8,000 patients and performed more than 50 surgeries,\" the group said.\nFranklin Graham (at right) is shown in April 2022 in one of the medical clinics his organization has set up in Ukraine amid the Russia-Ukraine war, which began on Feb. 24, 2022.(Samaritan's Purse)\nIn addition, it has \"airlifted more than 300 tons of emergency relief supplies to Ukraine on 11 airlift missions.\"\nAlso, it is working \"with a network of 3,200 churches to distribute medicine and food, and we have provided more than 580 tons of food to churches in Ukraine and Moldova that are helping people in need.\"\nUKRAINE'S KIDS PAINT EGGS ‘TO KEEP LIFE GOING’\nThe organization has \"assisted 139,000 people in Ukraine, Poland, Moldova and Romania with critical relief supplies including hygiene kits, clothing and bedding materials.\"\nFamilies wait to board a train at Kramatorsk central station as they flee the eastern city of Kramatorsk, in the Donbas region, in early April 2022.(Photo by FADEL SENNA/AFP via Getty Images)\nFinally, \"approximately 100 Ukrainian chaplains serving through the Billy Graham Evangelistic Association are ministering alongside Samaritan’s Purse to provide spiritual and emotional care,\" the organization said.\nREV. FRANKLIN GRAHAM ON EASTER 2022: GOD ‘IS OUR ONLY HOPE’\nOver 7 million people now have been internally displaced since the invasion of Ukraine, according to the second Ukraine Internal Displacement Report issued by the International Organization for Migration (IOM).\nMaureen Mackey is managing editor of Lifestyle at Fox News Digital.",
        "scraped_at": "2025-12-28T19:04:37.309980",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukraines-foreign-minister-accuses-russia-war-crimes-attacks-school-orphanage",
        "title": "Ukraine's foreign minister accuses Russia of 'war crimes' with attacks on school, orphanage",
        "publish_date": "February 25, 2022 10:34am EST",
        "author": "ByAdam ShawFox News",
        "content": "Fox News' Jennifer Griffin reports on the Ukraine capital under siege and NATO's next move.\nUkraine’s foreign minister on Friday accused Russia of \"war crimes\" after he said Moscow had attacked a kindergarten and an orphanage – promising the Ukraine would send evidence of the attacks to The Hague.\n\"Today’s Russian attacks on a kindergarten and an orphanage are war crimes and violations of the Rome Statute,\" Dmytro Kuleba tweeted, referring to the agreement that established the International Criminal Court.\n\"Together with the General Prosecutor’s Office we are collecting this and other facts, which we will immediately send to the Hague,\" he said. \"Responsibility is inevitable.\"\nThe claim came as Russia’s invasion of Ukraine, which Moscow has called a \"special military operation,\" moved in on the capital city of Kyiv.\nRussian troops have enteredthe Obolon district of Kyiv, Ukraine's defense ministry reported early Friday.\nKyiv residents reported loud explosions, theKyiv Independent reported. Ukrainian forces might have shot down a Russian missile in the capital, according to the Ukrainska Pravda news outlet.\nUKRAINE CAPITAL KYIV UNDER HEAVY RUSSIAN ATTACK\nThe Kremlin said Friday, via a Russian state-run news agency, that Russian President Vladimir Putin is prepared to send a delegation to negotiate with Ukrainian officials over the country's \"neutral status.\"\nThat was in response to a Friday morning message from Ukrainian President Vladimir Zelenskyy, who said he was \"not afraid\" to engage in talks with Russia, if it could halt the Russian invasion of Ukraine.\n\"We heard from Moscow today that they want to talk about the neutral status of Ukraine,\" Zelenskyy said. \"We are not afraid of Russia, we are not afraid of engaging in talks with Russia, we are not afraid of discussing anything, such as security guarantees for our state, we are not afraid of talking about neutral status.\"\nA damaged residential building on Koshytsa Street, a suburb of the Ukrainian capital Kyiv, where a military shell allegedly hit, on Feb. 25, 2022. (Daniel Leal/AFP via Getty Images)\n\"Fighting is ongoing all over Ukraine. Let's sit at the table for negotiations to stop people dying,\" Zelenskyy continued.\nMeanwhile, the U.N.’s human rights office says it is receiving increasing reports of civilian casualties in Ukraine in the wake of Russia’s military invasion.\nA spokesperson for the U.N. High Commissioner for Human Rights says it has so far verified at least 127 civilian casualties. They include 25 people killed and 102 injured, mostly from shelling and airstrikes. They warned that the numbers are \"very likely to be an underestimate.\"\nThe Associated Press contributed to this report.\nAdam Shaw is a politics reporter for Fox News Digital, primarily covering immigration and border security.\nHe can be reached atadam.shaw2@fox.comor onTwitter.",
        "scraped_at": "2025-12-28T19:04:39.814519",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/world-leaders-react-to-bucha-ukraine-massacre-russia-blamed",
        "title": "World leaders react to Bucha, Ukraine massacre: ‘Genocide’, ‘Despicable’, ‘Dreadful’",
        "publish_date": "April 4, 2022 12:33pm EDT",
        "author": "ByGreg NormanFox News",
        "content": "Fox News senior strategic analyst and retired Gen. Jack Keane spoke with ‘America's Newsroom’ about civilian killings in Bucha and Putin’s strategy to control Ukrainian energy resources.\nWorld leaders are reacting with outrage Monday as evidence is emerging of what appears to bedeliberate killings of Ukrainian civiliansby the Russian military in cities like Bucha.\nUkrainian President Volodymyr Zelenskyy, who visited Bucha Monday, described the grisly acts as \"war crimes\" that \"will be recognized by the world as genocide.\"\nRussia, meanwhile, is continuing to claim its military had nothing to do with deaths of the civilians, some of which were recently found dead with their wrists bound and with bullet wounds in their head.\nTanya Nedashkivs'ka, 57, mourns the death of her husband, killed in Bucha, on the outskirts of Kyiv, Ukraine, on Monday.(AP/Rodrigo Abd)\nHere is how the world is reacting to the massacre in Bucha and the discovery of what Ukraine says is the bodies of 410 civilians in towns around the capital, Kyiv, that were recaptured from Russian forces in recent days:\nGRAPHIC IMAGE WARNING:Volunteers carry the bodies of murdered civilians in Bucha on Monday.(AP/Efrem Lukatsky)\nDespite the chorus of criticism, Russia is urging world leaders to exercise restraint when it comes to talking about Bucha.\nUkrainian President Volodymyr Zelenskyy examines the site of a recent battle in Bucha, close to Kyiv, Ukraine, on Monday.((AP Photo/Efrem Lukatsky))\n\"This information should be seriously doubted. From what we have seen, the video material can’t be trusted, as our specialists from the Defense Ministry detected signs of video forgery and various fakes,\" Kremlin spokesman Dmitry Peskov claimed, despite a steady stream of pictures from news agencies confirming the death and destruction.\n\"The facts, the chronology of events also doesn’t speak in favor of the credibility of these claims... We would require many world leaders not to rush with statements, groundless accusations,\" Peskov added.\nThe Associated Press contributed to this report.\nGreg Norman is a reporter at Fox News Digital.",
        "scraped_at": "2025-12-28T19:04:42.112966",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/strikes-ukraine-hospital-kills-2-day-old-baby-officials-say",
        "title": "Strikes on Ukraine hospital kill 2-day-old baby, officials say",
        "publish_date": "November 23, 2022 9:23am EST",
        "author": "ByCaitlin McFallFox News",
        "content": "Fox News senior foreign affairs correspondent Greg Palkot provides insight into Ukraine's power supply being negatively impacted by Russian attacks on 'Fox News Live.'\nOvernight strikes destroyed aUkrainian maternity hospitaloutside of the city of Zaporizhzhia, officials confirmed Wednesday, killing a 2-day-old baby boy.\nThe mother and doctor, believed to have been alone in the hospital, were pulled from the rubble of the maternity ward in the city of Vilniansk – the latest medical facility to have fallen target to Russian strikes, according to the regional governor.\n\"At night, Russian monsters launched huge rockets at the small maternity ward of the hospital in Vilniansk. Grief overwhelms our hearts – a baby was killed who had just seen the light of day. Rescuers are working at the site,\" Gov. Oleksandr Starukh said on Telegram.\nRescuers work at the site of a maternity ward of a hospital destroyed by a Russian missile attack in Vilniansk, Zaporizhzhia region, Ukraine, Nov. 23, 2022.(Reuters/Stringer)\nMOSCOW CONDEMNS US RESPONSE TO ALLEGED WAR CRIMES AGAINST RUSSIAN SOLDIERS IN UKRAINE\nFox News could not verify who officially was responsible for the rocket fire that fell on the maternity ward, but the attack comes as U.K. defenseofficials on Wednesday warned Russian commandersare using Iranian-supplied drones to target medical facilities.\n\"Russia has largely used these weapons against tactical military targets and the Ukrainian electricity grid,\" the British defense ministry said in a briefing update. \"However, recently Russian commanders likely also wanted Iranian-sourced UAVs to prioritize medical facilities as targets of opportunity, and strike them with guided munitions if identified.\"\nRussia’s strategy of attackthroughout the war has relied on hitting civilian targets, including maternity and other medical facilities.\nThe world was first alerted to the strategy during a March 9 attack when Russian missiles struck a maternity hospital in Mariupol, killing three and injuring dozens. Pictures surfaced showing mothers in labor being carried on stretchers through piles of rubble and scorched debris.\nUkrainian emergency employees and volunteers carry an injured pregnant woman from the damaged maternity hospital in Mariupol, Ukraine,(AP Photo/Evgeniy Maloletka)\nRUSSIA, IRAN REACH DEAL TO MAKE DRONES ON RUSSIAN SOIL FOR UKRAINE WAR: REPORT\nThe World Health Organization announced in mid-October that Russia had attacked over 600 medical facilities since February.\nIt is not just the threat of rocket fire that medical officials have to contend with, but Russia’s bombardment of Ukraine’s electrical infrastructure.\nNationwide blackouts have darkened communities across Ukraine for months, but war-torn areas like Zaporizhzhia and Kherson have forced medical workers to work without running water or electricity.\n\"Breathing machines don’t work, X-ray machines don’t work,\" Volodymyr Malishchuk, the head of surgery at a children’s hospital in Kherson city told The Associated Press. \"There is only one portable ultrasound machine and we carry it constantly.\"\nMedical officials said they were forced to carry a sedated 13-year-old boy up six flights of stairs to amputate an arm after he was injured during shelling this week.\nUkrainian soldiers fire artillery at Russian positions near Bakhmut, Donetsk region, Ukraine, Sunday, Nov. 20, 2022.(AP Photo/LIBKOS)\nMissile fire has reportedly increased in Kherson since Russia’s withdrawal nearly two weeks ago.\nAccording to Malishchuk, three children wounded by Russian strikes were admitted to the hospital this week alone – a figure that is half as many as the total number of children admitted in Kherson during all nine months of the war.\nThe Associated Press contributed to this report.\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news.",
        "scraped_at": "2025-12-28T19:04:44.588864",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/300-dead-mariupol-theater-russian-attacks",
        "title": "Ukrainian officials say 300 dead in Russian airstrikes on Mariupol theater sheltering children",
        "publish_date": "March 25, 2022 11:09am EDT",
        "author": "ByAudrey ConklinFox News",
        "content": "Bill Hemmer discusses Russia's indiscriminate shelling in effort to wear down Ukrainians on 'The Story.'\nOfficials representing Mariupol, a Ukrainian port city devastated byRussianmissile attacks, announced Friday that some 300 people have died after Russian forces attacked a theater sheltering civilians on March 16, citing eyewitnesses.\nRussian forces bombed the theater whereMariupolofficials claim thousands of civilians had taken refuge. Satellite footage shows the word for \"children\" written in Russian on the ground near the theater in an apparent signal to airborne Russian soldiers not to attack.\nThe word \"children\" is written in large white letters (in Russian) in front of and behind the Mariupol Drama Theater, which was bombed on March 16, 2022.(Satellite image (c) 2022 Maxar Technologies/Getty Images)\n\"Unfortunately, we start the day with bad news,\" a Telegram message from Mariupol's official government page reads. \"Eyewitnesses reported that about 300 people died in the [Donetsk Regional Drama Theatre] as a result of bombing by a Russian plane.\"\nOfficials said the theater had been a staple in the coastal community before Russia invaded Ukraine on Feb. 24, and it became \"the last refuge for hundreds of innocent people,\" calling Russian forces \"fascists of the 21st century\" who were \"not stopped by the inscription of CHILDREN.\"\nThe drama theater, damaged after shelling, in Mariupol, Ukraine, March 17, 2022(Azov Battalion via AP)\n\"There can be no explanation for this inhuman cruelty. There will never be forgiveness for those who brought destruction, pain and suffering to our home,\" officials said in the Telegram post.\nRUSSIAN FORCES BOMBED MARIUPOL THEATER DESPITE SIGNS WARNING CHILDREN WERE SHELTERING INSIDE\nDmytro Kuleba, Ukraine's foreign affairs minister, called the attack a \"horrendous war crime\" in a Wednesday tweet.\n\"Massive Russian attack on the Drama Theater where hundreds of innocent civilians were hiding,\" he wrote. \"The building is now fully ruined. Russians could not have not known this was a civilian shelter. Save Mariupol! Stop Russian war criminals!\"\nMariupol's deputy mayor, Sergei Orlov, told the BBC that between 1,000 and 1,200 people had sought refuge in the building.\nMariupol has been rocked by devastatingRussian attacksover the past several weeks. Airstrikes and shelling have previously hit a maternity hospital, a church and apartment towers in the city, leaving civilians without electricity, heat, water, food, cellphone signal and internet. There have also been reports of Russian forces blocking aid and evacuation buses from entering the strategically located city on the Black Sea.\nAudrey Conklin is a former digital reporter for Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-28T19:04:47.113779",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukraine-children-killed-wounded-russian-invasion",
        "title": "85 children killed in Ukraine, more than 100 wounded since start of Russian invasion, Ukrainian official says",
        "publish_date": "March 13, 2022 10:24am EDT",
        "author": "ByStephen SoraceFox News",
        "content": "Fox News medical contributor Dr. Marc Siegel addresses the impact on Ukrainian children fleeing devastated cities.\nRussia’s invasion of Ukrainehas killed 85 children and wounded more than 100 others, a Ukrainian official said Sunday.\nThe casualties come asRussia’s\"deliberate and brutal shelling of civilians continues,\" Ukraine Prosecutor General Irina Venediktovasaid in a tweet. She said that 369 educational institutions have also been damaged, 57 of which were destroyed in attacks.\nPope Francisresponded to the bloodshed inUkraineon Saturday, calling for an end to the war and emphasizing the impact on children.\n\"Never war! Think first about the children, about those who are deprived of the hope for a dignified life: dead or wounded children, orphans, children who play with the remnants of war,\" Francistweeted.\nAs of Friday, theUnited Nation’s office of Human Rights saidit has recorded 42 children dead among the 579 civilians killed, with 54 more children wounded among the 1,002 civilians injured.\nAnastasia Erashova cries as she hugs her child in a corridor of a hospital in Mariupol, eastern Ukraine on Friday, March 11, 2022. Anastasia's other child was killed during the shelling of Mariupol. (AP Photo/Evgeniy Maloletka)\nThe 1,581 civilian casualties were mostly caused by shelling and airstrikes, according to the U.N., which noted that the actual toll is much higher.\nIn one of thelatest attacks, an airstrike Saturday nightreportedly hit an Orthodox Christian monasteryin Ukraine’s Donetsk region that was sheltering hundreds of refugees, including about 200 children.\nDonetsk governor Pavlo Kyrylenko said nearly 1,000 people were in the monastery Saturday when it was hit by \"Russian planes and artillery.\"\n\"As a result, one person was hospitalized, two went to the emergency room in Slovyansk on their own; another 30 people, who received minor injuries, were treated on the spot,\" Kyrylenko posted on Telegram, according to an English translation.\nFox News’ Emma Colton contributed to this report.",
        "scraped_at": "2025-12-28T19:04:49.380607",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/refugees-fleeing-ukraine-reaches-2-5-million-many-children-un-says",
        "title": "Ukraine refugee numbers reach 2.5 million, many children, UN says",
        "publish_date": "March 11, 2022 5:31am EST",
        "author": "ByBrie StimsonFox News",
        "content": "Fox News' Alex Hogan reports from Medyka, Poland on the humanitarian crisis\nAt least 2.5 millionrefugeeshave fledUkrainesinceRussiainvaded late last month as of Friday, according to Filippo Grandi, the United Nations High Commissioner for Refugees.\nThat number includes more than 1 million children.\nGrandi said the organization also estimates that about two million people have been displaced within Ukraine. \"Millions forced to leave their homes by this senseless war,\" he tweeted Friday morning.\nUkrainian refugees wait at Przemysl train station, southeastern Poland, on Friday, March 11, 2022. Thousands of people have been killed and more than 2.3 million have fled the country since Russian troops crossed into Ukraine on Feb. 24.(AP Photo/Petros Giannakouris)\nUKRAINE'S ‘CELLAR VIOLINIST’ PLAYS ON AS SHE SHELTERS FROM BOMBS\nThe International Organization for Migration said that around 1.5 million of the refugees have gone to Poland while others have fled to Moldova, Romania, Slovakia and Hungary.\nRefugees wait in a crowd for transportation after fleeing from the Ukraine and arriving at the border crossing in Medyka, Poland, Monday, March 7, 2022. (AP Photo/Markus Schreiber, File)\nSome refugees have reported seeing Russian troops target fleeing civilians.\n\"The Russians promised to provide a (humanitarian) corridor, which they did not comply with. They were shooting civilians,\" Ihor Diekov, who crossed the Irpin River outside Kyiv with others on the wooden planks of a makeshift bridge after Ukrainians blew up the concrete span to slow the Russian advance, said. \"That’s absolutely true. I witnessed it. People were scared.\"\nRefugees stand in a group after fleeing the war from neighboring Ukraine at the border crossing in Palanca, Moldova, Thursday, March 10, 2022.(AP Photo/Sergei Grits)\nHe said he heard gunshots and saw dead bodies on the road.\n\"Yes, I saw corpses of civilians,\" refugee Ilya Ivanov, who fled from Sumy, said. \"They shoot at civilians with machine guns.\"\nThe Ukrainian government has accused the Russians of violating temporary ceasefires that the countries had agreed to in order to let civilians leave besieged areas through humanitarian corridors.\nThe Associated Press contributed to this report.",
        "scraped_at": "2025-12-28T19:04:51.925043",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/nearly-50-children-from-russian-occupied-regions-ukraine-arrive-belarus",
        "title": "Nearly 50 children from Russian-occupied regions in Ukraine arrive in Belarus",
        "publish_date": "September 19, 2023 12:53pm EDT",
        "author": "Associated Press",
        "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nBelarusian state media reported that 48 children from Ukraine arrived in Belarus on Tuesday from Ukrainian regions which Moscow claims it has annexed.\nThe group of children came from the occupied Donetsk, Luhansk and Zaporizhzhia regions. They include children from towns which were captured by theRussian armyin July 2022. Those regions were illegally annexed by Moscow in December last year, but Russia doesn't have full control over them.\nIn photos published by the Belarus state news agency Belta, the children were pictured holding the red and green state flag of Belarus and reportedly thanked the Belarusian authorities, while being flanked by police and riot police.\nRUSSIAN TROOPS WITHDRAW FROM NORWAY BORDER IN DROP SINCE START OF UKRAINE WAR: OFFICIAL\nThe removal of the childrenfrom Ukrainewas organized by a Belarusian charity, supported by President Alexander Lukashenko, which has previously organized health recuperation programs for Ukrainian children in Belarus.\n\"The president, despite external pressure, said this important humanitarian project should continue,\" Alexei Talai, the charity's head, said in an interview with the Belarus state news agency Belta. \"All the Belarusian people,\" he said want to help \"children from dilapidated cities and towns in the new territories of Russia.\"\nDozens of children from several occupied Ukrainian regions have arrived in Belarus.(Fox News)\nBelarusian officials have previously denied allegations that Belarus has helped to illegally remove children from Ukraine.\nIn June, Belarusian opposition figures gave the International Criminal Court materials which they said showed more than 2,100 Ukrainian children from at least 15 Russian-occupied Ukrainian cities who were forcibly removed to Belarus with Lukashenko's approval.\nWAGNER WARLORD’S REPORTED DEATH IS STRAIGHT OUT OF PUTIN’S BLOOD-SPILLING PLAYBOOK\nPavel Latushka, a formerBelarusian culture minister, hopes the material will prompt the ICC to issue an arrest warrant for Lukashenko, as it did with Russian President Vladimir Putin.\n\"We are seeing more and more evidence relating to the illegal transfer of Ukrainian children to Belarus and this will continue until international organizations react and stop Minsk,\" Latushko said in an interview with The Associated Press.\nIn March, the ICC issued arrest warrants for Putin and Russia's children's rights commissioner, Maria Lvova-Belova. Judges in The Hague, Netherlands, said they found \"reasonable grounds to believe\" the two were responsible for war crimes, including the illegal deportation and transfer of children from occupied Ukrainian regions to Russia.\nBelarus has been Moscow’s closest ally since the Russian invasion began in February 2022, when Lukashenko allowed the Kremlin to send troops and weapons into Ukraine from Belarus. Russia has also deployed tactical nuclear weapons there.",
        "scraped_at": "2025-12-28T19:04:54.486045",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukraine-rescue-team-brings-back-31-children-russia-war",
        "title": "Ukraine rescue team brings back 31 children from Russia amid war",
        "publish_date": "April 10, 2023 1:03pm EDT",
        "author": "Associated Press",
        "content": "Check out what's clicking on Foxnews.com.\nThe head of a Ukrainian rescue organization said Saturday that the organization has brought back 31 childrenfrom Russia, where they had been taken during the war.\nMykola Kuleba said at a news conference in Kyiv that the children were expected to arrive in the capital later in the day. Kuleba is the executive director of the Save Ukraine organization and is the presidential commissioner for children's rights.\nDeportations of Ukrainian children have been a concern since Russia’s Feb. 24, 2022, invasion of Ukraine. The International Criminal Court increased pressure on Russia when it issued arrest warrants on March 17 for President Vladimir Putin and Russian children's rights commissioner Maria Lvova-Belova, accusing them of abducting childrenfrom Ukraine.\nUKRAINE PREPARES FOR RUSSIAN SPRING OFFENSIVE\nRussian children's rights commissioner Maria Lvova-Belova holds a press conference on April 4, 2023, following accusations that Russia was abducting children from Ukraine and setting them up for adoption in the country.(Ulf Mauder/picture alliance via Getty Images)\nThe International Committee of the Red Cross said this week it had been in contact with Lvova-Belova, the first confirmation of high-level international intervention to reunite families with children who were forcibly deported.\nICRC spokesman Jason Straziuso said the organization was in contact with Lvova-Belova \"in line with its mandate to restore contact between separated families and facilitate reunification where feasible.\"\nLEAKED PENTAGON DOCUMENTS PAINT GRIM PICTURE OF UKRAINIAN AIR DEFENSE SUPPLIES, MAY ONLY LAST A MONTH\nAn Associated Press investigation revealed Lvova-Belova’s involvement in the abductions and found an open effort to put Ukrainian children up for adoption in Russia.\nLvova-Belova told an informal U.N. Security Council meeting Wednesday thatthe childrenwere taken for their safety, not abducted — a claim widely rejected by the international community.\nThe exact number of Ukrainian children taken to Russia has been difficult to determine, and numbers from the warring countries differ vastly.\nA statement posted Wednesday on Twitter by Ukraine’s U.N. ambassador, Sergiy Kyslytsya, said more than 19,500 children had been seized from their families or orphanages and forcibly deported.",
        "scraped_at": "2025-12-28T19:04:56.903466",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/russian-attacks-on-ukrainian-hospitals-could-be-war-crimes-lawyer-says",
        "title": "Russian attacks on Ukrainian hospitals 'could be war crimes,' human rights lawyer says",
        "publish_date": "March 4, 2022 2:09pm EST",
        "author": "ByJon Michael RaaschFox News",
        "content": "Russian attacks hitting Ukrainian hospitals may amount to war crimes, human rights lawyer says.\nRussian attacks on Ukrainian hospitals and medical staff may amount to war crimes, a human rights lawyer told Fox News.\nHundreds of civilians have been killed since Russian forces started bombing populated areas acrossUkraine, according tonumerous reports. At least one cluster munition strike hit a hospital, killing four and injuring 10.\n\"There were two children, I believe, who were killed and two others and six injured because of the explosive force of the bomb,\" said Leonard Rubenstein, the director of Johns Hopkins University's Program on Human Rights, Health and Conflict.\n\"The law is very simple and clear and goes back 150 years that it's illegal to attack a hospital, a patient, medical staff,\" he told Fox News. \"In fact, they're war crimes.\"\nKHARKIV WOMAN DESCRIBES SHELTERING FROM MISSILES, OPTS TO STAY IN THE CITY TO AVOID LEAVING FAMILY BEHIND\nThe first Geneva Convention in 1864 outlawed assaults on medical personnel on the battlefield. Since then,Russiahas avoided punishment despite repeatedly violating these terms, according to Rubenstein.\nA view of damaged building after the shelling is said by Russian forces in Ukraine's second-biggest city of Kharkiv on March 3, 2022.(Photo by SERGEY BOBOK/AFP via Getty Images)\n\"Russia has a long history of attacking hospitals,\" thehuman rightslawyer told Fox News. \"They did it in Chechnya, attacked multiple hospitals in the capital during the war in there 20 years ago.\"\n\"More recently, in Syria, they targeted hospitals in Idlib, in the northwest, in Aleppo and destroyed many hospitals,\" Rubenstein added.\nThe United Nationsfoundthat \"pro-government\" forces in Syria carried out aerial and ground attacks in 2020 on civilian markets, refugee camps, and most notably hospitals. The attacks on civilian populations included the use of cluster munitions, similar to the Russian use of cluster munitions on Ukrainian civilian areas, according to the report.\nCluster munitions are explosives that contain smaller bombs. They can strike wide areas and raze entire civilian neighborhoods.\nThis image released by the Syrian Presidency shows Russian President Vladimir Putin, center, meeting with Syrian President Bashar Assad, right, in Damascus, Syria on Tuesday, Jan. 7, 2020.(Syrian Presidency via AP)\n\"The pattern of indiscriminate attacks amounts to a war crime just as a deliberate attack is,\" Rubenstein said. \"So if these are confirmed after investigation – and of course, we don't have those investigations yet – they could be war crimes.\"\nUKRAINIAN MP WARNS KYIV WILL BE 'NEXT ALEPPO,' CALLS ON WEST TO STEP UP AS HORRIFIC IMAGES EMERGE\nWhen hospitals are attacked, the people who suffer most are the patients, Rubenstein told Fox News.\n\"As long as the fighting goes on in the cities, they will not be able to get staff to come to work, patients won't be able to get there, supplies won't be able to get there,\" he said.\nSome of the most commonly forgotten war casualties are those with chronic diseases who cannot receive treatment, he said.\nChildren patients whose treatments are underway hold papers with the words \"no war\" written in them, at the hallways of the basement floor of Okhmadet Children's Hospital, as Russia's invasion of Ukraine continues, in Kyiv, Ukraine February 28, 2022. REUTERS/Umit Bektas\n\"People in need of care don't come,\" Rubenstein said. \"Their condition gets worse, and they may even die just for fear of coming to a hospital that can be attacked.\"\nStill, Rubenstein pointed to a silver lining.\n\"In Ukraine, there's actually an opportunity, because unlike in other cases, this case could go to the International Criminal Court without going through the Security Council, where Russia has a veto,\" he told Fox News.\nRussia has vetoed more votes on the U.N. Security Council than any other member, according to awatchdogreport. Recently, Russia hasblockedinvestigations into war crimes committed in the Syrian civil war.\n\"Here, the criminal court has already started an investigation because it has the power to do so and these attacks on hospitals have to be included in that investigation,\" Rubenstein said.",
        "scraped_at": "2025-12-28T19:05:00.248403",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/russia-denies-bombed-childrens-hospital-fake-news",
        "title": "Russia denies it bombed Ukrainian maternity hospital: 'fake news'",
        "publish_date": "March 10, 2022 5:41am EST",
        "author": "ByLawrence RichardFox News",
        "content": "Fox News correspondent Bryan Llenas describes the Russian bombing of a maternity and children’s hospital in the Ukrainian port city of Mariupol. WARNING: Graphic images in this video\nRussiahas denied claims that it bombed a Ukrainian children’s hospital in Mariupol, after reports surfaced claiming that 17 people were injured in such an attack on Wednesday.\nDmitry Polyanskiy, Russia's permanent representative to theUnited Nations, admitted on Twitter Thursday that the structure was bombed by Russian forces but said that it was no longer operating as a hospital but was being used by the Ukrainianmilitaryto house forces.\nDEADLY RUSSIAN AIRSTRIKE ON HOSPITAL DENOUNCED AS 'DEPRAVED' AND 'UNCONSCIONABLE': LIVE UPDATES\n\"That’s how #Fakenews is born,\" the Russian diplomat said in the tweet, sharing a report with supporting evidence. \"We warned in our statement back on 7 March that this hospital has been turned into a military object by radicals.\"\nUkrainian emergency employees and volunteers carry an injured pregnant woman from the damaged by shelling maternity hospital in Mariupol, Ukraine, Wednesday, March 9, 2022.(AP Photo/Evgeniy Maloletka)\n\"Very disturbing that UN spreads this information without verification,\" the tweet added.\nThat’s how#Fakenewsis born. We warned in our statement back on 7 March (https://t.co/OpSeejBais) that this hospital has been turned into a military object by radicals. Very disturbing that UN spreads this information without verification#Mariupol#Mariupolhospitalhttps://t.co/99v8avyThSpic.twitter.com/JsHgsv5YfQ\nInitial reports of the attack immediately drew international criticism, as military forces typically do not attack civilian sites such as hospitals.\nA woman walks outside the damaged by shelling maternity hospital in Mariupol, Ukraine, Wednesday, March 9, 2022.(AP Photo/Evgeniy Maloletka)\nOn Twitter,UkrainePresident Volodymyr Zelenskyy confirmed that the attack had taken place and shared a video of the aftermath, which he described as an \"atrocity.\"\n\"Direct strike of Russian troops at the maternity hospital. People, children are under the wreckage. Atrocity! How much longer will the world be an accomplice ignoring terror? Close the sky right now! Stop the killings! You have power but you seem to be losing humanity,\" he tweeted.\n\"An aerial bomb on a maternity hospital is the conclusive evidence that what is happening is a genocide of Ukrainians,\" he added in a video address.\nMariupol. Direct strike of Russian troops at the maternity hospital. People, children are under the wreckage. Atrocity! How much longer will the world be an accomplice ignoring terror? Close the sky right now! Stop the killings! You have power but you seem to be losing humanity.pic.twitter.com/FoaNdbKH5k\nU.S. Secretary of State Antony Blinken denounced Russia's \"unconscionable attacks harming population centers,\" a State Department spokesperson said.\nU.K. Prime Minister Boris Johnson similarly tweeted: \"There are few things more depraved than targeting the vulnerable and defenseless. We will hold Putin to account for his terrible crimes.\"\nAn injured pregnant woman walks downstairs in the damaged by shelling maternity hospital in Mariupol, Ukraine, Wednesday, March 9, 2022.(AP Photo/Evgeniy Maloletka)\nOther photos and videos taken near the maternity hospital in Mariupol showed Ukrainian emergency services caring for women and children affected by the blast.\nToday, Russia shelled a Childrenʼs hospital and a Maternity hospital in 📍Mariupol.#closeUAskyNOW#StopRussianAggression#Russiapic.twitter.com/tTu7AAGhoD",
        "scraped_at": "2025-12-28T19:05:02.832586",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ukrainian-lawmaker-russia-trying-forcibly-deport-civilians-mariupol",
        "title": "Ukrainian lawmaker says Russia forces trying to forcibly deport civilians from Mariupol to Russia",
        "publish_date": "April 24, 2022 7:46pm EDT",
        "author": "ByBradford BetzFox News",
        "content": "Razom for Ukraine volunteer Arthur Zgurov called on Putin and Russian officials to 'get out of Ukraine' on 'Fox News Live.'\nAUkrainianlawmaker claimed Sunday thatRussianforces are forcibly deporting civilians – including children – in the besieged city of Mariupol to Russia.\n\"They have pulled these people from Mariupol,\" Ukrainian Parliament member Yevheniia Kravchuk told ABC’s \"This Week\" on Sunday. \"This is something that can’t be happening in the 21st century.\"\nThe comments came as Kravchuk was providing an update on the humanitarian disaster in Mariupol. She claimed that Russia did not honor a humanitarian corridor that would have allowed civilians to flee the city unharmed.\nNASCAR LEGEND RICHARD CHILDRESS STANDS WITH UKRAINE: ‘I’D LOVE TO SEE OUR GOVERNMENT GET BEHIND THEM'\n\"They’re trying to make the forcible deportations to Russian territory from Mariupol. They take people – they even take children that have lost their parents and they are sending them to Vladivostok,\" Kravchuk said, referring to the far eastern Russian city some 6,000 miles away. \"We do not know how to bring them back to Ukraine.\"\nSmoke rises above the Mariupol Azovstal Iron and Steel Works factory.(REUTERS/Alexander Ermochenko)\nKravchuk said Ukrainians are put through \"filtration camps\" where Russian troops separate the men in search of Ukrainian soldiers.\n\"We really hope that with the help of other western leaders, other leaders of (the) civilized world, we will be able to save kids and women who are still in the basement of the massive Azovstal plant.\"\nUS SEEKS NEW PORTABLE ANTI-AIR MISSILE TO REPLACE THE STINGER\nMariupol has been a key Russian objective since the Feb. 24 invasion began. Capturing the city would allow the establishment of a land corridor from Russia's border to Ukraine's Crimean Peninsula that Moscow annexed in 2014. It also would deprive Ukraine of a major port and prized industrial assets. The bulk of the neon used in advanced microprocessors, for instance, comes from firms based in Mariupol.\nSmoke rises above Azovstal steelworks, in Mariupol, Ukraine, in this still image obtained from a recent drone video posted on social media.(Mariupol City Council/via Reuters)\nSince the battle for the city began March 1, the Russian military has pummeled Mariupol relentlessly with artillery barrages and air raids, flattening most of the once-bustling city. The indiscriminate bombardment has hit homes, hospitals and other public buildings, killing thousands.\nMariupol Mayor Vadym Boychenko estimates that at least 21,000 people were killed in Mariupol and another 120,000 people remain in Mariupol out of a prewar population of about 450,000.\nThe Associated Press contributed to this report.\nBradford Betz is a Fox News Digital breaking reporter covering crime,political issues,and much more.",
        "scraped_at": "2025-12-28T19:05:07.221240",
        "conflict": "Ukraine"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c62vk0v9756o",
        "title": "New clothing to be delivered to Ukraine children",
        "publish_date": "2025-12-01T12:13:54.522Z",
        "author": "N/A",
        "content": "New coats, shoes and hooded jackets are being gifted to orphaned children in Ukraine, ahead of Christmas after a fundraising campaign.\nDavid Pond, from Kingsand, Cornwall, helped set up a crisis response centre when the war in Ukraine began in February 2022 and has since raised funds to provide supplies, including medical equipment and humanitarian aid for the country.\nHe said the gifts would be delivered to 80 children, ranging from two to 19 years old, at an orphanage in Lviv, on 12 December.\nMr Pond said: \"This is a wonderful opportunity to give children, who are suffering significant turmoil, a set of brand new clothes.\"\nMr Pond, former commodore of HMS Raleigh, said about £350,000 had been raised for the project enabling him to deliver supplies, described as missions, to Ukraine four to five times a year.\nVolunteers helped wrap and organise the gifts at Maker with Rame Institute on Sunday and described it as \"very personal\" because each gift is labelled with a child's name.\nMaggie Cardew, who has been contributing to the efforts, said: \"You come across the names of the children, and you immediately think about the children themselves.\"\nMr Pond's wife Lesley helped select and order the new items which cost about £100 per child meaning they had to raise about £8,000 in total.\nShe said thanks to the funds each child would receive a padded winter coat, their own hooded jumper and waterproof shoes and they had received all the sizes of the children at the orphanage.\n\"We've been matching up Ukrainian sizes, feet and height,\" she said.\n\"The coats have lovely fur hoods because it is super cold compared to Cornwall.\"\nJane Baker who was helping to wrap the gifts said Mr and Mrs Pond wanted brand new items rather than \"hand me downs\".\n\"The children are getting the respect any of our children may get,\" she said.\n\"I couldn't imagine anything worse than living in a war-torn country, particularly at Christmas time.\"\nFollow BBC Cornwall onX,FacebookandInstagram. Send your story ideas tospotlight@bbc.co.uk.",
        "scraped_at": "2025-12-28T19:05:09.757343",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://edition.cnn.com/2025/12/24/europe/moscow-bomb-police-officers-intl",
        "title": "Bomb blast in Moscow kills two police officers, days after apparent assassination of general",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Two police officers were killed early Wednesday by a bomb in Moscow, close to the scene of acar bombingthat killed a top Russian general two days ago.\nThe two police officers approached a suspicious person who detonated an explosive device near a police car, Russia’s investigative committee said in a statement on Wednesday.\nThe assailant was also killed in the attack, according to Russian state news agency TASS.\n“Investigators and forensic experts from the Moscow Investigative Committee are continuing to examine the scene of the incident,” Svetlana Petrenko, a representative for the investigative committee, said in the statement.\nPolice are also studying CCTV and interviewing witnesses in an attempt to uncover the perpetrator, the statement added.\nThe deadly blast comes just days after a Russian general was killed by a car bomb on a neighboring street in the Russian capital.\nLt. Gen Fanil Sarvarov, who ran the armed forces operational training department, died after an explosive device installed under the chassis of a car exploded on Monday morning, investigators said.\nRussian officials suggested Ukraine could have behind the apparent assassination of the senior military officer. “Investigators are pursuing various motives for the murder. One of the theories is that the crime was organized by Ukrainian special services,” the investigative committee said Monday.\nUkraine has not claimed responsibility for the attack on Sarvarov, but several prominent Russians have been killed in Moscow in attacks blamed on the Ukrainian security services since thefull-scale Russian invasionof Ukraine in 2022.\nThe investigative committee did not comment on whether the two incidents are linked.",
        "scraped_at": "2025-12-28T19:05:14.667359",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://edition.cnn.com/2025/12/23/europe/russian-attack-zelensky-ukraine-talks-intl",
        "title": "‘Massive’ Russian attack on Ukraine kills 4-year-old child, as Zelensky is briefed on peace talks",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Russia launched one of its largest aerial attacks this month onUkraineovernight, killing at least three people and injuring at least 17 others, according to President Volodymyr Zelensky, as Ukraine’s leader received his first face-to-face briefing with his negotiating team on their arrival back from talks in the US.\n“Russia has been carrying out a massive attack on Ukraine,” Zelensky posted on X, adding that more than 650 drones and over 30 missiles were used in the strike. Some 13 regions, about half the country, came under attack, he said.\nIn the western region of Zhytomyr, a 4-year-old child was killed after a Russian drone struck a residential building, Zelensky said.\nMeanwhile, emergency power cuts were imposed across the country with some regions left almost completely without power due to the attack, according to Ukraine’s energy ministry.\nThe latest bombardment comes after a fresh round oftalksto end the war wrapped over the weekend in Miami, where Ukrainian and Russian officials met separately with a US delegation led by White House envoy Steve Witkoff and Jared Kushner, the son-in-law of President Donald Trump.\nOn the ground, Kyiv’s troops retreated from the town of Siversk in eastern Ukraine on Tuesday, according to the country’s armed forces, as Russian forces pushed through “active offensive operations.”\nUkrainian solders withdrew from the area in Donetsk to “save the lives of our soldiers and maintain the combat capability of our units,” the General Staff of the Ukrainian Armed Forces said in a statement.\n“The invaders were able to advance thanks to their significant numerical superiority and constant pressure” despite “difficult weather conditions,” Ukraine’s Armed Forces added.\nMoscow broke through swathes of the city this week after alightning offensivealong eastern frontlines over the summer. Even so, Ukrainian troops have maintained “fire control” of Siversk and Russian units are “being blocked,” the country’s armed forces said Tuesday.\n“All measures are being taken to reduce the offensive potential of enemy units,” the statement said.\nUkraine’s delegation arrived back in Kyiv overnight and delivered what Zelensky called a “detailed report” of the talks.\n“Not everything is perfect so far, but this plan is in place,” Ukraine’s leader wrote on X overnight, referring to the 20-point document, which forms the core of an agreement framework between Ukraine and the US.\nIn addition to the core plan, which include security guarantees “between us, the Europeans, and the United States,” Zelensky wrote, there is an additional document detailing bilateral security guarantees between Ukraine and the US. On this latter point, he said, “we are very close to a real outcome.”\nAlong with security guarantees, previous rounds of talks have also highlighted thecentrality of territoryin negotiations, and Zelensky made no comment in statements overnight on any readiness to discuss possible land swaps.\nLast week, Russian PresidentVladimir Putingave a clear indication that he will not compromise on his demands for Ukraine to cede territory in the Donbas, despite the Trump administration’s intensifying push for peace.\nIn an apparent attempt to tamp down expectations, Kremlin spokesman Dmitry Peskov told the Russian newspaper Izvestia on Monday that talks between Russian and US officials over the weekend should not be considered as a breakthrough.\n“This is a working process. We already said that first there needs to be quite a meticulous work process at the expert level,” Peskov said.\nWitkoff, who led the US delegation at the Miami talks, said Russia “remains fully committed to achieving peace in Ukraine” after meeting with Kirill Dmitriev, the head of the Russian sovereign wealth fund (RDIF) and a Kremlin special envoy, at the weekend.\nHe made a similarly worded statement after talks with the Ukrainian delegation. “Ukraine remains fully committed to achieving a just and sustainable peace,” Witkoff said, while noting that their meeting was “constructive” and included discussions about the “sequencing of next steps.”\nAway from the Florida talks, Zelensky put Ukraine’s military on alert for potential Russian attacks around Christmas while pointing out the lack of air defenses available to defend the country.\nUkrainian men risking death to avoid the frontline\nThe Ukrainian leader said the most recent attack “sends an extremely clear signal about Russia’s priorities.”\nIt was an attack “ahead of Christmas, when people simply want to be with their families, at home, and safe,” he said. “An attack carried out essentially in the midst of negotiations aimed at ending this war.”\nCNN’s Hira Humayun, Nina Subkhanberdina, Tim Lister and Sana Noor Haq contributed reporting.",
        "scraped_at": "2025-12-28T19:05:31.429612",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://edition.cnn.com/2025/12/10/politics/ukraine-response-peace-plan",
        "title": "Ukraine presents response to US peace plan as Trump says European leaders want a meeting",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Ukraine delivered its response to the latest US-drafted peace proposal aimed at ending thewar with Russiato the Trump administration on Wednesday, US and Ukrainian officials told CNN, as the contours of a tenuous potential deal take shape and the US president continues to make clear he wants the conflict resolved quickly.\nEfforts to end the yearslong war have sharply accelerated in recent weeks. President Donald Trump on Wednesday suggested a solution could soon be “figured out,” telling reporters at the White House that “a lot of people say it’s closer than it’s ever been.”\nHe said he “discussed Ukraine in pretty strong words” with his British, French and German counterparts, whom he said had floated the idea of Trump flying to Europe for a meeting, along with Ukrainian President Volodymyr Zelensky, this weekend.\n“We’ll make a determination, depending on what they come back with,” Trump said. “We don’t want to be wasting time.”\nA European diplomat also described discussions as “progressing quickly” amid continuing pressure and impatience from the US president.\nThere has been a frenzy of diplomacy following the revelation less than a month ago of a US-drafted, Russian-backed 28-point draft proposal to end the war.\nAfter a series of consultations with Kyiv and a meeting in Moscow, the 28-point plan was winnowed down to 20 points meant to make it palatable to both warring parties. It is among a set of three documents being negotiated, along with one on security guarantees and another on economic recovery. Zelensky said he had a meeting on the latter on Wednesday.\nDiscussions are ongoing and it is unclear what changes, if any, Kyiv made to the documents in its latest response.\nHowever, two European diplomats familiar with the contents of the 20-point draft said it proposed the creation of a demilitarized zone along the line of contact.\nIt called for security guarantees for Ukraine in line with NATO’s Article 5, which calls for mutual defense of NATO allies. It proposes membership for Ukraine in the European Union by 2027.\nIt removes language barring Ukraine from ever joining NATO; instead, it does not mention potential Ukrainian membership in the defensive alliance.\nIt also calls for elections in Ukraine – something both Trump and the Kremlin have raised. Zelensky has said he would be open to holding elections in the next 60 to 90 days if security can be guaranteed.\nAccording to the diplomats, the updated 20-point draft contained elements from the 28-point that are still likely to draw concern from Ukrainians and Europeans.\nAmong them are a formal US recognition of Russian-occupied territory. This would mark a stunning reversal of longstanding US policy to acknowledge Ukraine’s territorial integrity and not recognize forcible changes in territory.\nThe latest US proposal also calls for a personnel cap of 800,000 on Ukraine’s military – a small increase from the 600,000 person cap in the 28-point document.\nIt also describes the US and Russia deciding the fate of Russia’s frozen assets.\nEven as negotiations continue, there is recognition inside the US government and among allies that the discussions are fragile and issues like land concessions could stymie the peace efforts.\nThere is still no sign that Russian President Vladimir Putin actually wants a peace settlement, European and NATO officials have said.\n“If there is a way to bridge the divide between the two sides, we’re the only ones in the world that can do it, and that’s what we’re trying to do,” Secretary of State Marco Rubio said last week. “Ultimately, it’s going to be up to them.  If they decide they don’t want to end the war, then the war will continue.”",
        "scraped_at": "2025-12-28T19:05:52.060666",
        "conflict": "Ukraine"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/world-europe-60633482",
        "title": "Putin says sanctions over Ukraine are like a declaration of war",
        "publish_date": "2022-03-05T18:56:54.000Z",
        "author": "N/A",
        "content": "Russian President Vladimir Putin has described sanctions imposed by Western nations over his invasion of Ukraine as \"akin to a declaration of war\".\n\"But thank God it has not come to that,\" he added.\nMr Putin also warned that any attempt to impose a no-fly zone over Ukraine would be seen as participation in the armed conflict.\nAnd he rejected suggestions that he would introduce a state of emergency or martial law in Russia.\nMr Putin made the remarks while speaking to a group of women flight attendants at an Aeroflot training centre near Moscow.\nSince the start of Russia's invasion 10 days ago, the West has imposed a raft of sanctions on Russia, including the freezing of Mr Putin's foreign assets and the exclusion of a number of Russian banks from the Swift international payments system.\nIn addition, many multinational firms have ceased operations in Russia, On Saturday,Zara, Paypal and Samsungbecame the latest global brands to suspend trading there.\nThe economic measures have already caused the rouble to plunge in value and forced the Russian central bank to double interest rates.\nIn his latest comments, Mr Putin sought to justify the war in Ukraine, repeating his assertion that he was seeking to defend Russian speaking communities there through the \"demilitarisation and de-Nazification\" of the country.\nResponding to Western defence analysts' allegations that the Russian military campaign was going less well than expected, he said: \"Our army will fulfil all the tasks. I don't doubt that at all. Everything is going to plan.\"\nHe added that only professional soldiers were taking part in the hostilities and there were no conscripts involved, despite reports to the contrary.\nThe Russian leader said efforts to impose a no-fly zone in Ukraine would be considered by Russia to be a step into the military conflict and those responsible would be treated as enemy combatants.\n\"The current leadership needs to understand that if they continue doing what they are doing, they risk the future of Ukrainian statehood,\" he added.\nFor his part, Ukrainian President Volodymyr Zelensky has condemned Nato for ruling out the no-fly zone. However, Western leaders say introducing the measure would be an escalation.\nMr Putin also said he had no plans to declare martial law in Russia. adding that such a step would only be taken in \"instances of external aggression, in defined areas of military activity\".\n\"But we don't have such a situation and I hope we won't have one,\" he said.\nThere had been rumours that Mr Putin was planning to declare martial law, which is when normal civil law is suspended or the military takes control of government functions.\nHe said there were other special emergency states which could be used in the case of a \"large-scale external threat\", but that he had no plans to introduce these either.\nMeanwhile, diplomatic moves have continued on the sidelines of the conflict.\nIsraeli Prime Minister Naftali Bennett met Mr Putin in Moscow on Saturday and had a three-hour discussion on the war.\nMr Bennett then headed to Berlin to meet German Chancellor Olaf Scholz.  As an Orthodox Jew, he broke Shabbat in order to travel, which is allowed under Jewish law if human life is at stake.\nAlthough Israel is a key ally of the US, Mr Bennett has tried to preserve a good relationship with Russia.  Ukraine's President Zelensky, who is Jewish, has called on Israel to mediate in the crisis.\nAnd the US Secretary of State, Antony Blinken, has met Ukraine's Foreign Minister, Dmytro Kuleba, telling him he was in awe of his courage in standing up to Russia.\nThe two men met on the Polish-Ukraine border. Mr Kuleba reiterated his desire and optimism for more military backing from Nato, including a no-fly zone.",
        "scraped_at": "2025-12-28T19:05:54.203645",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://amp.cnn.com/cnn/2024/06/13/europe/russia-ukraine-mariupol-hunger-war-crime-intl",
        "title": "Russia accused of using hunger as a weapon of war in Ukraine",
        "publish_date": "Updated\n                                          3:21 PM EDT, Thu June 13, 2024",
        "author": "N/A",
        "content": "A group of international human rights lawyers has accused Russia of intentionally starving the civilians of Mariupol as a method of warfare during its85-day siege of the Ukrainian cityin early 2022.\nA 76-page dossier published Thursday by the Starvation Mobile Justice Team of the human rights organization Global Rights Compliance looks in detail at thesiege, which it described as “hell on earth” for the port city’s residents, through the lens of the war crime of starvation as a calculated strategy.\nIt found that Russian forces “systematically attacked objects indispensable to the survival of the civilian population,” while at the same time cutting off evacuation routes and blocking the delivery of humanitarian aid.\nUkrainian civilians were cut off from water, electricity and gas and forced to drink from puddles, radiators and melted snow.\nThe findings didn’t come as a surprise to Nikolai Osychenko, who described living through the siege as a “Stone Age” experience.\n“The Russians bombed the substation that supplied electricity to Mariupol on March 2 and we lost electricity, and at the same time, we also lost the water supply and heating,” he told CNN, adding that the city started running out of food almost immediately, because without electricity, much of it has gone bad.\n“We all realized that flour is the best thing to have. If you have water and flour, you can cook something. But without water, you can’t do anything,” he said.\nThe Mariupol resident spent two weeks living in one apartment with nine other people, rationing food and scraping together any water they could find. They would spend two days melting buckets of snow with their hand, only to get a few inches of dirty water. Osychenko told CNN that at one point, he drank the water from his radiators, boiling it 20 times over to purify it.\nDeliberately causing starvation and deprivation constitutes a war crime under international law. The group is in the process of submitting their latest report to the International Criminal Court (ICC) as part of a larger dossier on Russia’s use of starvation.\nAccording to their website, the organization is funded by the governments of the EU Commission, the Netherlands, the United Kingdom and the United States.\nCNN has reached out to Russia’s Ministry of Defense for comment.\nMariupol, a port city on the Sea of Azov, wasencircled and captured by Russian forcesat the start of the full-scale invasion of Ukraine. Local officials estimate that as many as 22,000 people were killed in the battle for the city, which is located in Ukraine’s Donetsk Oblast and has been under direct Russian control since May 2022.\nIt was in Mariupol that Russian forces carried out some of their most notorious strikes, including an attack on amaternity hospitaland the bombing of a theater in which up to 1,300 civilians had sought refuge, according to local officials.\nThe report, entitled, “’The Hope Left Us:’ Russia’s Siege, Starvation, and Capture of Mariupol City’” explores how “peaceful” Mariupol was turned into “hell on earth” in February 2022. It uses open-source research to analyse over 1.5 billion square meters of satellite imagery, as well as photographs, videos, official public statements, and other digital data collected between May 2022 and February 2024.\nIts several hundred thousand residents were forced to find alternative coping strategies during Russia’s siege, amid dwindling supplies and the obstruction of humanitarian aid. This included the establishment of ad hoc distribution points for food, water and other basic necessities.\nThese distribution points, however, including the Mariupol Drama Theater and Neptun Swimming Pool Complex, became targets for the Russian army.\n“Sustained attacks against Mariupol City forced the distribution of essential items to become largely mobile in order to mitigate risks of shelling, though a significant number of both mobile and stationary distribution points were still shelled, repeatedly exposing vulnerable and hungry residents to significant risk to their lives and means of securing basic necessities,” the report found.\nIt also found several instances where the delivery of vital humanitarian aid was allegedly denied or deliberately obstructed by Russian forces, while civilians were unable to evacuate from the city.\n“Despite Russian forces’ command failing to halt hostilities in order to allow and facilitate rapid and unimpeded passage of humanitarian relief for civilians in need, aid delivery was also directly blocked by pro-Russian forces operating at checkpoints erected around evacuation corridors between Mariupol and Zaporizhzhia.”\nOsychenko said he and his family survived the ordeal thanks to his wife’s and niece’s careful planning.\n“They were in charge of food and they divided the food very clearly: so much porridge, so much this and so much that for the day. Once I caught them not eating at all. They cooked for us but they didn’t eat because they knew that there was nowhere to get food, and there was less and less of it,” he said.\nYousuf Syed Khan, a senior lawyer with law firm Global Rights Compliance, told CNN he believes there was no doubt that the siege of Mariupol amounted to a war crime.\n“They [the Russian army] did not allow for international organizations to provide civilian evacuations… even though the International Committee of the Red Cross (ICRC) as well as the United Nations attempted numerous times to evacuate civilians.\n“Number two is that they did not allow the entry of humanitarian aid. So not once through the 85-day offensive was there any pause in which they allowed humanitarian aid to enter Mariupol.”\nKhan continued: “On top of that, they were attacking indispensable objects. They were attacking electricity, they were attacking water. They were attacking food distribution points.”\nThere were numerous opportunities for Russian forces to alleviate civilian suffering, he said, but they failed to do so.\nOsychenko said that with each day, the situation was getting more and more desperate. Mothers that had small children, many of them  lost milk from the stress and hunger, there was no formula, no children food,” he said.\nWhen Russian troops took over the city, they tried to take advantage of the desperate situation.\n“When Russia came to the city, when they started delivering food to people in basements, giving candies to children, even if you hate Russia, you will go out to them and take it. Because you have nothing to eat, your kids have nothing to drink. It’s brutal,” he said.\nKhan said the way Moscow approached the siege was part of a broader strategy that Russian and pro-Russian forces have used regularly in the past eight years. He pointed to sieges laid by pro-Russian forces across Syria, including those in eastern Aleppo City and Ghouta, as examples of heavy-handed Russian tactics.\nUkrainian authorities and some international officials have previously accused Russia of robbing the country of grain and other commodities in areas it occupied. Accusations that Russia is using food as a weapon of war have been mounting ever since the first reports emerged in the spring of 2022 of grain being stolen by Russian troops.\nThe ICC has jurisdiction over war crimes committed in Ukraine. It has so far issued four arrest warrants related to Ukraine, including for Russian President Vladimir Putin over the alleged deportation of Ukrainian children.",
        "scraped_at": "2025-12-28T19:05:56.633909",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://amp.cnn.com/cnn/2022/03/08/europe/russia-invasion-ukraine-03-08-intl",
        "title": "Civilians flee Sumy after evacuation corridor opens, as 2 million refugees leave Ukraine",
        "publish_date": "Updated\n                                          8:13 PM EST, Tue March 8, 2022",
        "author": "N/A",
        "content": "Atense and fleeting evacuationfrom Ukraine’s northeastern city of Sumy took place on Tuesday after Russian airstrikes killed 21 people, including two children, the night before, Ukrainian authorities said.\nUkrainian officials confirmed that an evacuation corridor allowing residents out of the city opened on Tuesday morning, following days of sustained Russian attacks. It came as the United Nations estimated that more than 2 million refugees have fled Ukraine since Moscow’s invasion on February 24.\nThe agreed ceasefire was set to last until 9 p.m. local time (2 p.m. ET), with final evacuations taking place 90 minutes before that time. Buses have been used to take people to Poltava, around 100 miles away in central Ukraine, said Dmytro Lunin, head of the Poltava regional administration, on his Telegram channel on Tuesday.\nOne convoy was delayed by an outbreak of firing at the outskirts of Sumy, according to the city’s regional head, Dmitry Zhyvitsky. But Zhyvitsky was quoted in local media as saying theRussian forcesdid not shoot on the convoy.\n“At the moment, citizens are being evacuated by their own vehicles,” Zhyvytsky said on Telegram. “After 19:30 the checkpoint closes and it will be impossible to leave Sumy.”\nThe frantic rush to escape the city, during a break in its assault by Russian forces, was not replicated in other cities. Officials across the country have condemned Russia in recent days for offering unfeasible routes of escapethat lead to Russia or its ally Belarus, and for reneging on ceasefire agreements by opening fire on fleeing civilians.\nUkrainian Foreign Minister Dmytro Kuleba said on Tuesday that Russian troops are holding 300,000 civilians “hostage” in the besieged southern city of Mariupol, where he said a child died of dehydration.\nUkrainian authorities said that a long-awaited convoy of humanitarian aid to the city appeared to have come under fire on Tuesday. Russian troops are not allowing “children, women and the elderly” out of the city, and have launched an attack “precisely in the direction of the humanitarian corridor,” Ukraine’s Joint Forces Operation said.\nCNN has been unable to verify the status of the convoy and has reached out to the Russian side for a response.\nA senior US defense official said Tuesday that Mariupol as of now been “isolated” by Russian forces, though Russian forces are only still bombarding the city and are not inside it “in any significant way.”\nCNN has previously reported that Mariupol residents have been cut off from water and electricity for days.\nMeanwhile in regions around the capital Kyiv, the humanitarian situation remains fraught.\n“The main issue today remains humanitarian aid,” Oleksiy Kuleba, the head of the Kyiv Regional Military Administration, said in a YouTube video.\nResidents of Bucha, Irpin, Gostomel, Makariv, Borodyanka and Vorzel are “forced to stay in bomb shelters for days without water and food,” he said, adding that Moscow is preventing “humanitarian evacuation despite agreements with ICRC (International Committee of the Red Cross) mediation.”\nOn Tuesday, Human Rights Watch (HRW) said Russian forces “violated their obligations under international humanitarian law not to conduct indiscriminate or disproportionate attacks that harm civilians,” following a report that eight civilians were killed over the weekend as they were trying to flee the Russian army’s advance in northern Ukraine.\nThat warning came after the UK Ministry of Defence, in its latest intelligence assessment. accused Russian forces of targeting evacuation corridors and killing “several civilians” trying to evacuate the town of Irpin.\nUkrainian President Volodymyr Zelensky criticized the international community for remaining on the “sidelines” of the Russian invasion.\nAddressing the UK’s House of Commons on Tuesday via video, Zelensky said that “we will fight to the end,” echoing former British Prime Minister Winston Churchill’s famous wartime speech.\n“We will fight in the forests, in the fields, on the shores, in the streets,” he said. Zelensky pleaded with British lawmakers to “strengthen the sanctions” against Moscow, requested that the UK recognize Russia “as a terrorist state” and reiterated his request with NATO to establish a no-fly zone over Ukraine.\nNATO has assisted Ukraine with equipment and intelligence, but has resisted implementing a no-fly zone over its airspace.\nNATO Secretary General Jens Stoltenberg said the military alliance has a “responsibility to ensure that the conflict does not spread beyond Ukraine” during a joint press conference in Riga with the Latvian President Egils Levits.\nZelensky's heroism is coming up against Western red lines\n“That would be even more dangerous, destructive, and even more deadly,” said Stoltenberg. “The situation could spiral out of control,” he said.\nOn the ground, fighting continued in multiple locations as the Russian invasion neared the end of its second week.\nIn the southern city of Mykolaiv, regional administrator Vitali Kim asked residents to gather tires, which will be set on fire to impede Russian troop movement in the city.\n“In order to limit visibility for the enemy vehicles in the city, I need tires at every intersection in the city,” Kim said in a message posted to Telegram. “If the vehicles break through in some direction, the task will be to go out and set fire to the tire so that there is smoke in order to limit visibility.”\nThe senior US defense official said Tuesday that Russian forces have not yet entered Mykolaiv, a key city that could be used as part of a coordinated assault against the city of Odessa, though there has been an increase in bombardment and shelling.\nThe official said that Russian forces are still trying to advance on the cities of Kharkiv and Chernihiv, but are still facing resistance and are making more progress in the south of Ukraine than elsewhere in the country.\nIn total Russia has launched “nearly 670” missiles since the beginning of their invasion, a separate senior US defense official told reporters on Tuesday.\nAlmost half of the missiles launched have been fired from Russia, “the other half largely from inside Ukraine,” the official said. “A little bit more than 70” missiles have been fired from Belarus, and “only a half dozen or so” are coming from the Black Sea, the official added.\nMeanwhile, the humanitarian effect of Russia’s invasion were also laid bare on Tuesday, when UN High Commissioner for Refugees Filippo Grandi told French radio station France Inter that more than 2 million people have fled Ukraine since the conflict began.\nRussian tanks emblazoned with 'Z' were first spotted on Ukraine's border. Here's how the letter became a pro-war symbol\nThe milestone is a “terrifying” number, said Grandi. Most of the refugees have traveled to Poland, Moldova and other neighboring countries “where they have connections, family,” he added.\n“What worries me, what we fear is a second wave of persons who have a good deal less resources and connections and who will be much more vulnerable,” said Grandi.\nAt least 1.2 million refugees have crossed the border from Ukraine into Poland since the invasion began, the Polish Border Guard tweeted Tuesday, with 141,500 entering on Monday alone.\nCNN’s Tim Lister, Olga Voitovych, Esha Mitra, Swati Gupta, Anastasia Graham-Yooll, Michael Conte, Ellie Kaufman, Niamh Kennedy and Antonia Mortensen contributed to this report.",
        "scraped_at": "2025-12-28T19:05:58.981368",
        "conflict": "Ukraine"
    },
    {
        "source": "The Guardian",
        "url": "https://www.theguardian.com/uk-news/2025/jun/27/ukrainians-who-fled-to-uk-being-refused-asylum-on-grounds-it-is-safe-to-return",
        "title": "Ukrainians who fled to UK being refused asylum on grounds it is ‘safe to return’",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Ukrainians who fled to the UK after the Russian invasion are being refused asylum by theHome Officeon the grounds it is safe to return to Ukraine.\nFamilies are trying to obtain a route to settlement, which would enable them to build a life in the UK, commit their children to a British education and improve their prospects for jobs and housing. Some feel they have nothing to return to as they are from areas razed by conflict.\nOne told the Guardian they had been refused asylum on grounds they could relocate elsewhere inUkraine, despite their home town being a war zone.\nThe firm Sterling Law said it was contacted weekly by Ukrainians, including vulnerable women and children, whose applications had been refused. The firm is working on several appeals, which bring waits of several months during which Ukrainians are left in limbo.\nAlthough Ukrainians are able to remain for 18 months through the temporary visa scheme, the uncertainty about their living arrangements is compounding anxiety and distress.\nHalyna Semchak, an immigration lawyer at Sterling Law, said she was working with a single mother from Nikopol, a town which has been largely destroyed, a visually impaired man and the parent of a child born in the UK.\nTheir refusal letters typically state that the conflict-related risks do not meet the threshold for persecution under the refugee convention, as they can relocate to safer parts of Ukraine where there are public services, and they can apply for help from the United Nations high commissioner for refugees (UNHCR) and local organisations to avoid destitution.\nShe said this was a “concerning and growing trend” caused by updates made in January to the UK Home Office’s guidance, which now deems regions such as Kyiv and western Ukraine to be “generally safe”. She has observed that fewer of the asylum claims she works on have been successful since the update.\n“This assessment runs counter to the reality of life on the ground in Ukraine. I think any rational person would understand that Ukraine remains in the midst of a violent war, with attacks intensifying in recent months. Our clients would clearly face grave risks including bombardment, conscription, family separation and the psychological trauma of war if they were to return to Ukraine today,” she said.\n“Legally, these decisions are deeply troubling. They overlook the complex realities on the ground and fail to engage meaningfully with individual circumstances, particularly in light of article 3 and 8 of the European convention on human rights [which protect the rights to protection from harm and to liberty].”\nShe urged the government to reassess the guidance. “Until that happens, people fleeing war and instability will continue to be let down by a system that purports to protect them,” she said.\nOleksandr Zbytskyi was refused asylum despite being from Odesa in southern Ukraine, a war zone subject to infrastructure blackouts. While the Home Office was considering his application, five people died in a missile attack.\nZbytskyi and his family have been in the UK since August 2022. He wants his son, who was four-years-old when he arrived in the UK and speaks better English than Ukrainian, to continue at school and for his wife to keep receiving treatment for anxiety, depression and panic attacks.\nEvery member of his close family has died, some fighting on the frontline, others because they could not access medical treatment. If he returns, he may be drafted into the military.\n“It was really unexpected to achieve rejection … Who is willing to take their child and bring them back to the country where there is a full-scale war?” Zbytskyi said.\n“We are depressed about this because it’s affected all our family. I can’t do anything at the moment because of everything in my head. I can’t even sleep. This is a really terrible situation.\n“[My son] has already started his mental relocation to UK society. I don’t want to create another stress for him and for my wife. I know that it’s very, very important to live a normal life.”\nKama Petruczenko, a senior policy analyst at the Refugee Council, said he was concerned that the Ukraine guidance “is not currently flexible enough to best reflect the difficulties in quickly assessing regional safety in every single application”.\nThe latest Home Office figures suggest that 47 asylum applications have resulted in refugee status and 724 in humanitarian protection since 2023.\nA Home Office spokesperson said:“Since Vladimir Putin’s illegal invasion, we have offered or extended sanctuary to over 300,000 Ukrainians and the Homes for Ukraine scheme remains open for those who wish to come to the UK.\n“All asylum and human rights claims are carefully considered on their individual merits in accordance with our international obligations. No one who is found to be at risk of serious harm will be expected to return to Ukraine.”\nThis article was amended on 27 June 2025 because an earlier version described Halyna Semchak as a solicitor at Sterling Law. She is an immigration lawyer (registered with the Immigration Advice Authority) at the firm.",
        "scraped_at": "2025-12-28T19:06:01.672311",
        "conflict": "Ukraine"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/world-europe-68806207",
        "title": "Ukraine army chief says Russia making significant 'gains' in east of country",
        "publish_date": "2024-04-13T15:26:41.000Z",
        "author": "N/A",
        "content": "The head of Ukraine's military has warned the battlefield situation in the east of the country has \"significantly worsened\" in recent days.\nFierce battles are ongoing in a several villages in the eastern Donbas region.\nGen Oleksandr Syrskyi said Russia was benefitting from warm weather - making terrain more accessible to its tanks - and making tactical gains.\nIt comes as Germany said it will give Ukraine an extra Patriot missile defence system to fend off air attacks.\nIn his update posted to social media on Saturday, Gen Syrskyi explained the situation on the eastern front had deteriorated as Russia intensified its armoured assaults.\nBattles have raged for control of Bohdanivka - a village west of the devastated city of Bakhmut, he said.\nThe settlement lies a few kilometres northeast of the town of Chasiv Yar, a Kyiv-controlled stronghold which Russia has been trying to reach after seizing the town of Avdiivka in February to the south.\nUkrainian officials say a slowdown in military assistance from the West - especially the US - has left it more exposed to aerial attacks and heavily outgunned on the battlefield.\nDespite repeated assurances that he is dedicated to Ukraine's defence, US House Speaker Mike Johnson has failed to advance a new military aid bill. The Democratic-controlled Senate passed fresh funding in February which included $60bn in aid for Kyiv, but conservative Republicans in the House objected to the bill as it did not include funds for border security.\nGen Syrskyi said without fresh aid and sophisticated weapons Kyiv would be unable \"to seize the strategic initiative\" from the numerically superior Russian forces.\nSeparately on Saturday, Germany vowed to give Ukraine an additional air defence system. Ukraine has made increasingly desperate appeals for supplies of air defence missiles in recent weeks.\nOn Friday, a major power plant near Kyiv was completely destroyed by Russian strikes. Trypillya power plant was the largest electricity provider for three regions, including Kyiv, officials said.\nIn response, Berlin has agreed to give Kyiv an additional Patriot missile system. It is capable of intercepting Russia's most advanced munitions, including Kinzal hypersonic missiles.\nDefence Minister Boris Pistorius said Russian strikes against Ukrainian cities and energy infrastructure were causing untold suffering.\nPresident Volodymyr Zelensky thanked Germany for the decision, calling it \"a true manifestation of support for Ukraine\".\nSince President Vladimir Putin won his stage managed election last month, Moscow has stepped up air attacks on Ukraine.\nRussia has, in recent days, unleashed three massive aerial strikes on its energy system, pounding power plants and substations.\nElsewhere, the Security Service of Ukraine (SBU) said it has foiled an assassination attempt on the governor of the Kherson region, Oleksandr Prokudin. Officials said two men attempted to strike Mr Prokudin's car with a Russian-manufactured drone.\n\"This was not the first attempt, and probably not the last one,\" Mr Prokudin said a message posted to Telegram.\nSBU officials also said they had detained 11 networks of Russian operatives since the start of 2024. SBU chief Vasyl Malyuk said in another Telegram post that this was in addition to 47 last year.",
        "scraped_at": "2025-12-28T19:06:03.864199",
        "conflict": "Ukraine"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/world-europe-60506682",
        "title": "Ukraine in maps: Tracking the war with Russia",
        "publish_date": "2025-12-19T15:02:40.052Z",
        "author": "N/A",
        "content": "Fighting has raged in Ukraine since Russia launched a full-scale invasion more than three years ago. Over the past year, Russian forces have slowly expanded the amount of territory they control, mostly in the east of Ukraine, and have continued their recent barrage of air strikes on Kyiv and other cities.\nWith the fourth anniversary of the invasion approaching, here's a look at the situation on the ground in Ukraine.\nAnalysts at the US-based Institute for the Study of War (ISW), say Russia has taken about 4,700 sq km (1,800 sq miles) of territory in 2025 - an area about twice the size of the city of Moscow - although Russia claims to have taken 6,000 sq km.\nIn eastern Ukraine, Moscow's war machine has been churning mile by mile through the wide open fields of the Luhansk and Donetsk regions - also known as the Donbas - surrounding and overwhelming villages and towns.\nIt has been trying to gain full control of the area along with two more regions to the west - Zaporizhzhia and Kherson. Shortly after the invasion, Russia held referendums to try to annexe all these regions - in the same way it had annexed Crimea in 2014 - but it has never had them under full control.\nUnder a US-backed peace plan unveiled in November, Ukraine would cede control of all of Luhansk, Donetsk and Crimea, along with the areas of Zaporizhzhia and Kherson that Russia currently occupies, to Moscow.\nUkrainian forces would have to withdraw from parts of Donetsk they still hold and this would become a demilitarised area under de facto Russian control. Russian forces would withdraw from the small areas of Ukraine they currently occupy outside those regions.\nUkraine's President Volodymyr Zelensky has consistently said Ukraine will not hand over the Donbas in exchange for peace, saying such a concession could be used as a springboard for future attacks by Russia.\nA recent report by the ISW describes a \"fortress belt\" running 50km (31 miles) through western Donetsk.\n\"Ukraine has spent the last 11 years pouring time, money, and effort into reinforcing the fortress belt and establishing significant defence industrial and defensive infrastructure,\" it writes.\nA Russian summer offensive near the eastern town of Pokrovsk did make rapid advances just north of the town and Russia has recently made advances in the south of the town itself and to the east of nearby Kostyantynivka.\nThe town, once a key logistics hub for Ukraine's military, is already in ruins.\nRussian officials claim to have captured the key strategic town, known in Russian as Krasnoarmeysk, which could give Moscow a platform to drive north towards the two biggest remaining Ukrainian-controlled cities in the Donetsk region, Kramatorsk and Slovyansk.\nUkraine is losing ground, but the ISW notes Russia has been trying to take Pokrovsk - a town of about 23 sq km - for nearly two years and that cities in the fortress belt are \"significantly larger\".\nIt suggests that it would take Russian forces another two years to seize the remainder of the Donetsk region \"at great cost\".\nFurther north on the main front line, Russia has been trying to advance on the city of Kupyansk, which analysts suggest could allow it to encircle the northern Donetsk region.\nIt has also been trying to push Ukrainian forces back from the border with the Russian region of Belgorod.\nISW analysts say Russia is trying to create a buffer zone inside Ukraine's northern borders and get within artillery range of Kharkiv, Ukraine's second-biggest city.\nRussian President Vladimir Putin says he wants this buffer zone to protect Russia, after Ukrainian forces captured a swathe of territory further north in Kursk in the summer of 2024. Russian forces eventually drove them out, with the help of North Korean troops.\nAs well as the counter-offensive in the Kursk region, Ukraine has struck air bases deep inside Russia. One of these attacks involvedusing 100 drones to target nuclear-capable long-range bombers.\nThe Russian Defence Ministry confirmed the attacks had occurred in five regions of Russia - Murmansk, Irkutsk, Ivanovo, Ryazan and Amur - but stated planes had been damaged only in Murmansk and Irkutsk, while in other locations the attacks had been repelled.\nMore recently Moscow blamed Ukrainian drones for a massive oil depot fire near Russia's Black Sea resort of Sochi - the venue of the 2014 Winter Olympic Games.\nDeep strikes are seen as a critical part of the war- Ukraine is trying to target Russia's war economy to slow the advances on the front line.\nThe head of Ukraine's Armed Forces, General Oleksandr Syrskyi, says Ukraine's long-range strikes have already cost the Russian economy more than $21.5bn this year.\nSince US President Donald Trump took office at the start of 2025, the US has been pursuing an end to the war through negotiations.\nTrump had been seen as more sympathetic to Russia than his predecessor Joe Biden was, and strained relations with Zelensky came to a head on 28 February when he and Vice-President JD Vance berated the Ukrainian president in the Oval Office on live television.\nPublic relations with Zelensky have vastly improved in recent months and Ukraine remains critically dependent on deliveries of US-made advanced weaponry, including air defence systems to repel deadly Russian air assaults, as well as intelligence provided by Washington.\nUkraine has presented its own 20-point peace plan to the US, to counter the initial American plan which was seen as heavily favouring Russia.\nDetails haven't been shared, but last week Zelensky said the points should be seen as a \"foundation\" on which to build provisions for the reconstruction of Ukraine and security guarantees.\nHowever, the Kremlin has shown little sign that it is willing to compromise on its key demands, including ruling out any future path to Ukraine joining the Nato military alliance.\nPutin has also restated his willingness to continue fighting until his forces take full control of the Donetsk and Luhansk regions.\nRussia's full-scale invasion began with dozens of missile strikes on cities all over Ukraine before dawn on 24 February 2022.\nRussian ground troops moved in quickly and within a few weeks were in control of large areas of Ukraine and had advanced to the suburbs of Kyiv.\nRussian forces were bombarding Kharkiv, and had taken territory in the east and south as far as Kherson, and surrounded the port city of Mariupol.\nBut they hit very strong Ukrainian resistance almost everywhere and faced serious logistical problems with poorly-motivated Russian troops suffering shortages of food, water and ammunition.\nUkrainian forces were also quick to deploy Western supplied arms such as the Nlaw anti-tank system, which proved highly effective against the Russian advance.\nBy October 2022, the picture had changed dramatically and, having failed to take Kyiv, Russia withdrew completely from the north. The following month, Ukrainian forces recaptured the southern city of Kherson.\nSince then, the battle has mostly been in the east of Ukraine with Russian forces slowly gaining ground over many months - military experts estimate between 165,000 and 235,000 Russian service personnel have been killed since the invasion.\nUkraine last updated its casualty figures in December 2024, when President Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be an under-estimate.\nBy Dominic Bailey, Mike Hills, Paul Sargeant, Chris Clayton, Kady Wardell, Camilla Costa, Mark Bryson, Sana Dionysiou, Gerry Fletcher, Kate Gaynor and Erwan Rivault\nTo indicate which parts of Ukraine are under control by Russian troops we are using daily assessments published by theInstitute for the Study of Warwith theAmerican Enterprise Institute's Critical Threats Project.\nThe situation in Ukraine is often fast moving and it is likely there will be times when there have been changes not reflected in the maps.",
        "scraped_at": "2025-12-28T19:06:06.144382",
        "conflict": "Ukraine"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/zelenskyy-names-his-terms-giving-up-power-us-ukraine-lock-mineral-deal-nato",
        "title": "Zelenskyy names his terms for giving up power as US, Ukraine lock in on mineral deal",
        "publish_date": "February 24, 2025 1:44pm EST",
        "author": "ByMorgan PhillipsFox News",
        "content": "Fox News contributor Dan Hoffman joins 'Fox & Friends First' to discuss the latest on peace talks for the war in Ukraine and preparations for a Trump-Putin summit as the war reaches its three-year mark.\nUkrainian President Volodymyr Zelenskyysaid he would step down as president of Ukraine if it meant his nation would be accepted into NATO.\nZelenskyy told reporters Sunday he was willing to give up the presidency \"if it is for the peace of Ukraine,\" or if Ukraine is offered NATO membership – after PresidentDonald Trumpcalled him a \"dictator\" for failing to hold wartime elections.\nHe also said he did not agree with Trump that Ukraine should pay the U.S. retroactively for the over $100 billion in aid offered since war broke out three years ago on Monday.\n\"We agreed with Biden that this was a grant. A grant is not a debt,\" Zelenskyy said.\nUS-UKRAINE RIFT BREAKS OUT AT UNITED NATIONS ON 3RD ANNIVERSARY OF THE WAR\nUkrainian President Volodymyr Zelenskyy said he was willing to give up the presidency \"if it is for the peace of Ukraine.\"(REUTERS/Gleb Garanich/Pool)\nU.S. officials have said NATO membership is off the table for Ukraine at any point in the near future, as Russia would never agree to such terms.\nDespite Zelenskyy's complaints, Trump insisted a new draft mineral deal is \"very close,\" and the deal will be worth $350 billion.\n\"It looks like we're getting very close, the deal's being worked on we're getting very close to getting an agreement where we get our money back over a period of time. But it also gives us something that is very beneficial to their economy, to them as a country,\" Trump told reporters while meeting with French President Emmanuel Macron.\nTreasury Secretary Scott Bessent confirmed the U.S. and Ukraine are at the \"one-yard line\" of a deal.\n\"The negotiations have been very constructive, with nearly all key details finalized. We are committed to completing this swiftly to proceed with its signature. We hope both US and UA leaders might sign and endorse it in Washington the soonest to showcase our commitment for decades to come,\" Olga Stefanishyna, a Ukrainian deputy prime minister, added on X.\nZelenskyy insisted he would not sign a deal that would cost Ukraine for decades.\n\"I will not sign what 10 generations of Ukrainians will have to pay back,\" he said.\nHowever, Zelenskyy is under pressure to agree to a deal to appease the Trump administration as the U.S. tries to broker peacewith Russia.\nThe deal involves offering the U.S. preferential access to hundreds of billions of dollars' worth of Ukraine’s rare-earth minerals as payback for past military aid, with no guarantee of future aid.\nTRUMP SET TO MEET WITH WORLD LEADERS IN DC DURING BUSY WEEK AS RUSSIA-UKRAINE PEACE TALKS CONTINUE\nAccording to Yulia Svyrydenko, minister of Economic Development and Trade, Ukraine has the largest reserves of lithium, titanium and significant deposits of other minerals in Europe.(Viktor Fridshon/Global Images Ukraine via Getty Images)\n\"I expect to see a deal signed this week,\" White House envoy Steve Witkoff said on CNN Sunday.\n\"We’re funding with no arrangement to pay it back. Alternatively, the Europeans who are most affected by this war were funding the minority share, and they had agreements to pay it back. This agreement is much about repayment for all that we have done on behalf of the Ukrainian people.\"\nLast week, Zelenskyy infuriated Trump by rejecting an initial version of a minerals deal, leading Trump to deem the Ukrainian president a \"dictator without elections\" and said Ukraine \"never should have started\" the war.\nZelenskyy, in turn, said Trump was operating in a \"disinformation space,\" which earned the Ukrainian leader warnings from Vice President JD Vance and national security adviser Mike Waltz to tone down his criticisms.\n\"I want the same as Donald Trump says he wants — to end the war as soon as possible. I believe he wants and will help us to end it. But the 'peace through strength' tactic should be applied on Russia first and foremost. We are partners and I want him to be on our side,\" Zelenskyy said.\nA woman and a man commemorate their fallen son on the third anniversary of Russia's invasion of Ukraine, at a cemetery in Bucha, outside Kyiv, Ukraine, on Feb. 24, 2025.(REUTERS/Anatolii Stepanov   TPX IMAGES OF THE DAY)\nUkraine's constitution outlaws holding elections while the nation is operating under martial law, which it has been since February 2022. Elections were originally scheduled for last spring.\nUnder the first draft of the mineral deal, the U.S. and Ukraine would split the profits of its minerals 50-50 for up to $500 billion.\nThe second draft of the deal, obtained by the New York Times, was even harsher – and would have required Kyiv to give up its minerals, oil and gas revenues and earnings from ports and other infrastructure until reaching $500 billion.\nZelenskyy said he would not recognize Trump’s $500 billion figure, as the assistance Ukraine had received from the U.S. was closer to $100 billion.",
        "scraped_at": "2025-12-28T19:06:33.091700",
        "conflict": "Ukraine"
    },
    {
        "source": "Autre",
        "url": "https://apnews.com/article/russia-ukraine-war-interceptors-drones-nato-c7b57962e573b344490b07b2cfead856",
        "title": "Ukraine is leveraging its powerful – and cheap – new drone killers for air defense",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Copyright 2025 The Associated Press. All Rights Reserved.\nCopyright 2025 The Associated Press. All Rights Reserved.\nNightly attacks on Ukrainian cities and power infrastructure have forced Kyiv to rewrite the air defense rulebook and develop cut-price drone killers costing as little as $1,000. Interceptors went from prototype to mass production in just a few months in 2025 and represent the latest shift in modern warfare. (AP video: Vasilisa Stepanenko)\nA serviceman controls an FPV drone of “General Cherry” company at the polygon in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nAn engineer assembles FPV drone of “General Cherry” company at the workshop in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nAn interceptor drone of “General Cherry” company takes off at the polygon in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nFPV drones are seen in a storage of the workshop of “General Cherry” company in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nAn engineer assembles interceptor drone of “General Cherry” company at the workshop in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nKYIV, Ukraine (AP) — The icy ground crackling under their feet, members of anelite Ukrainian drone-hunting team set upfor a long night.\nAntennas and sensors are clipped to a light stand. Monitors and controls are pulled from hard cases, and a game-changing new weapon is readied for deployment.\nA serviceman controls an FPV drone of “General Cherry” company at the polygon in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nThe Sting, shaped like a flying thermos, is one of Ukraine’s new homegrown interceptors.\nThe unit’s commander says the interceptors can effectively counter Russia’s fast-evolving suicide drones, which are now flying faster and at higher altitudes.\n“Every destroyed target is something that did not hit our homes, our families, our power plants,” said the officer, known only by the call sign “Loi,” in line with Ukrainian military protocol. “The enemy does not sleep, and neither do we.”\nNightly attacks on Ukrainian cities and power infrastructure have forced Kyiv to rewrite the air defense rule book and develop cut-price drone killers costing as little as $1,000.\nFPV drones are seen in a storage of the workshop of “General Cherry” company in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nInterceptors went from prototype to mass production in just a few months in 2025 and represent the latest shift in modern warfare.\nEffective defense in Ukraine depends on mass production, rapid adaptation and layering low-cost systems into existing defenses instead of relying on a few expensive, slow-to-replace weapons.\nModels like the Sting – made by the volunteer-driven startup Wild Hornets – and the newly appeared Bullet can surge in speed before crashing into enemy drones. They are flown by pilots watching monitors or wearing first-person-view goggles.\nThe economics are crucial. Andrii Lavrenovych, a member of the strategic council of the fast-growing startup General Cherry which develops the Bullet, says the drones they destroy cost anywhere from $10,000 to $300,000.\n“We are inflicting serious economic damage,” he said.\nRussia favors the Iranian-designed Shahed suicide drone and has produced multiple variants of the triangle-winged craft, armed with jammers, cameras and turbojet engines in a constant battle of innovation.\n“In some areas they are one step ahead. In others, we invent an innovative solution, and they suffer from it,” Lavrenovych said.\nFederico Borsari, a defense analyst at the Washington-based Center for European Policy Analysis, says interceptors are a valuable addition to Ukraine’s — and Europe’s — anti-drone arsenal.\n“Cheap interceptor drones have become so important, and so quickly, that we can consider them a cornerstone of modern counter-unmanned aerial systems,” he said. “They realign the cost and scale equation of air defense.”\nAn engineer assembles interceptor drone of “General Cherry” company at the workshop in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nTheir mobility and low cost allow them to defend more targets, but Borsari added: “It would be a mistake to see them as a silver bullet.”\nTheir success, he said, depends on sensors, fast command and control as well as skilled operators. They can be used in a menu of options that starts with multimillion-dollar missiles and ends with nets and antiaircraft guns.\nDefense planners in Ukraine and NATO expect the hyper-scaling of drone production on both sides of the conflict to continue in 2026, adding urgency to European plans to create a layered air-defense system known as the “drone wall.”\nAn engineer assembles FPV drone of “General Cherry” company at the workshop in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nThe network along Europe’s eastern borders, to be rolled out over two years, is designed to detect, track and intercept drones, with Ukrainian-style interceptors playing a potentially central role in destroying threats.\nUkrainian drone makers are set next year to expand coproduction with U.S. and European firms. Merging battle-tested designs and valuable data with Western scale and funding, the collaboration would boost output and embed Ukraine in NATO-member supply chains.\nAn interceptor drone of “General Cherry” company takes off at the polygon in Ukraine, on Dec. 4, 2025. (AP Photo/Evgeniy Maloletka)\nAnother inevitable trend, Lavrenovych argues, is increased automation.\n“Our mobile groups shouldn’t have to approach the front line, where they become targets,” he said.\n“Drones must become fully autonomous robots with artificial intelligence — as scary as that may sound — to help our soldiers survive.”\nVolodymyr Yurchuk and Efrem Lukatsky contributed to this report.\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "scraped_at": "2025-12-28T19:06:37.353331",
        "conflict": "Ukraine"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/world-europe-61266843",
        "title": "Ukraine war: Aftermath of blast in Ukraine's capital Kyiv",
        "publish_date": "2022-04-28T21:26:11.000Z",
        "author": "N/A",
        "content": "Two Russian strikes have hit Kyiv, officials say, as UN chief Antonio Guterres is in the city for talks with President Volodymyr Zelensky.\nThe explosions in the central Shevchenkivskyi district injured at least three people, Mayor Vitali Klitschko says.\nThe annual food fight festival ''Els Enfarinats'' has left the Spanish town of Ibi covered in flour and egg shells.\nThe French model and actress has died at the age of 91.\nScientists say volcanic activity at the site, which frequently erupts, had intensified this week, with craters continuously emitting ash.\nPope Leo calls for an end to conflicts around the world in Christmas speech.\nThe vehicle had earlier been involved in a crash and everyone in the surrounding area was safely evacuated before the blast.\nThe BBC's diplomatic correspondent James Landale explains how Trump's appoinment of a special envoy to Greenland has shaken diplomatic with Denmark.\nA waterspout is a whirling column of air and mist that can form over oceans, seas or large lakes.\nGermany is introducing voluntary military service to boost national defences after Russia's full-scale invasion of Ukraine.\nThe Royal Family hosted the first German state visit to the UK in 27 years - with a state banquet and ceremonial events in Windsor.\nA council in the Republic of Ireland is seeking information following the \"callous\" beheading of a stag.\nThe event, which saw about 600 sheep cross the Nuremberg's historic centre, took place on Sunday and has become a popular annual tradition.\nFootage shows the moment Russia's first anthropomorphic robot fell just seconds after its debut\nNew Irish President Catherine Connolly says she has been given a \"powerful mandate\" to articulate a vision for a new republic.\nThe online shopping giant opened its first physical shop in the world - in a Parisian department store.\nFive people sustained minor injuries but nobody was seriously hurt in the incident in Meteren.\nTwo nuclear cooling towers in the town of Gundremmingen, Germany, collapse into large swirls of thick, white dust during demolition.\nIt was the first time since the Reformation leaders of the two churches had prayed together.\nBBC News NI's Dublin Correspondent Gabija Gataveckaite recaps the runners and riders in the Irish presidential election.\nKing Charles has become the first head of the Church of England to pray publicly with the Pope\nViolence in Dublin on Tuesday night was intended to intimidate people inside the Citywest building, Garda Commissioner Justin Kelly says.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking.",
        "scraped_at": "2025-12-28T19:06:41.625894",
        "conflict": "Ukraine"
    },
    {
        "source": "CNN",
        "url": "https://edition.cnn.com/2023/08/28/economy/russia-military-spending-economic-impact",
        "title": "The spiraling cost of war means growing economic pain for Russia",
        "publish_date": "Published\n          4:39 AM EDT, Mon August 28, 2023",
        "author": "N/A",
        "content": "“We have no funding restrictions,” Russia’s President Vladimir Putin told a gathering of military top brass in December. “The country, the government will provide whatever the army asks for.” Eighteen months into his war in Ukraine, Putin seems to be keeping that promise.\nBut he’s doing it increasingly at the expense of another, unspoken, compact with the Russian people: to maintain economic stability at home.\nA few weeks before that December meeting, Putin had signed into law a budget that earmarked 4.98 trillion rubles — $52 billionat the current exchange rate — for “national defense” in 2023, a little more than last year’s expenditure. But according to a government document seen by Reuters earlier this month, that forecast has now beendoubled to 9.7 trillion rubles($101 billion). That’s almost three times what Russia spent on defense in 2021, before its full-scale invasion of Ukraine in February 2022.\nRelated articleAfter Prigozhin, who will stick their head above the parapet in Putin's Russia?\nThose figures are likely to underestimate the total spent on Russia’s war effort.The Stockholm International Peace Research Institute, which tracks military expenditure around the world,estimatesthat the “national defense” line in Russia’s official budgets accounts only for around three-quarters of total military spending.\nRichard Connolly, a specialist on the Russian economy at the Royal United Services Institute for Defence and Security Studies, also suggests that military spending this year will far exceed $100 billion. He said that before the war Russia would typically splash around 3-4% of its annual gross domestic product on defense but now it could be anywhere between 8% and 10%.\nIf the price of goods and services in Russia is taken into account, the equivalent amount in dollar terms for 2023 looks even higher, probably closer to $300 billion, estimates Janis Kluge, a senior associate at the German Institute for International and Security Affairs.\nThe Kremlin’s largesse toward its armed forces has already come at a steep economic cost.\nRussia’s budget deficit — the gap between spending and income — has widened sharply since the start of the war, as revenues from oil and gas exports have been hammered by Western sanctions and heavy discounts for remaining buyers. Lower energy prices this year and production cuts aimed at propping them up have added to the pressure.\nRevenues from the oil and gas sector were41% lowerin the January-to-July period than in the same period in 2022.\nThat means the government is having to borrow more. Government debt, currently at 14.9% of GDP, is set to rise.\n“We’ll be increasing our debt, this is a hopeless situation. We will have to do this because our expenditure side is growing,” deputy finance minister Irina Okladnikova said last month. The plan is to stay within the “safe limit” of 20% of GDP, she added. (Russia is still one of the world’s least indebted countries thanks, in part, to its earnings from energy and other commodities.)\nRussia’s exports are still greater than the value of its imports, despite a boost to the latter from the hefty military spending. But that surplus fell by 85% in the first half of the year, compared with the same period in 2022, bringing the country dangerously close to a deficit.\nCountries running such a “current account” deficit usually rely on inflows of foreign capital. But that’s less of an option for Moscow, because of sanctions, Liam Peach, senior emerging markets economist at Capital Economics, told CNN.\n“Russia cannot borrow from abroad, it’s locked out of Western capital markets,” Peach said.\nIn addition, Russia also can’t tap into the large share of its central bank’s foreign exchange reserves that are frozen in the West. That means it could be forced to curtail imports.\nThe rapidly vanishing surplus has contributed to the ruble’s depreciation, according to the Russian central bank. The currency has lost more than 30%of its value this year,weakening past 100 rubles to the dollarearlier this month.\nThe ruble may still fall further, Kluge at the German Institute for International and Security Affairs told CNN.\n“The last thing that they [the government] want is that Russians lose trust in the Russian currency and then at some point maybe start exchanging all the rubles into foreign exchange, because then you would have a vicious cycle. And that could really create some kind of currency crisis in Russia,” he said.\nA weaker ruble translates into rising prices, Russia’s central bank said on August 15 when itjacked up its main interest rateby 3.5 percentage points to 12% at a hastily scheduled emergency meeting. Policymakers said the decision — made the day after the ruble hita 17-month low against the dollar— was “aimed at limiting price stability risks.”\nAnnual consumer price inflation reached 4.3% in July, overshooting the central bank’s target of 4%.\nMore rate hikes,or even the reintroduction of controls aimed at keeping dollars in Russia, may well be needed, even though they are likely to slow economic growth.\nRising military spending is, on the other hand, boosting Russia’s industrial output and, with it, GDP. Last month, the International Monetary Fundupgraded its forecastfor the country’s GDP growth this year to 1.5% from the 0.7% it predicted in April, noting that “a large fiscal stimulus” was driving Russia’s economic strength.\nHowever, “this is not the kind of growth we should be glad about,” said Alexandra Suslina, an independent economist who left Russia shortly after the invasion.\n“If you produce a tank, that of course makes a big contribution to the formal growth of GDP. But that tank won’t plow a field … it won’t help you teach people or give them medical treatment. This is not a stimulus for longer-term development,” she told CNN.\nEconomists acknowledge that Russia’s economy has so far performed better than expected. Suslina argues the traditional resilience of the Russian people has served as an “extra resource.”\n“The Soviet heritage taught people to live literally in poverty, not to count on anything,” she said. “And they are prepared to stay for a long time in that survival mode.”\nAlexandra Prokopenko, a non-resident scholar at the Carnegie Russia Eurasia Center in Berlin, added that Russian policymakers and businesses were likewise adept at handling crises.\nBut the stresses on the economy are intensifying.\nRelated articleRussia may run out of money in 2024, says oligarch\nAlthoughoil prices have risensince late June, they are still far below last year’s peaks, which helped Moscow weather the impact of sanctions. Its revenues from oil exports in July were $4.1 billion lower than a year ago, according toestimates by the International Energy Agency.\n“Russia is in a position where it simply cannot live with a much lower oil price. Macroeconomic stability depends on oil prices staying at current levels,” said Peach at Capital Economics.\nProkopenko said Russia might be able to bankroll the war for another year or so, but if it drags on beyond that the government will have to make “tough choices.”\n“The trade-offs will be that they will need to raise taxes or cut spending on infrastructure, such as building roads and maintaining bridges, because military spending will demand more and more [of the budget],” she told CNN.\nPeach agrees, saying that in the near future Russia will need to plug its budget deficit and may raise taxes on the most profitable sectors of the economy, such as banks and energy companies.\n“Russia’s largest firms will become increasingly subject to those in power. The cost of greater state involvement, isolation from the West and an ongoing commitment to military objectives will be to weaken Russia’s growth prospects and living standards,” he wrote in a note last month.\n—Anna Cooban, Tim Lister and Olesya Dmitracova contributed to this article.",
        "scraped_at": "2025-12-28T19:07:14.089689",
        "conflict": "Ukraine"
    },
    {
        "source": "Autre",
        "url": "https://apnews.com/article/russia-ukraine-war-kremlin-dmitry-peskov-a36f04fbf04b7ff702920f75fade3789",
        "title": "Russia insists on achieving Ukraine goals despite Trump’s ultimatum",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "Copyright 2025 The Associated Press. All Rights Reserved.\nCopyright 2025 The Associated Press. All Rights Reserved.\nUkrainian President Volodymyr Zelenskyy on Saturday said Ukraine’s negotiator had proposed to Russia to resume peace talks next week.\nIn this photo taken from video distributed by Russian Defense Ministry Press Service on Thursday, July 17, 2025, a Russian self-propelled multiple rocket launcher fires towards a Ukrainian position in Ukraine. (Russian Defense Ministry Press Service via AP, file)\nIn this photo provided by the Ukrainian Emergency Service, emergency services personnel work to extinguish a fire following a Russian attack in Kharkiv region, Ukraine, July 5, 2025. (Ukrainian Emergency Service via AP, file)\nKremlin spokesman Dmitry Peskov waits at the Grand Kremlin Palace at the Kremlin in Moscow, Russia, June 23, 2025. (AP Photo/Pavel Bednyakov, Pool, file)\nRussia is open to peace with Ukraine, but achieving its goals remains a priority, Kremlin spokesman Dmitry Peskov said Sunday, days after U.S. PresidentDonald Trump gave Moscow a 50-day deadlineto agree to a ceasefire orface tougher sanctions.\nPeskov and other Russian officials have repeatedly rejected accusations from Kyiv and its Western partners of stalling peace talks. Meanwhile, Moscow continues to intensifyits long-range attackson Ukrainian cities, launching more drones in a single night than it did during some entire months in 2024, and analysts say the barrages are likely to escalate.\nRussian PresidentVladimir Putin“has repeatedly spoken of his desire to bring the Ukrainian settlement to a peaceful conclusion as soon as possible. This is a long process, it requires effort, and it is not easy,” Peskov told state television in an interview.\n“The main thing for us is to achieve our goals,” he said. “Our goals are clear.”\nThe Kremlin has insisted that any peace deal should see Ukraine withdraw from the four regions that Russia illegally annexed in September 2022, but never fully captured. It also wants Ukraine to renounce its bid to join NATO and accept strict limits on its armed forces — demands Kyiv and its Western allies have rejected.\nIn his nightly address on Saturday, Ukrainian PresidentVolodymyr Zelenskyysaid that his officials have proposed a new round of peace talks this week. Russian state media on Sunday reported that no date has yet been set for the negotiations, but said that Istanbul would likely remain the host city.\nTrump threatened Russia on July 14 with steep tariffs and announced a rejuvenated pipeline for American weapons to reach Ukraine, hardening his stance toward Moscow after months of frustration following unsuccessful negotiations aimed atending the war. The direct Russia-Ukraine negotiations in Istanbul resulted in several rounds of prisoner exchanges but little else.\nTheU.S. presidentsaid that he would implement “severe tariffs” unless a peace deal is reached within 50 days. He provided few details on how they would be implemented, but suggested they would target Russia’s trading partners in an effort to isolate Moscow in the global economy.\nIn addition, Trump said that European allies would buy “billions and billions” of dollars of U.S. military equipmentto be transferred to Ukraine, replenishing the besieged country’s supplies of weapons. Included in the plan are Patriot air defense systems, a top priority for Ukraine as it fends offRussian dronesand missiles.\nDoubts were recently raised about Trump’s commitment to supply Ukraine whenthe Pentagon paused shipmentsover concerns that U.S. stockpiles were running low.\nElsewhere, Ukraine’s air force said that it shot down 18 of 57 Shahed-type and decoy drones launched by Russia overnight into Sunday, with seven more disappearing from radar.\nTwo women were wounded in Zaporizhzhia, a southern Ukrainian region partly occupied by Russia, when a drone struck their house, according to the regional military administration. Two more civilians were wounded in Ukraine’s northeastern Kharkiv province, after a drone slammed into a residential building, local Ukrainian officials said.\nLater Sunday, drones struck a leafy square in the center of Sumy, wounding a woman and her 7-year-old son, officials said. The strike also damaged a power line, leaving around 100 households without electricity, according to Serhii Krivosheienko, of the municipal military administration.\nMeanwhile, Russia’s Defense Ministry said that its forces shot down 93 Ukrainian drones targeting Russian territory overnight, including at least 15 that appeared to head for Moscow. At least 13 more drones were downed on the approach to the capital on Sunday, Mayor Sergei Sobyanin said. One drone struck a residential building in Zelenograd, on the outskirts of Moscow, damaging an apartment, but caused no casualties, he said.\nFollow AP’s coverage of the war in Ukraine athttps://apnews.com/hub/russia-ukraine\nCopyright 2025 The Associated Press. All Rights Reserved.",
        "scraped_at": "2025-12-28T19:07:18.858373",
        "conflict": "Ukraine"
    }
]