[
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israeli-military-sees-hamas-war-lasting-all-2024-report",
        "title": "Israeli military sees Hamas war lasting through all of 2024: report",
        "publish_date": "January 30, 2024 7:11am EST",
        "author": "ByAnders HagstromFox News",
        "content": "Iran-backed militia groups have carried out at least 160 attacks on US targets in Iraq and Syria since October 17.\nThe Israeli military expects the war against Hamas to continue through the end of 2024 and possibly even into 2025, an Israeli intelligence official told reporters on Tuesday.\nIsraeli Defense Forces(IDF) are currently engaged in the heaviest fighting around the city of Khan Younis, the largest city in southern Gaza. The Israeli intelligence officer briefing reporters on Tuesday said the IDF has killed \"at least a quarter\" of Hamas' estimated fighting force of 35,000, and at least another quarter are wounded, according to Bloomberg.\nHamas' vast network of tunnels have allowed many of its troops and leaders to operate despite Israeli control of much of the territory.\nThe Israeli official said Israel remains far away from achieving its stated goals of capturing Hamas' leaders and ammunition reserves and rendering Hamas military bases and tunnels inoperative, Bloomberg reported.\nAUSTRIA SUSPENDS PAYMENTS TO UNRWA AMID ISRAELI ALLEGATIONS UN WORKERS HELPED, CELEBRATED HAMAS\nThe Israeli military expects the war against Hamas to continue through the end of 2024 and possibly even into 2025, according to Israeli officials.(Reuters/Ronen Zvulun)\nThe city's network of tunnels is even more expansive than that of Gaza City to the north. Israeli operations have also gathered extensive intelligence on how Hamas operates, particularly in how it coordinates rocket attacks against Israel.\nFor weeks, Hamas has remained capable of launching barrages into Israel even from areas largely under Israeli control. The intelligence officer stated that Hamas terrorists, once given the order, will bring a timed detonator to a pre-prepared launch site, prime the rockets, and then leave. Some time later, the battery of rockets will fire, according to Bloomberg.\nIsraeli Prime Minister Benjamin Netanyahu stated at the beginning of January that the war will last \"many more months,\" and vowed that Israel would not relent until Hamas is destroyed.\nHamas leader Yahya Sinwar remains at large, though he is believed to be somewhere within Khan Younis.\nThe IDF also detailed anoperation on Mondayin which it blew up a Hamas tunnel underneath a cemetery.\nISRAELI FOREIGN MINISTRY CALLS FOR UNRWA COMMISSIONER TO RESIGN AMID ALLEGATIONS ITS WORKERS ASSISTED HAMAS\nIsraeli soldiers raided the tunnel system in the Bani Suheila neighborhood in the southern Gaza city of Khan Younis, finding explosives, sliding doors and blast-proof doors, the IDF said. Terrorists were still inside, according to theIsraeli military,and were killed.\nHamas leader Yahya Sinwar remains at large, though he is believed to be somewhere within Khan Younis.(MAHMUD HAMS/AFP via Getty Images)\nThe tunnels housed the office of a Hamas commander, an operations room, and living quarters for senior members of Hamas, according to the IDF. It said the tunnel was used to plan attacks against the military, as well as the deadly Oct. 7 attack on Israel.\nISRAEL TO BAN REBUILDING OF ISRAELI SETTLEMENTS IN GAZA FOLLOWING CONCERNS FROM BIDEN ADMIN\nAn Israeli soldier is seen in the Gaza Strip city of Khan Younis on Saturday, Jan. 27.(AP/Sam McNeil)\nCLICK TO GET THE FOX NEWS APP\nAs Israel moves forward with a ground and aircampaign in Gaza,Hamas officials in the besieged enclave say over 26,000 Palestinians have been killed.\nFox News' Stephen Sorace contributed to this report\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on X: @Hagstrom_Anders.",
        "scraped_at": "2025-12-23T09:41:04.194876",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "The Guardian",
        "url": "https://www.theguardian.com/world/2025/jan/15/the-devastating-impact-of-15-months-of-war-on-gaza",
        "title": "The devastating impact of 15 months of war on Gaza",
        "publish_date": "N/A",
        "author": "Emma Graham-Harrison",
        "content": "Israel began bombing Gaza on 7 October 2023, after Hamas crossed the border, killed approximately 1,200 people and took 251 others hostage to Gaza.\nWhen ground operations began a week later, most observers in Israel and beyond expected the fighting to last weeks. Instead, it extended for 15 monthsuntil Wednesday’s announcement of a ceasefire, to become Israel’s longest war since the 1948 conflict that led to the country’s creation.\nThe majority of those killed by militants on 7 October were civilians, and the scale and ferocity of the attack was unprecedented. So was the scale and ferocity of Israel’s response.\nAfter onebrief ceasefire and hostage release dealin November 2023, Israeli prime minister Benjamin Netanyahu vowed to keep fighting, promising “total victory” over Hamas.\nThe impact of the campaign on civilians living in Gaza led to accusations of genocide, including from rights groups, scholars and foreign governments. South Africabrought a caseto the international court of justice.\nOmer Bartov, a former soldier in the Israel Defense Forces and historian of genocide,wrotethat by May 2024 “it was no longer possible to deny that Israel was engaged in systematic war crimes, crimes against humanity and genocidal actions”.\nThe UN Human Rights Officesaid in Novemberthat data on verified deaths indicates “an apparent indifference to the death of civilians and the impact of the means and methods of warfare”.\nEven Israel’s staunchest ally, the United States,restricted some weapons shipmentsover the concerns, and in September the UKsuspended some arms export licencesowing to Israel’s conduct of the war.\nNetanyahu and his former minister of defence Yoav Gallant have beenissued with arrest warrants by the international criminal courtfor alleged war crimes relating to the conflict. TheHamas military leader Mohammed Deifhas also been issued with an arrest warrant.\nBelow is a summary of the cost of the war forGazaand its people.\nMore than 46,000 Palestinians have been killed inside Gaza by Israeli attacks, according to health officials in the territory. Most of the dead are civilians, and the total represents about 2% of Gaza’s prewar population, or one in every 50.\nMore than 40,000 have been identified, including 13,319 child victims, theyoungest only a couple of hours old. The elderly dead include a 101-year-old great-great-grandfather.\nAnother 110,000 have been wounded, over a quarter of whom now live with life-changing injuries including amputations, major burns and head injuries.\nYet these figures do not tell the full story of Palestinian losses. The official count of the war dead includes only those killed by bombs and bullets, whose bodies have been recovered and buried.\nAbout 10,000 people killed by airstrikes are thought to be entombed in collapsed buildings, because of the lack of heavy equipment or fuel to dig through steel and concrete ruins looking for them.\nAstudy published this monthfound the official toll underestimated deaths from traumatic injuries in the first nine months of the war, failing to capture two in every five casualties. That would suggest that by October 2024 “the true mortality figures probably exceeded 70,000”, the authors wrote.\nHunger, lack of shelter and medication, the rapid spread of infectious diseases and the collapse of the healthcare system have killed many other Palestinians during the war. Authoritiesplan to count those dead when the fighting stops, Dr Marwan al-Hams, the director of field hospitals at the ministry of health, has said.\nIsraeli officials question the death toll given by the authorities in Gaza, arguing that because Hamas controls the government there, Gaza’s health officials cannot provide reliable figures.\nBut doctors and civil servants in the territory have acredible record from past wars. After several conflicts between 2009 and 2021, UN investigators drew up their own lists of the dead and found they closely matched ones from Gaza.\nIsrael’s campaign of intense aerial bombing and mass demolitions has levelled swathes of Gaza, and left whole neighbourhoods barely habitable.\nNine in 10 homes in the territory have been destroyed or damaged, thelatest UN figures show. Schools, hospitals, mosques, cemeteries, shops and offices have also been repeatedly hit.\nThe devastation is so intense that some experts say that the large-scale destruction of homes and the infrastructure of daily life should be recognised as anew war crime: “domicide”.\nEven where homes are still standing, many residents have been forced to leave. Eighty percent of Gaza’s territory was placed under evacuation orders that werestill active in late December.\nSome 1.9 million people have been displaced,90% of the population, with many of them forced to move repeatedly.\nHundreds of thousands now are living in tent cities and severely overcrowded shelters with poor sanitation and access to little clean water. Shelters have also been attacked.\nFor rebuilding to start, Gaza will need a staggering clean-up operation. The war has left over 40m tonnes of debris, in collapsed buildings that may be laced with explosives including boobytraps and unexploded bombs. It could take over a decade to remove, a top UN de-mining official warnedin spring.\nThe Israeli military says its fight is againstHamas and not Gaza, that its bombardment is proportional to threats and that it makes every effort to warn citizens of imminent attacks.\nAlmost every school building in Gaza has been damaged or destroyed, and none are in operation. Gaza’s 660,000 school-age children have not had any access to formal education for more than a year.\nThe war will set education back there by up to five years, and risks creating a lost generation of permanently traumatised youth,a studyby Cambridge academics and the UN found.\nThere were 564 school buildings in Gaza on 7 October 2023. Of these, 534 have been damaged or destroyed and 12 are classified as “possible damage”. The status of the remaining 18 schools is “currently not known”, Unicef said in anOctober report.\nSchools run by the Unrwa agency for Palestinian schools have been converted into emergency shelters. They host large numbers of displaced people and are clearly marked on maps, but many have been bombed, with sometargeted multiple times.\nIsrael says strikes targetedHamasfighters, claiming they shelter in the buildings and use civilian residents as human shields.\nIsraeli forces repeatedly bombed, besieged and attacked hospitals in Gaza throughout the war. Medics were killed, injured, detained and tortured.\nThere were 654 attacks on health facilitiesrecordedsince the start of the war, the World Health Organization (WHO) said in January 2025.\nOver 1,050 healthcare workers, including nurses, paramedics, doctors, and other medical personnel were killed, many in their place of work. Dozens of others were detained, and at least threedied in Israeli custody.\nAt the end of 2024, just 17 of Gaza’s 36 hospitals were even partially functional. Services were boosted by 11 field hospitals, but Israeli controls on the entry of aid and relief workers meant these wereoften short of doctors and medical supplies.\nA UN commission concluded that Israel’s “relentless and deliberate attacks on medical personnel and facilities” constituted war crimes.\nThey amounted to “a concerted policy to destroy Gaza’s healthcare system as part of a broader assault on Gaza”, the UN Independent International Commission of Inquiry on the Occupied Palestinian Territoryfound.\nThe lack of hospitals, healthcare staff and medication compounded the suffering of people injured in the war, and suffering from diseases caused or compounded by lack of shelter, food and clean water.\nIn 2024, more than 1.2 million respiratory infections were recorded, along with 570,000 cases of acute diarrhoea,UN figures showed.\nIsraeli controls on aid entering Gaza, and the destruction of agricultural production inside the territory, led to widespread hunger and malnutrition.\nIn November 2024, the UN said aid and commercial shipments into Gaza were at thelowest levelssince October 2023, and an international watchdog said faminewas likely “imminent”in the northern Gaza Strip.\nIn January the UNsaid96% of children under two years old and women in Gaza were not getting their required nutrients, 345,000 people faced catastrophic food shortages, and 876,000 faced emergency levels of food insecurity.\nMalnutrition in pregnancy and childhood stunts mental and physical development, so many children who survived the war will endure lifelong impacts from food shortages.\nIsrael said it did not limit aid shipments and blamed logistics failures at aid agencies, or Hamas theft of food aid, for any shortages.\nAt least half Gaza’s tree coverhas been razed, soil and water have been contaminated and there is huge damage to agricultural land. The destruction will have long-term impacts on ecosystems, biodiversity, food security and the health of residents, ecologists and academics say.\nSome damage has come directly from Israeli attacks on farms and other infrastructure.\nBy March this year, approximately 40% of the land in Gaza previously used for food productionhad been destroyed, an investigation by Forensic Architecture found. Satellite analysisrevealed to the Guardianshows farms devastated and nearly half of the territory’s trees razed.\nThe Israeli military damaged or destroyed least 31 of 54 water reservoirs by late August, Human Rights Watchfound. Toxic residue from munitions and fires have polluted both soil and water supplies.\nOther forms of damage have been indirect. When Israel cut off fuel, electricity and chemical supplies within the first week of the war, all wastewater treatment and most sewage pumping plants were forced to shut down, leading to sewage overflows into the sea and groundwater.\nAmid widespread aid shortages Gaza’s hungry and freezing residents have also burned toxic plastics and cut down trees to use the wood for fuel and cooking.\nPalestinians killed in Gaza:46,707\nChildren confirmed killed in Gaza:13,319\nPalestinians reported buried under rubble in Gaza:11,000\nPalestinians injured in Gaza:110,265\nPalestinians displaced in Gaza:1.9 million(90% of the population)\nAttacks on healthcare facilities during the war:654\nHealth workers killed:1,060\nSchools damaged or destroyed:534(95% of schools)\nChildren out of formal education:660,000(all school-age children)\nHomes damaged or destroyed:436,000(92% of total)\nPeople killed inside Israel on 7 October 2023: about1,200\nPeople abducted to Gaza from Israel on 7 October 2023:251\nHostages still in Gaza in January 2025:101(37 believed dead)",
        "scraped_at": "2025-12-23T09:41:07.893967",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/idf-seized-weapons-cache-supplies-hamas-terror-groups-attack-israel",
        "title": "IDF seized weapons cache, supplies from Hamas during terror group's attack on Israel",
        "publish_date": "October 16, 2023 12:54am EDT",
        "author": "ByLandon MionFox News",
        "content": "Aviad Arik Herman tells 'Sunday Night In America' about the 'chaotic' terrorist attack in Israel.\nIsrael Defense Forcesconfiscated a large cache of weapons and supplies from Hamas terrorists amid the attack against Israel, the group announced Sunday.\nThe weaponry removed from Hamas' possession included rockets, grenades, rocket-propelled grenades and ammunition. The IDF pointed to labels on the weaponry that it says show the materials were produced by Hamas.\nThe seized weapons account for just 20% of the ones used by Hamas to kill Israelis, the IDF wrote on X, formerly known as Twitter.\nAll the confiscated weapons were used in the Oct. 7 attack against Israel, according to the IDF.\nBLINKEN SAYS HAMAS TO BLAME FOR FOREIGN NATIONALS NOT BEING ABLE TO LEAVE GAZA; EGYPT READY TO HELP\nIDF confiscated weapons, including rockets, grenades, rocket-propelled grenades and ammunition, from Hamas terrorists.(Fox News/Yaniv Turgeman)\n\"In order to prevent further attacks, the IDF will see to the removal ofHamas’ terrorist infrastructureand weapon manufacturers in Gaza,\" the IDF added.\nMore than 3,600 people have been killed since Hamas launched its largest attack against the Jewish State in decades, leading to retaliatory action from Israeli forces. Thousands more have been wounded, and many others have been taken hostage by Hamas and raped, tortured and murdered.\nVATICAN OFFERS TO MEDIATE ISRAEL-GAZA CONFLICT, NEGOTIATE HOSTAGE RELEASE\nIDF says the weapons seized from Hamas account for 20% of the ones used to kill Israelis.(Fox News/Yaniv Turgeman)\nCLICK HERE TO GET THE FOX NEWS APP\nThe IDF said the large quantity of medical equipment, food and other supplies found in Hamas' possession is evidence that the terror group was prepared for along-term conflict.\nHundreds of documents and certificates, and hundreds of cell phones, other forms of communication and cameras used by Hamas have also been confiscated.",
        "scraped_at": "2025-12-23T09:41:11.804763",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israeli-defense-forces-release-video-showing-evidence-hamas-weapons-tunnels-linking-hospital-basements",
        "title": "Israeli Defense Forces release video showing evidence of Hamas weapons, tunnels linking to hospital basements",
        "publish_date": "November 13, 2023 4:25pm EST",
        "author": "ByGreg WehnerFox News",
        "content": "IDF official shows exclusive footage from the operations of Flotilla 13 and the 401st Brigade Combat Team in the Rantisi Hospital.\nVideo footage released byIsrael Defense Forcesshows the inside of a tunnel system used by Hamas terrorists, connecting to a hospital where the militants based operations.\nIn the video, IDF spokesman Rear Adm. Daniel Hagari stands in front of the house of a senior terrorist who led the raids into Israel, which is next to a school and about 200 yards from a hospital.\nHagari then shows an operational tunnel with electrical wires going down about 20 meters into the tunnel, which leads to a bulletproof and explosive-proof door.\nGAZA HOSPITAL COVERAGE PROVES MEDIA NEEDS TO BE SKEPTICAL OF SOURCES, EXPERT SAYS: ‘ALL THE FACTS WERE WRONG’\nMotorcycle with bullet hole found in tunnel leading to basement of Rantisi Hospital in Gaza.(IDF)\nThe IDF spokesman intended to show \"clear evidence\" that the tunnels were connected to the Rantisi hospital that Hamas used as a base.\nHe then leads the camera crew into the tunnel and to the hospital, where evidence is found that a Hamasoperation was conducted.\n\"We are now in the area of the basement of the hospital. I want to show you a room where we found all the gear, the operational gear of Hamas,\" Hagari said. \"Look at what Hamas is holding inside the hospital. I want you to understand, this kind of gear is gear for a major fight.\"\nMEDIA HAS EGG ON ITS FACE FOR ALLOWING HAMAS TO SET INITIAL TONE OF GAZA HOSPITAL COVERAGE WITHOUT SKEPTICISM\nHamas gear found in basement under Rantisi Hospital included hand grenades, vests packed with explosives, and rocket propelled grenades (RPGs).(IDF)\nThe gear Hagari was referring to included hand grenades,vests packed with explosives, and rocket propelled grenades (RPGs).\n\"This is Hamas firing RPGs from hospitals,\" he said, explaining these are the type of people Israel is fighting against.\nThe next shot showed a motorcycle in the basement.\nMEDIA RUNNING HAMAS NARRATIVE ON GAZA HOSPITAL 'DIRECTLY CONTRIBUTED' TO ENDANGERING US EMBASSIES ABROAD\nA chair found with rope and women's clothing at the leg, found in tunnel leading to basement of Rantisi Hospital in Gaza.(IDF)\nMotorcycles were used in the Oct. 7 invasion of Israel by Hamas terrorists who conducted the massacre and slaughter of innocent civilians.\nThe motorcycle Hagari pointed to had a bullet hole, and he suggested it was used in the Oct. 7 invasion, though it was still being researched.\nA short distance from the motorcycle was a chair with women’s clothing and a rope next to the legs of the chair.\nAbove the chair was a baby bottle on a metal box with a World Health Organization sign.\nNEW YORK TIMES ADMITS IT RELIED 'TOO HEAVILY' ON HAMAS CLAIMS IN INITIAL REPORT ON GAZA HOSPITAL EXPLOSION\nA baby bottle found on top of a box with the World Health Organization logo in tunnel leading to basement of Rantisi Hospital in Gaza.(IDF)\nIDF officials suspect the space was used to hold hostages.\nHagari showed diapers in the basement area, as well as an improvised ventilation system, toilets, a shower, a small kitchen and a hideout for hostages with curtains covering up a wall made of cinder blocks.\n\"There’s no reason to put up a curtain unless you want to film hostages and deliver movies,\" he said before walking over to more evidence that included a list in Arabic that he said was for the operation against Israel. \"This is a guardian list where every terrorist writes his name and every terrorist has his own shift, guarding the people that were here.\"\nThe video comes just weeks after another IDF spokesperson, Lt. Col. Peter Lerner, blasted mainstream media outlets for running with Hamas’ claim that Israel was responsible for an explosion that rocked the al-Ahli Baptist Hospital in Gaza City.\nIsrael had been accused of shooting missiles at the hospital, though it was ultimately determined that Hamas fired missiles from Gaza, and one went rogue before striking near the hospital, discrediting claims there was a direct hit on the facility.\nCLICK HERE TO GET THE FOX NEWS APP\nHamas has also been accused of using civilians as shields, as they hide among the population and wear civilian clothing during their attacks.\n\"This is an organization that will butcher babies in their bedrooms, they’ll have no problem lying to you,\" Lerner said at the time.\nBrian Flood of Fox News Digital contributed to this report.\nGreg Wehner is a breaking news reporter for Fox News Digital.\nStory tips and ideas can be sent to Greg.Wehner@Fox.com and on Twitter @GregWehner.",
        "scraped_at": "2025-12-23T09:41:15.070769",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israeli-troops-enter-al-shifa-hospital-killing-hamas-terrorists-gate-side-firefight",
        "title": "Israeli troops enter Al-Shifa Hospital after killing Hamas terrorists in gate-side firefight",
        "publish_date": "November 15, 2023 7:34am EST",
        "author": "ByAnders HagstromFox News",
        "content": "FOX News' Trey Yingst reports from Israel with the latest on the IDF's offensive against Hamas in the Gaza Strip.\nIsraeli troops have enteredAl-Shifa Hospital in Gaza following a firefight with Hamas terrorists at the gate on Wednesday.\nIsraeli Defense Forces (IDF) had surrounded the facility for days, saying Hamas had placed its headquarters in tunnels beneath the hospital. While Hamas denies the claim, its fighters engaged in intense gunbattles with Israeli troops around the complex.\nAt least one doctor at the hospital said Israel warned staff of their plans to enter the complex on Wednesday. Troops say they brought medical supplies for patients inside, who had suffered for days under dwindling supplies and fuel.\n\"Before entering the hospital our forces were confronted by explosive devices and terrorist squads, fighting ensued in which terrorists were killed,\" the IDF said in a statement.\nWATCH: BIDEN OFFICIAL, REPORTER CLASH IN HEATED DEBATE OVER ADMIN ALLOWING BILLIONS IN FUNDING FOR IRAN\nIsraeli Defense Forces operate inside Al-Shifa Hospital in Gaza City on Wednesday, Nov. 15, 2023.(Israeli Defense Forces)\nIsraeli troops entered Al-Shifa Hospital in Gaza following a firefight with Hamas terrorists at the gate on Wednesday.\n\"We can confirm that incubators, baby food and medical supplies brought by IDF tanks from Israel have successfully reached the Shifa hospital. Our medical teams and Arabic speaking soldiers are on the ground to ensure that these supplies reach those in need,\" it added.\nNEWLY RELEASED PHOTOS SHOW MYSTERIOUS COCAINE DISCOVERED IN WHITE HOUSE\nThe fate of the hundreds of patients inside the hospital had been a focus of international concern for days prior to Israel's assault. The hospital said that at least two children born prematurely had died due to a lack of available medical care.\nAn infographic produced by the Israeli Defense Force shows where officials claim Hamas has created a command center under Al-Shifa Hospital.(Israeli Defense Force)\nIsrael says it attempted to provide some 300 liters of fuel to the hospital earlier this week, but thatHamas administratorshad refused to exchange.\nWH REFUSES TO SAY IF IT WILL SUPPORT COOPERATION WITH SUBPOENA IN BIDEN CLASSIFIED DOCS INVESTIGATION\nDr. Ahmed El Mohallalati, a surgeon at the hospital, told Reuters that Israel had informed staff that they planned to enter the hospital and search it. Israel has yet to reveal the results of a search as of early Wednesday morning.\nResidents in Gaza had used the Al-Shifa Hospital as a refuge amid Israel's war against Hamas.(BASHAR TALEB/AFP via Getty Images)\n\"We realized that the tanks are moving around the hospital. One of the big tanks entered within the hospital from the eastern main gate, and they were, they were they just parked in the front of the hospital emergency department,\" Mohallalati told the outlet.\nCLICK HERE TO GET THE FOX NEWS APP\nWhite House officials confirmedIsrael's claim that Hamas was using the hospital as a base on Tuesday.\n\"I can confirm for you that we have information that Hamas and the Palestinian Islamic Jihad used some hospitals in the Gaza Strip, including Al-Shifa, and tunnels underneath them to conceal and support their military operations and to hold hostages,\" Kirby told reporters while aboard Air Force One.\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on X: @Hagstrom_Anders.",
        "scraped_at": "2025-12-23T09:41:18.789179",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/urban-warfare-expert-says-israeli-military-taking-unprecedented-steps-to-protect-gaza-civilians",
        "title": "Urban warfare expert says Israeli military taking unprecedented steps to protect Gaza civilians",
        "publish_date": "February 17, 2024 10:00am EST",
        "author": "ByRuth Marks EglashFox News",
        "content": "Israeli soldiers operating against Hamas and other terrorists in close-quarters fighting in Gaza. (Video: IDF Spokesman's Unit.)\nJERUSALEM — One of the top urban warfare experts in the U.S. believes the Israeli military is taking unprecedented measures — above and beyond what most armies do — to avoid harming Palestinian civilians as it battles theIslamist terror group Hamasin Gaza.\nHe adds that comparisons cannot be drawn between the intensity of the four-month-old war and other recent conflicts.\nAs Israel gears up for what could be the fiercest and most complicated battle in the Strip’s southernmost city, Rafah, John Spencer, chair of the Urban Warfare Studies Modern War Institute at West Point and an author of multiple books on the subject of urban warfare, told Fox News Digital the \"steps that Israel has taken to prevent casualties is historic in comparison to all these other wars.\"\n\"Israel has taken more steps to avoid harming civilians than any other military in history,\" said Spencer, who served for more than 25 years in the U.S. military, reaching the rank of major. He says that such lengths would set a new standard that other Western militaries would struggle to follow in the future.\nUN, HUMAN RIGHTS, MEDIA GROUPS RELY ON HAMAS DEATH TOLL IN 'SYSTEMATIC DECEPTION': EXPERT\nIDF officers go over maps in Khan Younis, Gaza.(IDF Spokesman's Unit)\nIsrael launched its war in the Gaza Strip following Hamas’ Oct. 7 terror attack that killed more than 1,200 people, mostly civilians, and saw some 240 people taken hostage, including babies, children, women and the elderly. Since starting its ground invasion of the Palestinian enclave, however, Israel’s military has faced sharp criticism as even its close allies, including the U.S., cite a death toll based on Hamas data.\nAccording to figures published daily by the Hamas-run Health Ministry, the number of deaths has surpassed 28,000, without distinguishing between civilians and combatants. On Tuesday, IDF Chief of Staff Lt. Gen. Herzi Halevi said that at least a third of those killed, some 10,000, were Hamas terrorists, including many of the Iranian-backed group’s commanders.\n\"What has really blown my mind is that Israel issued maps to the civilians [in Gaza] telling them where they would be operating each day. … I've never seen a military do that\"\n\"Despite the numbers, Israel is setting the bar very high on civilian harm mitigation steps,\" said Spencer, who is also host of the \"Urban Warfare Project\" podcast and serves as the chair of Urban Warfare Studies at the New York-basedMadison Policy Forum.\nIDF troops in Khan Younis.(IDF Spokesman's Unit)\nHe outlined how the Israeli military took measures that no other military, including the U.S., has previously takenduring war, such as calling and texting individuals to warn them of a forthcoming air strike and sharing maps with plans for military maneuvers in certain areas.\n\"We’ve never called everybody in a war environment. We’ve never actually sat down thousands of soldiers in call centers and had them call into the combat area trying to reach imams and mayors in an effort to get everybody get out of harm's way,\" noted Spencer.\nBIDEN ADMIN CONTINUES PUSH FOR TWO-STATE SOLUTION AS CRITICS WARN: 'EFFORTS REPEATEDLY FAIL'\nAn aerial view of the United Nations Relief and Works Agency for Palestine Refugees tent camp, where hundreds of Gazan families fleeing Israeli attacks are trying to survive with limited means and difficult conditions in Khan Younis, Gaza, Nov. 27, 2023.(Ashraf Amra/Anadolu via Getty Images)\n\"The element of surprise is usually a top priority in wars, but Israel is giving up all of that in order to prevent civilian harm\"\n\"As someone who teaches division level urban warfare, what has really blown my mind is that Israel issued maps to the civilians [in Gaza] telling them where they would be operating each day. … I've never seen a military do that,\" said Spencer, who visited Israel last month and toured the combat zone in and around Gaza.\n\"Doing this puts the attacking military at a disadvantage because it signals to the defending military what they’re doing,\" he said. \"The element of surprise is usually a top priority in wars, but Israel is giving up all of that in order to prevent civilian harm.\n\"If that is going to be the standard going forward, I don't know how the U.S. military and others are going to do that. We’re not going to send text messages. We’re not going to be able to put out maps, even if we do decide to give warnings.\"\nIDF Activity in Gaza(IDF Spokesman's Unit)\nSpencer, who has examined U.S. military actions inIraq and Afghanistanand multiple other modern-day conflicts, said those criticizing Israel, including the media and countries such as South Africa, are ignorant of previous conflicts and a failure to fully understand the laws of warfare.\nSouth Africa recently brought a case to the International Court of Justice accusing Israel of committing genocide in Gaza.\nISRAEL REJECTS UN, AID AGENCIES CRITICISM THAT GAZA IS ON BRINK OF STARVATION: 'NO SHORTAGE OF FOOD'\n\"There are a couple of camps of people observing the Gaza War,\" he said. \"One group sees anything Israel does as wrong because they believe that Israel is the oppressor and the Palestinian people are the oppressed. So, no matter the context of the Oct. 7 attack or the hostages, anything Israel does is with ill intention.\nA picture taken from the border between Israel and Gaza shows leaflets being dropped by the Israeli army over Gaza City telling people to evacuate the area on November 16, 2023. Photo by JACK GUEZ/AFP via Getty Images(Photo by JACK GUEZ/AFP via Getty Images)\n\"The other camp,particularly in the United States, is made up of people that are really bad at history, even our own history,\" said Spencer, pointing out that few people study the details of modern-day urban combat.\n\"It is hard to find people who actually know what the army did in our own conflicts in places like Fallujah and Mosul [in Iraq],\" he said, pointing out that using Google or Wikipedia references to find out more about conflicts that might be considered similar to Gaza fails to provide adequate information.\nThis photograph taken on January 20, 2024 in Rafah in the southern Gaza Strip shows a man holding one of the leaflets, which were dropped by Israeli forces over the city, showing portraits of Israeli hostages held in Gaza since the October 7 attacks by Hamas in southern Israel. The leaflet reads (bottom-right) \"Do you want to go home? Please report any information if you recognise any of them.\"(AFP via Getty Images)\n\"When the war in Gaza started, for example, people Googled it and found articles saying Gaza is the densest place on earth and that just became a worldwide slogan,\" Spencer noted. \"People do need comparisons if they’re really honestly trying to understand versus just grasping at anything that makes Israel look bad. But no [other military] has ever faced anything like this.\"\nUsing the example ofHamas’ vast network of terrortunnels that snake below many urban areas in Gaza, Spencer emphasized that the realities of warfare in the Palestinian enclave were unlike anywhere else.\n\"Tunnels aren’t new, but building them underneath civilian structures for the sole purpose of using the laws of war against the military is,\" he said. He added that general ignorance about urban warfare and the unique setting of Israel’s particular war in Gaza, combined with a lack of knowledge about the laws of war, meant Israel was being held to unfair standards.\nEXCLUSIVE: ISRAEL CREATES AI PLATFORM TO MONITOR THE HUMANITARIAN SITUATION IN GAZA\nSmoke rises over buildings as Israeli airstrikes continue in the Al-Rimal neighborhood of Gaza City, Gaza, Oct. 9, 2023(Ali Jadallah/Anadolu Agency via Getty Images)\n\"There's a lot of myths out there, including among those who took Israel to the ICJ,\" Spencer said. \"The case against Israel included a lot of myths, not just about what happened but what is lawful, what is historical precedent and what’s happened in the past.\"\nDiscussing the Geneva Conventions, a series ofinternational humanitarian lawswritten following World War II to enshrine legal standards for humanitarian treatment in war, Spencer said they were designed to never repeat what happened in Europe, \"but it’s like we want to erase our memory as well.\"\n\"I think the Geneva Conventions were amazing and good to enforce, but the problem is people don’t understand that what they're seeing is actually what it looks like to follow the rules,\" he said. \"We build a system where people who don't want to follow rules, like Hamas, want to use those rules against the people following them.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I want the world to do more to stop people who don't follow the laws,\" said Spencer. \"Israel is not only being held to a ridiculous standard that nobody else has ever been held to. But it is also really testing thepost-World War IIway of warfare against a context that nobody else has faced.\"\nRuth Marks Eglash is a veteran journalist based inJerusalem, Israel. She reports and covers theMiddle EastandEurope. Originally from the U.K, she has also freelanced for numerous news outlets. Ruth can be followed on Twitter @reglash",
        "scraped_at": "2025-12-23T09:41:23.544842",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/idf-investigating-whether-hamas-chief-yahya-sinwar-killed-gaza-operations",
        "title": "Hamas terror leader Yahya Sinwar killed in Gaza, Israel says",
        "publish_date": "October 17, 2024 10:14am EDT",
        "author": "ByGreg Norman,Ruth Marks Eglash,Efrat Lachter,Louis Casiano,Greg WehnerFox News",
        "content": "Former Israeli Ambassador to the U.S. Michael Oren says the killing of Hamas leader Yahya Sinwar is an incredible moment for Israel, the U.S. and the free world.\nHamas terror chief Yahya Sinwarhas been killed during an Israeli military operation in the Gaza Strip, the Israel Defense Forces (IDF) announced Thursday.\nThe IDF and Israel's Shin Bet intelligence agency released a joint statement saying it can \"confirm that after a year-long pursuit, yesterday (Wednesday), October 16, 2024, IDF soldiers from the Southern Command eliminated Yahya Sinwar, the leader of the Hamas terrorist organization, in an operation in the southern Gaza Strip.\"\n\"Yahya Sinwar planned and executed the October 7th Massacre, promoted his murderous ideology both before and during the war, and was responsible for the murder and abduction of many Israelis,\" the statement added. \"Yahya Sinwar was eliminated after hiding for the past year behind the civilian population of Gaza, both above and below ground in Hamas tunnels in the Gaza Strip.\"\nIsraeli Prime Minister Benjamin Netanyahu said Thursday following the confirmation of Sinwar's death that Hamas suffered a \"heavy blow\" but the war in Gaza is not yet over. Netanyahu added that \"Hamas will no longer rule Gaza\" and \"this is the beginning of the day after Hamas, and this is an opportunity for you, the residents of Gaza, to finally break free from its tyranny.\"\nNetanyahu also said Sinwar \"ran away in fear from our soldiers\" prior to being killed.\n\"He told you he was a lion, but in reality, he was hiding in a dark den — and he was killed when he fled in a panic from our soldiers,\" Netanyahu said in a televised message.\nYahya Sinwar chairs a meeting with leaders of Palestinian factions at his office in Gaza City on April 13, 2022.(AP)\n\"The darkness has been retreating and the light has been rising,\" he said.\nReferred to by Israel as the Butcher of Khan Younis for his violent and cruel torture methods against his enemies, both Israeli and Palestinian, Sinwar, 61, is widely seen as being behind the massacre of Israeli civilians carried out by thousands of Hamas militants on Oct. 7.\nThe IDF and Shin Bet said earlier Thursday, \"During IDF operations in the Gaza Strip, three terrorists were eliminated\" and that it was \"checking the possibility that one of the terrorists was Yahya Sinwar.\"\nAn Israel Army Radio report said Thursday that Sinwar was killed during a battle with Israeli soldiers.\nThe soldiers had spotted suspected terrorists in Gaza and opened fire before the individuals fled into a building, according to the report. It added that a tank then fired a shell at the building, causing it to collapse.\nWhen the soldiers went inside to examine the aftermath, they found three bodies — one of which ultimately has been identified as Sinwar.\nIsraeli Defense Minister Yoav Gallant, left, Shin Bet leader Ronen Bar, center, and General Staff Lt. Gen. Herzi Halevi of the Israel Defense Forces, right, are seen speaking Thursday near the Gaza border. Israel confirmed Thursday it has killed Hamas leader Yahya Sinwar.(IDF)\nHAMAS NAMES YAHYA SINWAR, MASTERMIND OF OCT. 7 ATTACKS, AS ITS NEW LEADER\n\"The master murderer, Yahya Sinwar, who is responsible for the massacre and atrocities of October 7, was killed today by IDF soldiers,\" Foreign Minister Israel Katz also told Fox News in a statement.\nA U.S. defense official has told Fox News that Secretary of Defense Lloyd Austin was passed a note during a NATO Defense Ministerial meeting on Sinwar’s death. The Israelis, the official says, notified U.S. Department of Defense officials and have passed along photos.\nUpon hearing the news of Sinwar's death, President Biden said: \"This is a good day for Israel, for the United States, and for the world.\"\n\"Israel has had every right to eliminate the leadership and military structure of Hamas. Hamas is no longer capable of carrying out another Oct. 7,\" he said.\nBiden said he would be speaking with Netanyahu and other Israeli leaders to congratulate them.\nPentagon press secretary Maj. Gen. Pat Ryder stressed on Thursday that U.S. forces were not directly involved in the operation.\n\"Just to be crystal clear, this was an Israeli operation,\" he told reporters. \"There [were] no U.S. forces directly involved. The United States has helped contribute information and intelligence as it relates to hostage recovery, and the tracking and locating of Hamas leaders, who have been responsible for holding hostages, and so certainly that contributes, in general, to the picture.\n\"But again, this was an Israeli operation.\"\nThe Hostages and Missing Families Forum said Thursday in a statement that it \"commends the security forces for eliminating Sinwar, who masterminded the greatest massacre our country has ever faced, responsible for the murder of thousands and the abduction of hundreds.\"\n\"However, we express deep concern for the fate of the 101 men, women, elderly and children still held captive by Hamas in Gaza. We call on the Israeli government, world leaders, and mediating countries to leverage the military achievement into a diplomatic one by pursuing an immediate agreement for the release of all 101 hostages: the living for rehabilitation and the murdered for proper burial,\" it added.\nA demonstrator holds a sign about the killing of Hamas leader Yahya Sinwar during a protest calling for a cease-fire deal and the immediate release of hostages held by Hamas on Thursday in Tel Aviv, Israel.(AP/Ariel Schalit)\nISRAEL’S HUNT FOR HAMAS TERROR LEADER YAHYA SINWAR: ‘DEAD MAN WALKING’\nIn Washington, D.C., House Speaker Mike Johnson, R-La., said, \"Justice has once again been served by the brave men and women of the Israeli military.\"\n\"At this moment, with the bloodthirsty leaders of Hamas and Hezbollah now gone, the Biden-Harris Administration must now work in tandem with Israel to apply a maximum pressure campaign against the head of the snake: Iran,\" he added.\nSen. Lindsey Graham, R-S.C., said, \"The Israeli people — through their political leadership, the IDF and their intelligence services — have delivered a mighty blow to Hamas and Iran, and rendered some sense of justice with the elimination of Sinwar.\"\nIsraeli Defense Forces spokesman Lt. Col. Richard Hecht had told reporters in October 2023 that \"Sinwar is the leader of Hamas in Gaza and he’s a dead man walking.\"\nYahya Sinwar appears during a ceremony for Hamas fighters killed by Israeli airstrikes at Yarmouk football stadium in Gaza City in May 2021.(Laurent Van der Stockt/Getty Images)\n\"We will get to him, however long it takes… and this war could be long,\" he said.\nSinwar, who was believed to be somewhere in the Palestinian enclave but hidden deep underground in the warren of tunnels Hamas uses to transport weapons and fighters and where they may even be keeping the hostages, was born in the Khan Younis refugee camp when the area was part of Egypt.\nBIDEN ADMINISTRATION ISSUES WARNING TO NETANYAHU AS ISRAEL HOLDS EMERGENCY MEETING ON GAZA AID\nAccording to multiple sources, he was always a militant activist and joined Hamas not long after its founding in 1987. Two years later, he was arrested by Israel for his involvement in the abduction and killing of two Israelis, as well as the torturing and murder of four Palestinians he considered to be collaborators.\nSentenced to life in prison, Sinwar ended up serving 22 years in an Israeli jail and was eventually released as part of a prisoner exchange for the abducted Israeli soldier Gilad Shalit in 2011.\nA poster in the Iranian capital of Tehran featuring Yahya Sinwar is seen on Aug. 13.(Fatemeh Bahrami/Anadolu via Getty Images)\n\"Sinwar has been active since the early days of Hamas,\" Kobi Michael, a senior researcher at the Institute for National Security Studies in Tel Aviv, previously told Fox News Digital. \"In jail, he became a prominent leader of Hamas prisoners and was a very influential figure among all Palestinian prisoners.\"\nAfter being returned to Gaza as part of the Shalit deal, Sinwar became a popular leader in Hamas, an affiliate of the Muslim Brotherhood, and in 2017 was elected by secret ballot to replace the incumbent political leader, Ismail Haniyeh, who was killed in Iran in July.\nCLICK HERE TO GET THE FOX NEWS APP\nFollowing Haniyeh’s death, Sinwarwas named Hamas’ new leader.\nFox News' Trey Yingst, Yonat Friling and Liz Friden contributed to this report.\nGreg Norman is a reporter at Fox News Digital.",
        "scraped_at": "2025-12-23T09:41:36.024496",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/hamas-command-tunnel-unrwas-headquarters-gaza-israel-says",
        "title": "Hamas had command tunnel underneath UNRWA’s headquarters in Gaza, Israel says",
        "publish_date": "February 11, 2024 7:18am EST",
        "author": "ByAnders HagstromFox News",
        "content": "Senator Markwayne Mullin, R-Okla., joins 'Fox News Live' to discuss the specifics on the $95B Ukraine-Israel aid bill.\nThe Israeli military revealed a network of tunnels underneath Gaza City that they said extended below the United Nations' headquarters in the region on Sunday.\nThe IDFescorted foreign reporters through the tunnels, entering through a shaft that pierced the surface next to a school. Israel argues that the tunnels are even more evidence that the U.N.'s mission in Gaza was compromised by Hamas terrorists.\n\"Everything is conducted from here. All the energy for the tunnels, which you walked through them, are powered from here,\" an Israeli officer told reporters during the tour.\"This is one of the central commands of the intelligence. This place is one of the Hamas intelligence units, where they commanded most of the combat.\"\nUNRWA denied knowledgeof the tunnels and said it vacated the headquarters on the surface as early as Oct. 12.\nUN APPOINTS INDEPENDENT REVIEW OF UNRWA AMID ALLEGATIONS ITS WORKERS JOINED HAMAS-LED ATTACK ON ISRAEL\nThe Israeli military revealed a network of tunnels underneath Gaza City that extended below the United Nations' headquarters in the region on Sunday.\n\"UNRWA does not have the military and security expertise nor the capacity to undertake military inspections of what is or might be under its premises,\" the organization said in a statement.\nISRAEL'S EVACUATION ORDERS COVER MORE THAN TWO-THIRDS OF THE GAZA STRIP AS WAR WITH HAMAS CONTINUES\n\"In the past, whenever a suspicious cavity was found close to or under UNRWA premises, protest letters were promptly filed to parties to the conflict, including both the de facto authorities in Gaza and the Israeli authorities,\" the statement continued.\nThe IDF escorted foreign reporters through the tunnels, entering through a shaft that pierced the surface next to a school.\nMeanwhile, senior Hamas official Sami Abu Zuhri argued that Israel's claims of a connection between the UNRWA and the tunnels were \"lies.\"\nNews of the tunnels comes amidIsraeli allegationsthat hundreds of UNRWA employees expressed support for or were complicit in Hamas' Oct. 7 massacre in Israel.\nIDF VIDEO REVEALS TUNNEL USED TO HIDE HAMAS MEMBERS, HOSTAGES IN TERRORIST GROUP'S STRONGHOLD\nSeveral Western nations have paused funding for UNRWA, which overseas aid for Gazans, amid the allegations.\nNews of the tunnel comes amid Israeli allegations that hundreds of UNRWA employees expressed support for or were complicit in Hamas' Oct. 7 massacre in Israel.\nIsraeli Defense Minister Yoav Gallant called UNRWA \"Hamas with a facelift\" this weekend. He argued on Saturday that it was time for the world to \"dismantle UNRWA\" and create an alternative mechanism for providing aid to civilians in the war-stricken Gaza Strip.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I think the world needs to wake up and address this issue in a different way, while also addressing Gaza’s needs,\" Gallant told Fox News Digital. \"UNRWA is a group of terrorists who receive salaries from many countries – these countries gave money to people who raped, murdered and took people into captivity.\"\nFox News' Ruth Marks Eglash and Reuters contributed to this report\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on X: @Hagstrom_Anders.",
        "scraped_at": "2025-12-23T09:41:42.872117",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/ex-hamas-hostage-freed-after-505-days-gaza-tunnels-warns-evil-spreading-across-world",
        "title": "Ex-Hamas hostage freed after 505 days in Gaza tunnels warns 'evil is spreading' across the world",
        "publish_date": "December 19, 2025 2:48pm EST",
        "author": "ByEmma ColtonFox News",
        "content": "Hamas hostage survivor Omer Shem Tov spoke with Fox News Digital ahead of his speech at Turning Point USA's AmericaFest in Arizona.\nOmer Shem Tov spent 505 days in Hamas captivity after he was captured at the Nova Music Festival in Israel on Oct. 7, 2023, living in the terrorist group's elaborate tunnel system under the Gaza Strip before PresidentDonald Trumpassisted in his release.\nNow, the Israeli is a free man and delivered a speech at Turning Point USA's AmericaFest in Arizona, championing his message that the war in Israel is a war of good versus evil that is spreading across the world. The event has drawn widespread attention and support among conservatives following the tragic September assassination of its founder,Charlie Kirk.\n\"This fight is between good and evil. A fight against terrorists will turn hospitals into torture chambers, schools into military bases,\" he said. \"Who starve their own people. Who murder young people at a music festival. Who kill Jews because they are Jewish, and Christians because they are Christian. This evil is spreading.\"\nShem Tov spoke to Fox Digital in a Zoom interview ahead of his speech, previewing that it would underscore that the war in Israel is a growing war on Western civilization overall, pointing to horrific attacks such as the fatal National Guard shooting in November in Washington, D.C. He also recounted his 505 days in Hamas captivity in the reflective interview and eventual release in February under the Trump administration.\nTRUMP'S ELECTION WIN FILLED HAMAS WITH 'FEAR,' HOSTAGE HELD LIKE 'SLAVE' FOR 505 DAYS RECOUNTS\nOmer Shem Tov spoke to AmFest on Dec. 19 after 505 days in Hamas captivity.(Fox News Digital )\n\"As soon as Trump was elected, I saw the fear in their eyes,\" Shem Tov said of Hamas following the U.S. election in November 2024. \"They knew that everything on ground is gonna change, that something else is gonna happen, and they were scared. They were very scared.\"\nShem Tov said that for roughly the last five months of his captivity, he lived in Hamas’ tunnel system beneath the Gaza Strip, where he was worked mercilessly.\n\"I was digging for them, and I was cleaning for them, and I was moving around bombs from place to places, and (carrying) food. I can tell you, just so you know, crazy amounts of food. Amounts of food that I've never seen before,\" he recounted.\nOmer Shem Tov traveled to Arizona on Friday to deliver a speech at TPUSA's AmFest.(Fox News Digital )\nShem Tov learned about the American presidential election from his Hamas captors, who watched Al Jazeera on a TV kept in the tunnels. He said he overheard the terrorists discussing the election and \"how they want Kamala to win.\"\nAMERICAN-ISRAELI HELD HOSTAGE IN GAZA FOR OVER 580 DAYS SENDS MESSAGE TO HAMAS: 'I’LL GIVE YOU HELL'\nOnce the election was decided, Shem Tov said, the terrorists changed the way they treated him, even offering him more food. He said he mostly survived on small biscuits throughout his captivity, despite Hamas controlling large amounts of food.\nHamas terrorists marching in Gaza during a parade.(Getty Images)\n\"Thank you, President Donald Trump, for our freedom,\" Shem Tov said as the crowds began breaking out into chants of \"USA.\" \"He fought for us. He brought us home.\"\nShem Tov told the crowds Friday in his speech that he had not prayed or spoken to God much before his capture.\n\"Alone in the darkness, I began to pray,\" he said, receiving praise from the crowd. \"Every day, I spoke to Him. I whispered, ‘God, how are You? How was your day? Are you okay?\" he said.  \"And in that darkness, I felt His presence. I thanked Him for everything. I thanked Him for everything. For the food, even when there was almost none. For the water, even when it was salty. For my life, even though it was in danger every single day.\"\nOmer Shem Tov spoke with Fox News Digital, recounting his 505 days in Hamas captivity before his February release.(Amir Levy/Getty Images)\nThe 23-year-old told Fox Digital that the assassination of Kirk on Sept. 10 left him \"completely shocked\" even after experiencing his own horrors for months in Gaza.\nIDF ANNOUNCES TRANSFER OF DECEASED ISRAELI HOSTAGE REMAINS THROUGH RED CROSS\n\"I couldn't believe it at first, but ever since I got out of captivity, I noticed Charlie's work and what he's done for us. And it's just, it's amazing to see someone who is not Jewish, yeah he is a Christian and is American, is not related toIsraelin in any way possible, and he's just is so supportive of us,\" he said.\nA tribute to Charlie Kirk is shown on the Jumbotron before a NASCAR Cup Series auto race, Saturday, Sept. 13, 2025, in Bristol, Tennessee.(Wade Payne/AP)\n\"But then it reminds me what we're fighting for. It reminds me that, there is extremists … we just have to stand in front of them and and just fight for everything we've got,\" he continued.\nShem Tov said that he hopes his TPUSA speech and ongoing advocacy for Israel following his captivity leaves readers and listeners with the message that he and others are fighting on behalf of Western civilization in the face of terrorism.\nHe reflected on that message in his speech, pointing to the terror attack on a Hanukkah celebration in Australia that killed 15 and injured dozens of others, as well as the National Guard shooting in D.C. ahead of Thanksgiving that killed one and injured another.\nEX-HAMAS HOSTAGE EMILY DAMARI RECOUNTS 471 DAYS OF SURVIVAL IN GAZA: ‘EVERYONE NEEDS TO KNOW WHAT HAPPENED’\n\"We have seen these same radical terrorists commit violence in Israel, in Europe, in Australia, and even here in the United States, including the recent attack in Washington, D.C., where two National Guardsmen were shot. This is the evil we are fighting. This is not a distant conflict,\" he said.\n\"And that is whyTurning Point USAmatters. Because you see the truth. And you stand for freedom,\" he told the crowds.\nOmer Shem Tov was held in Hamas captivity for 505 days before his release in February 2025.(Fox News Digital )\nShem Tov underscored his support of Trump in his interview with Fox News Digital, explaining that he did not know much about Trump and stayed out of politics ahead of his capture beyond that he was a supporter of Israel.\n\"I always knew that Trump was a big supporter of Israel. And for us as Israelis, you know, we … love Trump,\" he said. \"He supports us, he's he's a great man, I think. I I also met him nine days after I was released, like I've said, and and I can truly say that he's he's an amazing person. He really, really cared about us.\"\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\n\"I personally told him that me and my family, and I would say all of Israel, believe that he was sent by God to release those hostages and to help Israel,\" Shem Tov recounted of what he told Trump during his meeting in February. \"And he made that promise. He made that promise, he said that he will bring back all the hostages.\"\nAll hostages have been released except for the remains of slain police officer Ran Gvili. There were 168 hostages who survived in Gaza, and 83 who died. Israel released some 2,000 prisoners in October as part of a hostage exchange deal with Hamas to secure peace in the region.",
        "scraped_at": "2025-12-23T09:41:47.497218",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/anti-hamas-protests-breakout-gaza-strip-over-demands-end-war",
        "title": "Anti-Hamas protests break out in Gaza Strip over demands to end war",
        "publish_date": "March 25, 2025 4:20pm EDT",
        "author": "ByCaitlin McFallFox News",
        "content": "Mass anti-Hamas protests erupt in Gaza as hostages remain and war continues. (Credit: Center for Peace Communications)\nAnti-Hamas protests broke out in the northern Gaza Strip on Tuesday as hundreds of Palestinian men took to the streets to call for an end to thewar with Israel.\nVideos of the protest began circulating on social media on Tuesday and come as Israeli air strikes and offensive operations against Hamas have continued since the first phase of an internationally-brokered ceasefire ended earlier this month, before a second phase could be secured.\nOne such video shared with Fox News Digital by the Center for Peace Communications showed protesters chanting, \"Hamas get out!\"\nPalestinians attend a rally calling for an end to the war, in Beit Lahia, in the northern Gaza Strip, on March 25, 2025.(AFP via Getty Images)\nISRAEL ORDERS IDF TO SEIZE MORE GAZA TERRITORY IF HAMAS DOESN'T RELEASE HOSTAGES\nThe man filming the protest provided his own commentary, which reportedly said, \"Gaza's people don't want wars. They demand the end of Hamas' rule. They demand peace.\"\n\"Gazans turned out in anti-Hamas street demonstrations, braving gunfire and prison, in 2019 and again on July 30, 2023. This is the most substantial mass protest since then,\" Joseph Braude, president of the Center for Peace Communications, told Fox News Digital. \"It highlights Gazan aspirations toend the warby ending Hamas’ reign of terror, alongside the release of all hostages.\n\"Gazans are expressing anger at Al-Jazeera and global media generally for covering only Hamas, ignoring the voices of Gazan civilians,\" he added. \"The more attention these brave souls get, the more they can help bring change for the better to Gaza and the broader region.\"\nPalestinians flee to areas they consider safe following intensive attacks by the Israeli army on the northern Gaza towns of Beit Lahia and Jabalia, on March 25, 2025.(Abd Khaled/Anadolu via Getty Images)\nMOTHER OF INJURED HAMAS HOSTAGE DIRECTS PLEA TO 'EVERY MOTHER IN THIS WORLD' TO HELP SECURE SON'S RELEASE\nPalestinian civilians have taken the brunt of Hamas’ brutal and deadly Oct. 7, 2023, attack, which resulted in the death of some 1,200 Israelis and the abduction of 251 others. Fifty-eight of those hostages remain in Hamas captivity, but only 25 are believed to still be alive 535 days later, including American hostageEdan Alexander.\nThe Hamas-run Gaza’s Health Ministry reported on Sunday that some 50,000 Palestinians have been killed, including600 over the last four daysafter Israel officially ended the tenuous ceasefire by launching air strikes after negotiations on hostage releases stalled.\nThe ministry also reported that over 15,600 Palestinian children have been killed since Oct. 7, 2023.\nA woman holds an image of hostage Edan Alexander during the Global Day of Unity and Prayer with Israel's Hostages and Missing Families Forum, which represents the relatives of those taken captive during the Oct. 7 attack.(Yuri Cortez/AFP via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\nAccording to Israeli news agency TPS-IL, Gaza activist Hamza al-Masry also took to Telegram to share footage of the protest and said, \"It is time for our people in all the governorates of the Gaza Strip to come out like them and to be united and united in one message.\n\"The people of Gaza want to stop the torrent of bloodshed of our people, and enough is enough,\" he added.\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news.",
        "scraped_at": "2025-12-23T09:41:50.956198",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/trump-warns-hamas-war-resume-terror-group-continues-kill-people-gaza",
        "title": "Trump warns Hamas if terror group 'continues to kill people in Gaza'",
        "publish_date": "October 16, 2025 2:04pm EDT",
        "author": "ByAlexandra KochFox News",
        "content": "Fox News chief foreign correspondent Trey Yingst has the latest on the aftermath of the Israel-Hamas peace deal on 'The Story.'\nPresidentDonald Trumpsent a strong message to Hamas on Thursday, threatening to \"go in and kill\" Hamas militants if the group continues attacks in Gaza.\n\"If Hamas continues to kill people in Gaza, which was not the Deal, we will have no choice but to go in and kill them,\" Trump wrote in a fieryTruth Socialpost. \"Thank you for your attention to this matter!\"\nThe move comes after Hamas was seen on video publicly executing opponents inGaza City’s main square, despite Trump's peace plan.\nHamas has signed onto President Donald Trump's plan as IDF forces start withdrawing from the enclave.(Majdi Fathi/NurPhoto via Getty Images)\nAFTER TRUMP DECLARES ‘WAR IS OVER,’ HAMAS EXECUTES RIVALS IN GAZA TO REASSERT CONTROL\nGazans previously told Fox News Digital Hamas fighters were reappearing in the streets and reasserting control, having issued an ultimatum givingIsraeli collaboratorsuntil Sunday to surrender and seek amnesty.\nHamas has also failed to uphold its commitment to return all deceased hostages to Israel, with families describing the days left waiting as \"torturous.\"\nTerrorists in the central Gaza town of Deir al-Balah celebrate the ceasefire on Jan. 19, 2025.(TPS-IL)\nTRUMP WARNS HAMAS WILL BE 'HUNTED DOWN, AND KILLED' UNLESS ISRAELI HOSTAGES RELEASED BY SUNDAY\nOn Thurday's \"Fox & Friends,\" Orna Neutra, mother of Israel Defense Forces Capt. Omer Neutra, said it is \"devastating\" to wait for her son's body each day.\n\"We came here on Sunday, prepared to receive him on Monday and, as the day went by and only four hostages were released, and our son wasn't among them, it was devastating,\" Orna said.\nOmer, a fallen platoon commander, is one of twoAmerican citizenswhose remains have yet to be returned by Hamas as part of the initial phase of the peace agreement.\nIsraeli soldiers watch the northern Gaza Strip from southern Israel in July.(AP Photo/Ohad Zwigenberg)\nTRUMP DESERVES HUGE CREDIT FOR ACHIEVING PEACE IN GAZA, BUT MARRED THE MOMENT WITH HIS CAMPAIGN OF RETRIBUTION\nOrna said theterror groupcontinues to torment families by withholding any word on future releases.\n\"We spend sleepless nights waiting, since those who return to Israel usually arrive after midnight and aren’t identified until early morning,\" she said. \"Each time, we wait and hope — only to learn he’s still not among them, and now Hamas says no one else can be freed.\"\nCLICK HERE TO GET THE FOX NEWS APP\nAll remaining living hostages were returned to the Jewish state over the weekend.\nFox News Digital's Efrat Lachter and Taylor Penley contributed to this report.\nAlexandra Koch is a Fox News Digital journalist who covers breaking news, with a focus on high-impact events that shape national conversation.\nShe has covered major national crises, including the L.A. wildfires, Potomac and Hudson River aviation disasters, Boulder terror attack, and Texas Hill Country floods.",
        "scraped_at": "2025-12-23T09:41:54.310158",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/after-trump-declares-war-over-hamas-executes-rivals-gaza-reassert-control",
        "title": "After Trump declares ‘war is over,’ Hamas executes rivals in Gaza to reassert control",
        "publish_date": "October 14, 2025 6:00am EDT",
        "author": "ByEfrat LachterFox News",
        "content": "President Trump thanked Israeli lawmakers for their welcome in the Knesset as the nation celebrated the release of all 20 living hostages from Hamas captivity.\nAfter PresidentDonald Trumpdeclared in Israel’s Knesset that \"the war is over\" and celebrated the return of the remaining living hostages, Hamas terrorists across the border in Gaza were reportedly killing its opponents in Gaza City’s main square — in full view of the public.\nVideos circulating on social media appear to show the executions, which an Israeli military official told Fox News Digital are, \"Hamas’s deliberate attempt to show the killing publicly and reestablish its rule by terrorizing civilians.\"\nIn conversations with Fox News Digital, Gazans described Hamas fighters reappearing in the streets and reasserting control — yet some said this could also be their first real chance for change and to get rid of the terror regime.\nMukhaimar Abu Saada, a political analyst from Gaza, told Fox News Digital disarming Hamas will not be easy, as clashes between the group and local militias have already erupted. \"This won’t happen quickly,\" he said. \"We’re talking about an ideological organization. Even last night, people were killed in clashes between Hamas and local militias. It’s not a rosy road.\"\nTRUMP PEACE PLAN FOR GAZA COULD BE JUST A 'PAUSE' BEFORE HAMAS STRIKES AGAIN, EXPERTS WARN\nPresident Donald Trump addresses the Knesset, Israel's parliament, on Oct. 13, 2025 in Jerusalem. President Trump is visiting the country hours after Hamas released the remaining Israeli hostages captured on Oct. 7, 2023, part of a U.S.-brokered ceasefire deal to end the war in Gaza.(Photo by Evelyn Hockstein - Pool/Getty Images)\nAbu Saada said Hamas has issued an ultimatum giving collaborators withIsraeluntil October 19 to surrender and seek amnesty from Hamas — as long as they were not involved in killings.\n\"They’re still strong,\" he admitted. \"Part of the reason they didn’t fight harder in the last days is that they saved some men and weapons for the day after. I still see Hamas police in the streets of Gaza. Trump said they lost thousands, but they’re still there, able to control the streets once Israel redeploys.\"\nA man in Gaza who asked to remain anonymous told Fox News Digital that, despite official declarations, \"You cannot say the war is finished,\" he said. \"We have to wait a few weeks to see what happens. There are gangs in Gaza now; Hamas is trying to fight them. If they don’t unify, another war could start.\"\nHe described Hamas as weakened and divided. \"Hamas is not strong like before. Those who remain are mostly police — not the real Hamas people who believe in their extremist jihadist ideology,\" he said. \"We have to watch what happens next and see if they rebuild.\"\nHe said the group’s survival depends on whether it accepts the deal. He called the situation \"very strange,\" noting that Hamas agreed to releaseall hostageswhile Israeli is still holding parts of Gaza. \"It’s not a real deal yet. We need someone from Hamas to explain what they agreed to, because we need to think about our future.\"\nA group of Hamas terrorists in Deir-el Balah in central Gaza as 20 living Israeli hostages were freed on Oct. 13, 2025.(Photos by TPS-IL)\nFROM GRIEF TO GRATITUDE: TRUMP PRAISED AS ISRAELIS CELEBRATE HAMAS HOSTAGE DEAL IN TEL AVIV\nAnother man in Gaza City voiced the same uncertainty. \"No one knows what is happening — who will rule, what will happen with Hamas, and if the war is truly over,\" he said. \"We hope for a better future. I just want me and my family to live without targeting, without bloodshed.\"\nOrdinary Gazans, he added, are exhausted but yearning for calm. \"People just want the blood to stop. They want to stop losing their relatives and friends … It’s in their hands now — if they will allow Hamas to continue or finally rise up. But nothing is clear.\"\nAbu Saada said there is \"no question Hamas will have to disarm one way or another,\" describing it as an inevitable part of the plan announced by President Trump and endorsed by Israel’s leadership.\n\"The real question is who will hold those weapons — the Palestinian Authority or the so-called ‘security stabilization force’ that’s supposed to deploy next. It’s definitely going to happen, but we have to wait for the second phase of the negotiations.\"\nA Gazan family walks near the rubble of buildings during the Eid al-Adha holiday, in Gaza City, June 6, 2025.(Mahmoud Issa/Reuters)\nAbu Saada said evenQatari mediatorshave confirmed that disarmament \"has not yet been discussed but will be discussed in the coming days.\" For now, he added, Gazans are focused on survival after \"two years of misery, destruction, and bloodshed.\"\nUltimately, he said, Hamas will have to comply. \"No Arab country will give a single dollar if Hamas doesn’t disarm. Rebuilding Gaza depends on Hamas no longer being in control. The war is over, but the real test is only beginning.\"\nWhile voices inside Gaza reflect uncertainty, experts in Washington say Hamas’s political and military isolation has never been greater.\nISRAEL-HAMAS CEASEFIRE TAKES EFFECT, IDF BEGINS PULLING BACK IN GAZA\nJacob Olidort, director of the Center for American Security at the America First Policy Institute, told Fox News Digital that Hamas is \"in the most militarily and diplomatically isolated place it has ever been.\"\n\"Even before and after the release of hostages, Hamas has been defiant in tone,\" Olidort said. \"But all of that will be overshadowed by the vast expansion of peace agreements between Israel and its neighbors. All of Israel’s regional partners are eager to normalize and build on where they left off prior to Oct 7.\"\nA group of Hamas gunmen in Deir-el Balah in central Gaza as 20 living Israeli hostages were freed on Oct. 13, 2025.(Photos by TPS-IL)\nOlidort said the Sharm el-Sheikh summit will mark the beginning of phase two of Trump’s plan — \"Whatever is happening now on the ground doesn’t reflect Gaza’s future,\" he said. \"None of the steps in the peace plan have been implemented yet. What comes next will be defined by that summit and by the regional consensus that Hamas cannot continue to control Gaza.\"\nFor Israel, he added, \"the focus will be restarting, in a more public way, its regional and global partnerships — defense, commercial, and diplomatic. That’s where Israel’s future lies.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWhile the guns have fallen silent, the next stage — Hamas’ disarmament and the arrival of a stabilization force — will determine whether Gaza finally begins rebuilding or slips back into chaos. As Abu Saada put it, \"The war is over, but the question is whether peace will really begin.\"\nEfrat Lachter is an investigative reporter and war correspondent. Her work has taken her to 40 countries, including Ukraine, Russia, Iraq, Syria, Sudan and Afghanistan. She is a recipient of the 2024 Knight-Wallace Fellowship for Journalism. Lachter can be followed on X @efratlachter.",
        "scraped_at": "2025-12-23T09:41:57.720519",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israeli-military-sees-hamas-war-lasting-all-2024-report",
        "title": "Israeli military sees Hamas war lasting through all of 2024: report",
        "publish_date": "January 30, 2024 7:11am EST",
        "author": "ByAnders HagstromFox News",
        "content": "Iran-backed militia groups have carried out at least 160 attacks on US targets in Iraq and Syria since October 17.\nThe Israeli military expects the war against Hamas to continue through the end of 2024 and possibly even into 2025, an Israeli intelligence official told reporters on Tuesday.\nIsraeli Defense Forces(IDF) are currently engaged in the heaviest fighting around the city of Khan Younis, the largest city in southern Gaza. The Israeli intelligence officer briefing reporters on Tuesday said the IDF has killed \"at least a quarter\" of Hamas' estimated fighting force of 35,000, and at least another quarter are wounded, according to Bloomberg.\nHamas' vast network of tunnels have allowed many of its troops and leaders to operate despite Israeli control of much of the territory.\nThe Israeli official said Israel remains far away from achieving its stated goals of capturing Hamas' leaders and ammunition reserves and rendering Hamas military bases and tunnels inoperative, Bloomberg reported.\nAUSTRIA SUSPENDS PAYMENTS TO UNRWA AMID ISRAELI ALLEGATIONS UN WORKERS HELPED, CELEBRATED HAMAS\nThe Israeli military expects the war against Hamas to continue through the end of 2024 and possibly even into 2025, according to Israeli officials.(Reuters/Ronen Zvulun)\nThe city's network of tunnels is even more expansive than that of Gaza City to the north. Israeli operations have also gathered extensive intelligence on how Hamas operates, particularly in how it coordinates rocket attacks against Israel.\nFor weeks, Hamas has remained capable of launching barrages into Israel even from areas largely under Israeli control. The intelligence officer stated that Hamas terrorists, once given the order, will bring a timed detonator to a pre-prepared launch site, prime the rockets, and then leave. Some time later, the battery of rockets will fire, according to Bloomberg.\nIsraeli Prime Minister Benjamin Netanyahu stated at the beginning of January that the war will last \"many more months,\" and vowed that Israel would not relent until Hamas is destroyed.\nHamas leader Yahya Sinwar remains at large, though he is believed to be somewhere within Khan Younis.\nThe IDF also detailed anoperation on Mondayin which it blew up a Hamas tunnel underneath a cemetery.\nISRAELI FOREIGN MINISTRY CALLS FOR UNRWA COMMISSIONER TO RESIGN AMID ALLEGATIONS ITS WORKERS ASSISTED HAMAS\nIsraeli soldiers raided the tunnel system in the Bani Suheila neighborhood in the southern Gaza city of Khan Younis, finding explosives, sliding doors and blast-proof doors, the IDF said. Terrorists were still inside, according to theIsraeli military,and were killed.\nHamas leader Yahya Sinwar remains at large, though he is believed to be somewhere within Khan Younis.(MAHMUD HAMS/AFP via Getty Images)\nThe tunnels housed the office of a Hamas commander, an operations room, and living quarters for senior members of Hamas, according to the IDF. It said the tunnel was used to plan attacks against the military, as well as the deadly Oct. 7 attack on Israel.\nISRAEL TO BAN REBUILDING OF ISRAELI SETTLEMENTS IN GAZA FOLLOWING CONCERNS FROM BIDEN ADMIN\nAn Israeli soldier is seen in the Gaza Strip city of Khan Younis on Saturday, Jan. 27.(AP/Sam McNeil)\nCLICK TO GET THE FOX NEWS APP\nAs Israel moves forward with a ground and aircampaign in Gaza,Hamas officials in the besieged enclave say over 26,000 Palestinians have been killed.\nFox News' Stephen Sorace contributed to this report\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on X: @Hagstrom_Anders.",
        "scraped_at": "2025-12-23T09:42:01.102332",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israel-says-hamas-violated-ceasefire-multiple-attacks-leading-idf-response",
        "title": "Israel says Hamas violated ceasefire with 'multiple attacks' leading to IDF response",
        "publish_date": "October 19, 2025 7:06am EDT",
        "author": "ByAnders Hagstrom,Trey YingstFox News",
        "content": "Fox News senior correspondent Benjamin Hall has the latest on what’s happening in Gaza after Hamas agreed to a peace deal with Israel on ‘The Story.’\nThe Israeli military conducted strikes against Hamas in Gaza after accusing the terrorist organization of repeatedly violating its ceasefire agreement on Sunday.\nAnIsraeli militaryofficial confirmed the strikes to Fox News on Sunday, pointing to attacks by Hamas since Friday. The IDF later confirmed that it was taking actions in Gaza.\n\"Earlier today, terrorists fired an anti-tank missile and gunfire toward IDF troops operating to dismantle terrorist infrastructure in the Rafah area, in southern Gaza, in accordance with the ceasefire agreement,\" the IDF said in a statement.\n\"In response, the IDF has begun striking in the area to eliminate the threat and dismantle tunnel shafts and military structures used for terrorist activity,\" it continued.\nHAMAS ACCEPTS TRUMP PEACE PLAN ENDING 2 YEARS OF WAR IN GAZA, RETURNING HOSTAGES\nIsrael has responded by striking areas in the north and south of the Gaza Strip.\nIsraeli Prime Minister Benjamin Netanyahu's office says he has instructed the minister of defense and other security heads to \"act forcefully\" in reaction to the attacks.\nHamas claims it has \"no knowledge\" of any attacks against Israeli forces, releasing a statement on Sunday saying it was still abiding by the terms of the agreement.\n\"We affirm our full commitment to implementing everything that has been agreed upon, foremost among which is the ceasefire in all areas of the Gaza Strip. We have no knowledge of any events or clashes taking place in the Rafah area,\" the group wrote.\n\"We have no connection to any events occurring in those areas, nor can we communicate with any of our fighters there if any of them remain alive,\" it added.\nThe reported attacks on Israeli troops come after Hamas spent days fightingPalestinian rivalgroups after the ceasefire went into effect.\nISRAELI TROOPS 'OPEN FIRE' ON SUSPECTS WHO APPROACHED SOLDIERS IN NORTHERN GAZA\nMilitary vehicles are gathered near the Israel-Gaza border, amid a ceasefire between Israel and Hamas, in southern Israel on Oct. 12, 2025.(Ammar Awad/Reuters)\nIn this still from a verified social media video confirmed to Reuters by a Hamas source, seven men are forced to their knees and shot from behind by Hamas gunmen during public executions in Gaza on Oct. 14, 2025.(Reuters)\nAccording to Reuters, Hamas executed at least 33 people in recent days in what officials described as a campaign to \"show strength\" after the ceasefire. Israeli sources say most of those killed belonged to families accused of collaborating with Israel or supporting rival militias.\nThe U.S. Department of State warned on Saturday that Hamas may break thepeace agreementwith a \"planned attack\" on Palestinian civilians.\n\"This planned attack against Palestinian civilians would constitute a direct and grave violation of the ceasefire agreement and undermine the significant progress achieved through mediation efforts,\" the department said in a statement on social media. \"The guarantors demand Hamas uphold its obligations under the ceasefire terms.\"\nMembers of the Hamas militant group searching for bodies of the hostages in Khan Younis, southern Gaza Strip, Saturday, Oct. 18, 2025.(AP Photo/Jehad Alshrafi)\n\"The United States and the other guarantors remain resolute in our commitment to ensuring the safety of civilians, maintaining calm on the ground and advancing peace and prosperity for the people of Gaza and the region as a whole,\" the statement continued.\nPresidentDonald Trumpwarned Hamas on Friday that continued attacks on Palestinians would force the U.S. and Israel to intervene.\nCLICK HERE TO GET THE FOX NEWS APP\n\"If Hamas continues to kill people in Gaza, which was not the deal, we will have no choice but to go in and kill them,\" he wrote on X.\nFox News' Brie Stimson contributed to this report.\nAnders Hagstrom is a reporter with Fox News Digital covering national politics and major breaking news events. Send tips to Anders.Hagstrom@Fox.com, or on X: @Hagstrom_Anders.",
        "scraped_at": "2025-12-23T09:42:06.404124",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "The Guardian",
        "url": "https://www.theguardian.com/world/2025/oct/07/diplomacy-lowest-point-how-the-israel-gaza-conflict-was-mishandled",
        "title": "Diplomacy’s lowest point: how the Israel-Gaza conflict was mishandled",
        "publish_date": "N/A",
        "author": "Patrick Wintour",
        "content": "George Mitchell, the great US advocate for the Northern Ireland peace agreement, described diplomacy as 700 days of failure and one of success. InGaza, tragically, there have been 730 days of failure and none of success. Indeed, the destruction, the death toll and the spillover of the conflict into other countries is a monument to shame diplomacy and what remains of international law. Arguably, it is the profession’s lowest point since 1939.\nSome will claim failure is inevitable since this conflict is now so embedded and impervious to compromise that it can only be settled at the barrel of the gun, in essence through the repression or erasure of one side.\nYet, however entrenched the mutual hatreds, a consensus is building across the west that this conflict was desperately mishandled, including by European leaders who initially ceded responsibility to a US Democratic administration that romanticised modernIsrael, misread how its government might react to the horror of 7 October – and how that would polarise the west.\nIndeed, the mea culpas and self-justifications have been streaming out of Joe Biden’s former team. In her book on her doomed bid to become president, Kamala Harris writes: “I had pleaded with Joe, when he spoke publicly on this issue, to extend the same empathy he showed to the suffering of Ukrainians to the suffering of innocent Gazan civilians. But he couldn’t do it: while he could passionately state ‘I am a Zionist’, his remarks about innocent Palestinians came off as inadequate and forced.”\nShe adds that Benjamin Netanyahu never repaid the loyalty that Biden had shown because he wanted Donald Trump in the seat opposite him.\nAt its most generous, the Democrats misread the power dynamics. “We did not act like a superpower,” Andrew Miller, a former deputy assistant secretary of state for Israeli-Palestinian affairs, said recently. “Instead of beginning from the proposition that these were problems we could solve, we persuaded ourselves that there was little we could do to move our regional ally Israel.”\nTrump did not have that inferiority complex. He used his unpredictability as his greatest diplomatic weapon but, like Biden, his special envoy Steve Witkoff became bogged down in trying to find a formula that guaranteed the release of all the hostages without Israelresuming the fighting, as it did in March this year.\nAs successive variations of the Witkoff proposals emerged, France and Saudi Arabia took matters into their own hands, deciding to use a UN conference on a two-state solution as a vehicle for gripping the diplomacy in a different way. The US monopoly on the peace process was broken and the neglected issue of Palestinian self-rule was finally addressed.\nBefore the conference, initially due to be held in June but delayed by a month by Israel’s attack on Iran, Emmanuel Macron extracted a letter from the Palestinian Authority (PA) president, Mahmoud Abbas, that endorsed a plan for the day after a ceasefire under which Hamas would be disarmed and debarred from holding office and a transitional body of experts would be formed to governPalestine“under the umbrella” of a reformed Palestinian Authority. The notion of reform of the PA, often an empty diplomatic vessel, was this time given specifics, including a commitment by Abbas to much-delayed elections and internal change. An international force would be introduced.\nMany versions of the “day after” plan for Gaza had been circulating since 2024 – one by American and Israeli experts published by the Wilson Center, another drafted by the Rand Corporation, a set of principles issued by the United Arab Emirates and a plan from Egypt. The Saudi-French plan incorporated many of these ideas into what became the New York declaration, passed by the UN conference in July andendorsed by the UN general assemblyin September, with Israel and the US voting against.\nOne European diplomat said: “Although there was a lot of media heat about the issue ofrecognising Palestinian statehood, that was not where the serious diplomatic breakthrough was. We managed to convince the Americans to link the commitments to the ceasefire to a plan for what happens afterwards – and to realise that focusing on a ceasefire on its own would not work.”\nIn reference to the US’s over-reliance on Israeli firepower to impose its will, the diplomat said: “We also convinced them they could not go on rolling the dice and thinking it will come up double six.”\nCritical to the process was a meeting in the White House in late August where Jared Kushner, Tony Blair and Witkoff convinced Trump thatmass expulsions of Palestiniansfrom Gaza was neither necessary nor wise.\nOne of those present said: “Trump had no illusions about Netanyahu’s reliability and had invested in the Middle East states. He was persuaded that for states such as Jordan and Egypt the spectre of waves of Palestinian refugees spilling over their borders was a red line. Trump agreed to take mass enforced displacement off the agenda.”\nThe other big message out of the meeting was that for the first time it became feasible to try to merge White House and French thinking. Speaking at Harvard University last month, the French foreign minister, Jean-Noël Barrot, said: “President Trump asked some of his close advisers to go to the Arab countries, to go to France, to go to the UK, to gather all the ideas that all of us have been putting together for months and years for what a day after plan would look like.”\nThe aim of the two-state solution conference and the general assembly vote, Barrot said, was to remove the obstacles to the two-state solution, including by Arab states condemning the 7 October attacks and endorsing the declaration’s exclusion ofHamasfrom Gaza.\n“Until that vote, there was no international condemnation of Hamas, no international call for its disarmament, no international goal for its exclusion from any future role in the governance of Gaza and Palestine,” Barrot said. “This is done. We have changed the mindset. Everyone now sees Hamas for what they are: a terrorist organisation.”\nThe second obstacle, he explained, was to overcome Arab governments’ reluctance to state publicly that they had a goal of establishing diplomatic relations with Israel.\nBarrot said the new UN text went further than ever before. “We got them … to say that they aspire not only to have a normal relationship with Israel, but to enter into a common regional architecture in the model of Asean in Asia or OSCE in Europe,” he said. “We got them to say things they never said.”\nSo, contrary to appearance, the weeks and days leading up to the general assembly was about the Arab states reaching out to Israel. Far from being rewarded, Hamas, an opponent of a two-state solution, was being ostracised from political power in Palestine, a fate its battered leadership has reluctantly accepted.\nBut for Israel the New York declaration, with its clear references to a Palestinian state and a role for a reformed Palestinian Authority, remained unacceptable. So when Trump revealed his plan to the Arab and Muslim states on the sidelines of the general assembly, the declaration had become the benchmark against which it was to be judged by the Arab and Muslim states.\nThe Trump plan, largely prepared by Blair and Kushner, was necessarilythin, ambiguousand stripped of a timetable. The Arab states had misgivings, but advocates such as Blair argued that if the plan was more specific it would lose the required broad support and critical momentum. The lack of immediate leaks delighted western diplomats since it suggested the Arab states thought they could work with the plan.\nBut while the Arab states left New York, Netanyahu stayed in New York, holding two lengthy weekend meetings with Witkoff. After Israel’sattack on Hamas negotiatorsin Qatar on 9 September – a personal betrayal of Witkoff and Qatar – Netanyahu was persona non grata in the White House. Yet the Israeli prime minister extracted further concessions.\nThe amnesty to Hamas members was only available to those who handed over weapons in front of international observers and committed to peaceful coexistence. More detail was added about the destruction of Hamas infrastructure. Moreover, the withdrawal of Israel Defense Forces was blurred, and by the end the IDF would have to withdraw only to a security buffer zone encompassing more than 17% of Gaza until the strip “is properly secure from any resurgent terror threat”.\nThe process for this withdrawal “will be carried out according to criteria, and with a timeframe, to be agreed upon between the IDF, the international stabilisation force, the guarantors and the United States”.\nAfter the plan’s publication, Netanyahu in a video message assured his domestic audience that Israel’s red lines were protected: Gaza separated from the West Bank, no return by the PA to Gaza, no path toward a “two-state solution” and no removal of Israel security forces from the majority of the Gaza Strip.\nIn trying to assuage the extremists in his coalition, Netanyahu was also doing all he could to persuade Hamas to reject the plan, so he could pursue the military offensive into Gaza City.\nEven though the plan did not have a timeline for when the board of technocrats would hand power to an elected Palestinian government, Qatar, Turkey and Egypt urged Hamas to accept many of the unsatisfactory ambiguities that could be addressed later. The war would end.\nDiplomats said this message was received best not by the Hamas political wing in Doha but by the Hamas fighters inside Gaza, a new younger cadre steeped in the sacrifices made. With wording crafted by Qatar, the Hamas answer was in effect a “yes, but” that was open to many interpretations. Trump, to Netanyahu’s utter dismay, chose to take the Hamas response as an unqualified “yes”. The key was that Hamas was willing to relinquish its greatest bargaining chip: the remaining hostages.\nTahani Mustafa, of the European Council on Foreign Relations, argues that since the 7 October attack Palestinian politics has shifted to a more transactional outlook. “Palestinians are looking to someone that can make life bearable, keep them on their land and improve their living conditions. The very bare minimum is what people are asking for. Most Palestinians on the ground have resigned themselves to their fate.”\nOn this basis, the technocratic body to be chaired by Trump, but likely to be dominated by Blair with some figures from the Palestinian diaspora, could derive its legitimacy through its effectiveness.\nBlair will be working against the destabilising backdrop of imminent elections in both Israel and Palestine. One of the body’s first tasks will be to build a relationship with Palestinian politics. Blair has close relations with the elites of the Middle East but none with the street, and he may leave to others such as Egypt the task of mediating an intra-Palestinian dialogue on Palestinian unity, a dialogue led by China, that the ageing and authoritarian PA president has sought to sabotage.\nIf elections do occur as promised, it could produce a change. The last time elections were attempted, in 2021 in the West Bank, the democratic appetite was there with 36 lists formed outside the established factions. The key question is what will happen if the elections produce a result that Blair’s technocratic board do not like.\nAs the Gaza war has continued with ever worsening devastation, Israel’s reputation has been shattered. In the Arab world, Israel is now seen as a greater threat to security than Iran. In the global south it is likened to apartheid South Africa, and across Europe the demonstrations and accusations of genocide continue. Growing majorities of American Jews and Democrats disapprove of Israel’s actions.\nRobert Malley, a US negotiator at the time of the Oslo accords, has just co-authored a book on the impossibility of rational diplomatic answers to the conflict. He said external would-be peacemakers had been “so focused on whether we can get them to agree on what it would mean if there was a Palestinian state, just words on a piece of paper, without coming to terms with the nature of this conflict, the nature of this beast – which was a historical clash of narratives.\n“From the Israeli perspective, they won in 1948. They won in 1967. And the Palestinians believe that they were victims of a historic injustice in 1948, 700,000 Palestinians expelled, loss of their land.\n“And so for us Americans to come in and say, ‘well, let’s just paper over these differences, forget about the right of return, forget about Israeli historic grievances and Palestinian historic grievances, put a bow around it and call this peace’ – that was never going to fly with the parties.”",
        "scraped_at": "2025-12-23T09:42:09.776513",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/study-disputes-gaza-genocide-charges-finds-flawed-data-amid-hamas-driven-narrative",
        "title": "Study disputes Gaza genocide charges, finds flawed data amid Hamas-driven narrative",
        "publish_date": "September 3, 2025 6:00am EDT",
        "author": "ByAmelie BotbolFox News",
        "content": "Fox News national correspondent Jeff Paul discusses Israel’s planned takeover of Gaza City amid its conflict with Hamas on ‘Fox News Live.’\nFIRST ON FOX:A new study disputes claims thatIsrael committed genocidein Gaza following Hamas’ Oct. 7, 2023 massacre, arguing that allegations of starvation, indiscriminate bombing and deliberate civilian killings lack verifiable evidence.\nThe reportby researchers from the Begin-Sadat Center for Strategic Studies at Bar-Ilan University, \"Debunking the Genocide Allegations: A Reexamination of the Israel-Hamas War\" (2023-2025), contends that the genocide narrative has been driven by faulty data, uncritical sourcing and a humanitarian system vulnerable to manipulation.\nA key element of the genocide accusations is the claim that Israel deliberately starved Gaza’s population. The study argues that \"claims of starvation prior to March 2, 2025, were based on erroneous data, circular citations, and a failure to critically review sources.\" While U.N. officials and rights groups maintained that 500 trucks a day were needed to prevent famine, prewar U.N. figures show Gaza averaged 292 daily in 2022 — only 73 of them carrying food.\nUN EXPERT REPEATS ISRAEL 'GENOCIDE' CLAIMS AFTER US CALLS FOR HER REMOVAL\nThe Chief of the General Staff LTG Eyal Zamir, conducted a field tour in the Gaza Strip.(IDF Spokesman's Unit)\n\"That was completely adequate to meet demand,\" report co-author Danny Orbach, a military historian from the Hebrew University of Jerusalem, told Fox News Digital.\nThe study says Israel regularly surpassed the food supply needed during the war, averaging more than 100 trucks a day through March 2025. During a ceasefire-for-hostage deal, that number climbed to about 600 daily.\n\"The idea thatHamas didn’t seize aidis absurd,\" Orbach said. \"In every conflict, armed groups take the bulk of humanitarian supplies. We have documents and testimonies proving Hamas did so.\"\nThe report argues that genocide allegations spread through what Orbach called an \"inverted funnel of information.\" Journalists and aid workers in Gaza often depended on Hamas-linked translators and fixers, whose accounts filtered into U.N. reports, mainstream media and online platforms.\n\"The average Westerner sees dozens of reports about Israeli crimes and assumes they must be true. But they all trace back to a handful of Hamas-affiliated sources,\" Orbach said.\nIsraeli air strikes on Gaza a day after Hamas terrorists invaded parts of southern Israel. Oct 2023.(Mustafa Hassona/Anadolu Agency via Getty Images)\nThe second factor is \"humanitarian bias\" — the tendency to exaggerate conditions to prompt action. \"Organizations warn of famine before it happens, relying on dubious facts to change reality. Questioning becomes an immoral act,\" Orbach said.\nThe genocide allegation also rests on claims that Israel intentionally targeted civilians, but the study acknowledges civilian deaths while finding no evidence of a systematic policy of massacre.\nOrbach cited BBC data showing that between May 2024 and January 2025, 550 people were killed in designated safe zones—just 2.1% to 3.5% of total casualties, even though half of Gaza’s population was concentrated there for much of the period.\nHamas terrorists take up positions ahead of a hostage release in Deir al-Balah, central Gaza Strip on Feb. 8, 2025.(AP)\nISRAEL TURNS TABLES ON UN OFFICIAL CLAIMING 'GENOCIDE' IN GAZA WITH BASIC QUESTIONS\n\"That indicates the zones were relatively safe, despite Hamas using them to launch rockets,\" Orbach stated.\nThe report notes that context is crucial, stating that Hamas deliberately positioned itself in civilian areas, used human shields andblocked evacuationsto increase civilian casualties and international condemnation of Israel.\n\"Hamas exposes its own people to danger intentionally so Israel will be blamed,\" Orbach said.\nA Gazan man mourns relatives killed in Israeli attacks in the Gaza Strip, at a hospital morgue in Deir al-Balah, Tuesday, July 9, 2024.(AP Photo/Abdel Kareem Hana)\nWhile critics have accused the Israeli air force of indiscriminate bombing, the study finds that strikes generally targeted military objectives, though civilian casualties were inevitable.\n\"The IDF is the first army in history to issuefocused warnings, deliver large-scale aid into enemy territory, and sacrifice surprise to protect civilians,\" he said. \"You cannot fight an enemy embedded in 500 kilometers of tunnels, dressed as civilians without massive destruction.\"\nThe study pays particular attention to casualty figures published by the Hamas-run Gaza Health Ministry, claiming they were manipulated to create misleading impressions of the demographics of the dead. It presents alternative statistical models suggesting combatant fatalities may have been underreported, distorting the civilian-to-combatant ratio.\nHamas terrorists carrying clubs and firearms secure and divert humanitarian aid trucks in the northern Gaza area of Jabaliya on June. 25(TPS-IL)\nThe report says that genocide requires systematic intent to destroy a people — something it finds absent in Gaza. \"You don’t see the hallmarks of genocidal warfare here,\" Orbach said. \"There are no campaigns of rape, frontal massacres or close-range executions. In other conflicts in theMiddle East, dozens of such atrocities occurred in just a few hours of fighting.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe IDF announced its troops are now operating in Rafah. Its troops are continuing ground activity in northern and central Gaza.(IDF)\nOrbach and his fellow authors conclude that allegations of genocide against Israel rely on politicized narratives, selective data and the exploitation of humanitarian discourse.\n\"Analyzing devastation or civilian deaths without understanding Hamas’ tactics is absurd,\" he stated.\nAmelie Botbol is a freelance journalist based in Tel Aviv. Her articles have appeared in the New York Post, Canada’s National Post, and the Washington Times. Amelie can be followed on X @DatReporter",
        "scraped_at": "2025-12-23T09:42:13.196287",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/ceasefire-over-israel-strikes-gaza-after-hamas-refused-release-hostages-officials-say",
        "title": "Ceasefire over as Israel strikes Gaza after Hamas refused to release hostages, officials say",
        "publish_date": "March 17, 2025 9:02pm EDT",
        "author": "ByLouis Casiano,Trey Yingst,Landon Mion,Anders HagstromFox News",
        "content": "Fox News correspondent Trey Yingst has the latest on the Israel-Hamas war on 'Hannity.'\nIsraeli strikeson the Gaza Strip eliminated the head of the Hamas government and other key terrorist leaders in a wave of violence following the collapse of their ceasefire agreement, Israeli forces announced Tuesday.The Israeli Defense Forces (IDF) and the Israel Security Agency (ISA), also known as Shin Bet, said in a joint statement that the airstrikes eliminated Essam al-Da'alis, head of the Hamas government and \"the most senior figure of authority in the Gaza Strip.\"\n\"Essam al-Da'alis replaced Rawhi Mushtaha in this position after he was eliminated in July 2024. In his role, al-Da'alis was responsible for the functioning of Hamas' terror regime in the Gaza Strip and oversaw the integration of all of Hamas’ branches in Gaza and their use for terrorist purposes,\" the statement said.The IDF and ISA also determined with \"high probability\" that Israeli strikes eliminated Mahmoud Marzouk Ahmed Abu-Watfa, the Minister of Internal Affairs in charge of Hamas' Internal Security Forces; Bahajat Hassan Mohammed Abu-Sultan, who served as Head of Hamas' Internal Security Forces; and Ahmed Amar Abdullah Alhata, who served as Hamas' Minister of Justice.\nREMAINS OF SHIRI BIBAS, MOM OF TWO KILLED, ALLEGEDLY RETURNED TO ISRAEL FOLLOWING HAMAS' BROKEN PROMISE\nA view of demolished buildings and damage in the city of Rafah, Gaza, after Israeli airstrikes.(Abed Zagout/Anadolu via Getty Images)\nOver the past day, the IDF said it \"struck dozens of terror targets and terrorists throughout the Gaza Strip, including mid-level and senior-ranking terrorists in Hamas' Political Bureau.\"\n\"The strikes were conducted to damage Hamas' governmental and military capabilities, and to remove threats to the State of Israel and its citizens,\" the statement said. \"The IDF will continue to operate against the Hamas terrorist organization and remove any threat to the State of Israel.\"At least 404 Palestinians, including women and children, have been killed in the airstrikes so far, according to the Hamas-run Gaza health ministry. The death toll has not been independently verified.\nPresident Donald Trump's administration backed Israel's move to end the ceasefire in a statement on Monday.\n\"Hamas could have released hostages to extend the ceasefire but instead chose refusal and war,\" National Security Council (NSC) spokesman Brian Hughes told Fox News.\nIsrael will intensify its military actionsagainst Hamasmoving forward, authorities said.\n\"Under the direction of the political echelon, the IDF and Shin Bet are widely attacking terrorist targets of the Hamas terrorist organization throughout the Gaza Strip, more details below,\" the IDF and ISA said.\nNetanyahu with Defense minister Israel Katz, IDF chief Eyal Zamir. And other security officials  are holding a security assessment in the Kirya in Tel Aviv.(Prime Minister of Israel )\nThe IDF launched a series of preemptive strikes targeting mid-ranking military commanders, leadership officials and terrorist infrastructure belonging to the Hamas terrorist organization, an Israeli official told Fox News. The military offensive will continue as long as necessary, and will expand beyond air strikes, the official said.\nDozens of targets were chosen, based on Hamas readiness to execute terror attacks, and build up and re-arm its forces. Following a situational assessment by Katz and the IDF officials, a decision was made not to open up schools and educational activities in the Gaza Envelope, authorities said.\nThe office of Israeli Prime Minister Benjamin Netanyahu said the airstrikes came after Hamas \"rejected all offers it received\" from the Trump administration's special envoy to the Mideast, Steve Witkoff, and the other mediators.\nHAMAS FREES THREE MORE HOSTAGES IN EXCHANGE FOR MORE THAN 300 PRISONERS AS PART OF CEASEFIRE DEAL WITH ISRAEL\nIsraeli Prime Minister Benjamin Netanyahu attends a security assessment after the ceasefire with Hamas disintegrated this week.(Prime Minister of Israel )\n\"Tonight, we returned to fighting in Gaza due to Hamas' refusal to release the hostages and threats to harm IDF soldiers and Israeli communities,\" Katz said. \"If Hamas does not release all the hostages, the gates of hell will open in Gaza, and Hamas' murderers and rapists will meet the IDF with forces they have never known before.\"\nHe noted that Israel \"will not stop fighting until all the hostages return home and all the war's goals are achieved.\"\nThe Israeli military ordered people to evacuate eastern Gaza and move toward the center of the territory after its airstrikes across the territory, suggesting that the military could launch renewed ground operations into Gaza.\nIn a statement, Hamas blamed Netanyahu \"and the Nazi Zionist occupation fully responsible for the repercussions of the treacherous aggression on Gaza, and for the defenseless civilians and our besieged Palestinian people, who are subjected to a brutal war and a systematic policy of starvation.\"\nThe terror group called for theUnited Nationsand the U.N. Security Council to urgently convene to adopt a resolution demanding Israel halt military operations and fully withdraw from Gaza and for Muslim nations to back Palestinian resistance.\nCLICK HERE TO GET THE FOX NEWS APP\nHamas has insisted on sticking with the original terms of the deal, with Israel fully withdrawing from Gaza and agreeing to permanently end the war in exchange for the release of the remaining living hostages.\nNetanyahu has long insisted that Israel will not end the war until Hamas’ governing and military capabilities have been destroyed.\nThe strikes come after nearly two months of a ceasefire to pause the17-month-long warwhere dozens of hostages were released in exchange for nearly 2,000 Palestinian prisoners.\nOn Monday, Israeli forces launched airstrikes in Gaza,southern Lebanonand southern Syria. The IDF said it was targeting terrorists plotting attacks.\nFox News' Nick Rojas and the Associated Press contributed to this report.\nLouis Casiano is a reporter for Fox News Digital. Story tips can be sent tolouis.casiano@fox.com.",
        "scraped_at": "2025-12-23T09:42:17.330063",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israels-government-likely-approve-plan-re-occupy-gaza-israeli-media-reports?msockid=1cd7b05cd5a66a1e1db0a6c1d4e66b41",
        "title": "Israel’s government likely to approve plan to re-occupy Gaza, Israeli media reports",
        "publish_date": "August 4, 2025 4:11pm EDT",
        "author": "ByRuth Marks EglashFox News",
        "content": "Journalist Tal Heinrich explains Israel’s goal for Gaza once there is an end to the ongoing conflict on 'Sunday Night in America.'\nIsrael’s Security Cabinet is set to meet on Tuesday to discuss next steps in the nearly two-year-old war with the Hamas terror group in the Gaza Strip, including the possibility of taking full control of the Palestinian enclave and operating militarily in areas they have refrained from entering until now, thelocal media reported.\nIsraeli journalistAmit Segal, a commentator for Channel 12, the country’s highest-rated news broadcast, quoted a source from the office of Prime Minister Benjamin Netanyahu as saying that the \"decision has been made… we are going to occupy the Gaza Strip.\"\n\"Hamas will not releasehostageswithout total surrender, if we do not operate now the hostages will die of starvation and Gaza will stay under Hamas’ control,\" Segal quoted the official as saying.\nHUCKABEE, WITKOFF WENT INSIDE GAZA TO ASSESS GROWING FAMINE CONCERNS\n\"Israel for months was at a crossroad and, let’s be honest, it was not achieving victory or the hostages. The mandate for a deal was broad, but we did not get agreement, so we will go for occupation,\" he quoted.\nThe reports of deepening the military operation in Gaza come after months of mediated ceasefire talks between Israel and Hamas appeared to have collapsed this week and despite assurances by U.S. Middle East envoy Steve Witkoff, who visited Israel over the weekend, that he was working on a plan that would end the war.\nPrime Minister Benjamin Netanyahu spoke this evening at length with the families of the hostages Rom Braslavski and Evyatar David.(Getty Images)\nFamilies of hostages gather in Tel Aviv, Israel, on August 2, 2025, to call for a ceasefire and hostage release deal, marking day 666 since the October 7th attacks. Holding signs, photographs, and yellow ribbons symbolizing their missing loved ones, demonstrators demand urgent action from the Israeli government to secure the return of captives still held in Gaza. The protest forms part of an ongoing public campaign urging political leaders to prioritize negotiations, as the prolonged conflict continues to exact a heavy toll on both sides.(ORI AVIRAM/Middle East Images/AFP via Getty Images)\nFamilies of hostages protest, demanding the release from Hamas captivity in the Gaza Strip, at the plaza known as the hostages square in Tel Aviv, Israel, Saturday, Aug. 2, 2025.(AP Photo/Ariel Schalit)\nIt also comes after Hamas, thedesignated terror groupwhose October 7, 2023, mass attack in Israel sparked the war, shocked the Israeli public with propaganda videos of emaciated hostages, including one who was forced to dig his own grave.\nAdditionally, international pressure on Israel to end the war has ramped up in recent weeks amid accusations that is aid policy is causingfamine in Gazaand after images of severely malnourished children – some of whom were later proven to be children with pre-existing medical conditions – went viral.\nEUROPEAN LEADERS DECRY HAMAS VIDEO OF ISRAELI CAPTIVES: ‘UNLIMITED INHUMANITY’\nPressure in Israel to end the war and return home some 50 hostages, both dead and alive, who remain in Gaza has also been growing, with the country’s leadership divided over the best way to achieve this.\nCLICK HERE TO GET THE FOX NEWS APP\nSome ministers in Netanyahu’s government, such as Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, have been pushing for Israel to re-occupy Gaza and rebuild Jewish settlements that were dismantled 20 years ago.\nThe Israeli military, however, has argued against that plan and, according tomedia reports, is expected to present some alternatives at Tuesday’s cabinet meeting.\nRuth Marks Eglash is a veteran journalist based inJerusalem, Israel. She reports and covers theMiddle EastandEurope. Originally from the U.K, she has also freelanced for numerous news outlets. Ruth can be followed on Twitter @reglash",
        "scraped_at": "2025-12-23T09:42:20.676176",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/after-trump-declares-war-over-hamas-executes-rivals-gaza-reassert-control?msockid=1cd7b05cd5a66a1e1db0a6c1d4e66b41",
        "title": "After Trump declares ‘war is over,’ Hamas executes rivals in Gaza to reassert control",
        "publish_date": "October 14, 2025 6:00am EDT",
        "author": "ByEfrat LachterFox News",
        "content": "President Trump thanked Israeli lawmakers for their welcome in the Knesset as the nation celebrated the release of all 20 living hostages from Hamas captivity.\nAfter PresidentDonald Trumpdeclared in Israel’s Knesset that \"the war is over\" and celebrated the return of the remaining living hostages, Hamas terrorists across the border in Gaza were reportedly killing its opponents in Gaza City’s main square — in full view of the public.\nVideos circulating on social media appear to show the executions, which an Israeli military official told Fox News Digital are, \"Hamas’s deliberate attempt to show the killing publicly and reestablish its rule by terrorizing civilians.\"\nIn conversations with Fox News Digital, Gazans described Hamas fighters reappearing in the streets and reasserting control — yet some said this could also be their first real chance for change and to get rid of the terror regime.\nMukhaimar Abu Saada, a political analyst from Gaza, told Fox News Digital disarming Hamas will not be easy, as clashes between the group and local militias have already erupted. \"This won’t happen quickly,\" he said. \"We’re talking about an ideological organization. Even last night, people were killed in clashes between Hamas and local militias. It’s not a rosy road.\"\nTRUMP PEACE PLAN FOR GAZA COULD BE JUST A 'PAUSE' BEFORE HAMAS STRIKES AGAIN, EXPERTS WARN\nPresident Donald Trump addresses the Knesset, Israel's parliament, on Oct. 13, 2025 in Jerusalem. President Trump is visiting the country hours after Hamas released the remaining Israeli hostages captured on Oct. 7, 2023, part of a U.S.-brokered ceasefire deal to end the war in Gaza.(Photo by Evelyn Hockstein - Pool/Getty Images)\nAbu Saada said Hamas has issued an ultimatum giving collaborators withIsraeluntil October 19 to surrender and seek amnesty from Hamas — as long as they were not involved in killings.\n\"They’re still strong,\" he admitted. \"Part of the reason they didn’t fight harder in the last days is that they saved some men and weapons for the day after. I still see Hamas police in the streets of Gaza. Trump said they lost thousands, but they’re still there, able to control the streets once Israel redeploys.\"\nA man in Gaza who asked to remain anonymous told Fox News Digital that, despite official declarations, \"You cannot say the war is finished,\" he said. \"We have to wait a few weeks to see what happens. There are gangs in Gaza now; Hamas is trying to fight them. If they don’t unify, another war could start.\"\nHe described Hamas as weakened and divided. \"Hamas is not strong like before. Those who remain are mostly police — not the real Hamas people who believe in their extremist jihadist ideology,\" he said. \"We have to watch what happens next and see if they rebuild.\"\nHe said the group’s survival depends on whether it accepts the deal. He called the situation \"very strange,\" noting that Hamas agreed to releaseall hostageswhile Israeli is still holding parts of Gaza. \"It’s not a real deal yet. We need someone from Hamas to explain what they agreed to, because we need to think about our future.\"\nA group of Hamas terrorists in Deir-el Balah in central Gaza as 20 living Israeli hostages were freed on Oct. 13, 2025.(Photos by TPS-IL)\nFROM GRIEF TO GRATITUDE: TRUMP PRAISED AS ISRAELIS CELEBRATE HAMAS HOSTAGE DEAL IN TEL AVIV\nAnother man in Gaza City voiced the same uncertainty. \"No one knows what is happening — who will rule, what will happen with Hamas, and if the war is truly over,\" he said. \"We hope for a better future. I just want me and my family to live without targeting, without bloodshed.\"\nOrdinary Gazans, he added, are exhausted but yearning for calm. \"People just want the blood to stop. They want to stop losing their relatives and friends … It’s in their hands now — if they will allow Hamas to continue or finally rise up. But nothing is clear.\"\nAbu Saada said there is \"no question Hamas will have to disarm one way or another,\" describing it as an inevitable part of the plan announced by President Trump and endorsed by Israel’s leadership.\n\"The real question is who will hold those weapons — the Palestinian Authority or the so-called ‘security stabilization force’ that’s supposed to deploy next. It’s definitely going to happen, but we have to wait for the second phase of the negotiations.\"\nA Gazan family walks near the rubble of buildings during the Eid al-Adha holiday, in Gaza City, June 6, 2025.(Mahmoud Issa/Reuters)\nAbu Saada said evenQatari mediatorshave confirmed that disarmament \"has not yet been discussed but will be discussed in the coming days.\" For now, he added, Gazans are focused on survival after \"two years of misery, destruction, and bloodshed.\"\nUltimately, he said, Hamas will have to comply. \"No Arab country will give a single dollar if Hamas doesn’t disarm. Rebuilding Gaza depends on Hamas no longer being in control. The war is over, but the real test is only beginning.\"\nWhile voices inside Gaza reflect uncertainty, experts in Washington say Hamas’s political and military isolation has never been greater.\nISRAEL-HAMAS CEASEFIRE TAKES EFFECT, IDF BEGINS PULLING BACK IN GAZA\nJacob Olidort, director of the Center for American Security at the America First Policy Institute, told Fox News Digital that Hamas is \"in the most militarily and diplomatically isolated place it has ever been.\"\n\"Even before and after the release of hostages, Hamas has been defiant in tone,\" Olidort said. \"But all of that will be overshadowed by the vast expansion of peace agreements between Israel and its neighbors. All of Israel’s regional partners are eager to normalize and build on where they left off prior to Oct 7.\"\nA group of Hamas gunmen in Deir-el Balah in central Gaza as 20 living Israeli hostages were freed on Oct. 13, 2025.(Photos by TPS-IL)\nOlidort said the Sharm el-Sheikh summit will mark the beginning of phase two of Trump’s plan — \"Whatever is happening now on the ground doesn’t reflect Gaza’s future,\" he said. \"None of the steps in the peace plan have been implemented yet. What comes next will be defined by that summit and by the regional consensus that Hamas cannot continue to control Gaza.\"\nFor Israel, he added, \"the focus will be restarting, in a more public way, its regional and global partnerships — defense, commercial, and diplomatic. That’s where Israel’s future lies.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWhile the guns have fallen silent, the next stage — Hamas’ disarmament and the arrival of a stabilization force — will determine whether Gaza finally begins rebuilding or slips back into chaos. As Abu Saada put it, \"The war is over, but the question is whether peace will really begin.\"\nEfrat Lachter is an investigative reporter and war correspondent. Her work has taken her to 40 countries, including Ukraine, Russia, Iraq, Syria, Sudan and Afghanistan. She is a recipient of the 2024 Knight-Wallace Fellowship for Journalism. Lachter can be followed on X @efratlachter.",
        "scraped_at": "2025-12-23T09:42:23.995889",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/arab-nations-first-time-pressure-hamas-disarm-relinquish-power-gaza?msockid=1cd7b05cd5a66a1e1db0a6c1d4e66b41",
        "title": "Arab nations for first time pressure Hamas to disarm, relinquish power in Gaza",
        "publish_date": "July 30, 2025 2:21pm EDT",
        "author": "ByRachel WolfFox News",
        "content": "Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com.\nSeveral Arab nations, including Qatar, Saudi Arabia and Egypt, are demanding that Hamas lay down its arms and agree to a two-state solution as the terror group's war with Israel rages.\nThe entire Arab League, the European Union and 17 other countries backed the \"New York Declaration\" on Tuesday, during a conference co-chaired by France and Saudi Arabia.\nThe declaration, which was obtained and published by theTimes of Israel, calls for the unification of Gaza and the West Bank under the control of the Palestinian Authority and for \"the end of armed group control and the dismantlement of their military capabilities,\" likely referring to Hamas and other Palestinian terror groups.\nSaudi Foreign Minister Faisal bin Farhan Al-Saud and French Foreign Minister Jean-Noel Barrot, co-chairs of a United Nations high-level international conference hosted by France and Saudi Arabia to work towards a two-state solution between Israel and the Palestinians, listen to a question during a press briefing at U.N. headquarters in New York City, July 28, 2025.(REUTERS/Kylie Cooper)\nSTARMER SAYS UK TO RECOGNIZE PALESTINIAN STATE IF ISRAEL DOESN'T AGREE TO CEASEFIRE, HAMAS MUST 'DISARM'\n\"In the context of ending the war in Gaza, Hamas must end its rule in Gaza and hand over its weapons to the Palestinian Authority, with international engagement and support, in line with the objective of a sovereign and independent Palestinian State,\" the declaration states.\nAdditionally, it demands that Israel issue a commitment to a two-state solution that includes a sovereign Palestinian state with East Jerusalem as its capital. However, Israeli Prime MinisterBenjamin Netanyahuhas long rejected the proposition of a two-state solution, often citing security concerns.\nThe document emphasizes that \"only a political solution\" can bring about peace, security and the end of the bloody decades-long Israeli-Palestinian conflict. The nations who signed onto the declaration are looking to \"[empower] a sovereign and economically viable State of Palestine, living side-by-side, in peace and security with Israel.\"\nFrench Foreign Minister Jean-Noel Barrot speaks during a United Nations high level conference hosted by France and Saudi Arabia to work towards a two-state solution between Israel and the Palestinians at U.N. headquarters in New York City, U.S., July 28, 2025.(REUTERS/Jeenah Moon)\nTRUMP REJECTS MACRON MOVE AS US SKIPS UN SUMMIT ON PALESTINIAN STATE\nRegarding the war in Gaza, the declaration is clear in saying that it \"must end now\" and that \"Hamas must free all hostages.\" Furthermore, it calls for the return of remains, the exchange of Palestinian prisoners and the withdrawal of Israeli forces from Gaza. The declaration expresses support for the mediation efforts of Egypt, Qatar, and the U.S., all of which have been working with both sides of the war to secure a lasting peace agreement.\nAccording to the declaration, following the ceasefire, a transitional committee would be established to \"operate in Gaza under the umbrella of the Palestinian Authority.\"\nThe document also condemns both the Oct. 7 massacre and Israel’s conduct during the war:\n\"We condemnthe attacks committed by Hamasagainst civilians on the 7th of October. We also condemn the attacks by Israel against civilians in Gaza and civilian infrastructure, siege and starvation, which have resulted in a devastating humanitarian catastrophe and protection crisis.\"\nIsraeli Permanent Member to the United Nations Danny Danon speaks during a session of the Security Council at the New York City headquarters.(Israel United Nations mission)\nTRUMP ADMIN STANDS BY ISRAEL, REJECTS UN RESOLUTION BACKED BY UK AND FRANCE\nIsrael, however, did not respond well to the declaration, saying it would not back down from its goal of eliminating Hamas.\n\"No token recognition and no U.N. resolution will change the basic fact that there are those in the world who fight terrorists and extremist forces and then there are those who turn a blind eye to them or resort to appeasement,\" Israeli U.N. AmbassadorDanny Danonsaid in a statement. \"We will do whatever is necessary to bring home the hostages and defeat Hamas.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe U.S. balked at the conference, saying it was \"unproductive and ill-timed.\"\n\"This is a publicity stunt that comes in the middle of delicate diplomatic efforts to end the conflict.  Far from promoting peace, the conference will prolong the war, embolden Hamas, and reward its obstruction and undermine real-world efforts to achieve peace,\" State Department Spokesperson Tammy Bruce said in a statement. \"The United States will not participate in this insult but will continue to lead real-world efforts to end the fighting and deliver a permanent peace.\"\nRachel Wolf is a breaking news writer for Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-23T09:42:27.311644",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israels-evacuation-orders-cover-more-than-two-thirds-gaza-strip-war-hamas-continues?msockid=1cd7b05cd5a66a1e1db0a6c1d4e66b41",
        "title": "Israel's evacuation orders cover more than two-thirds of the Gaza Strip as war with Hamas continues",
        "publish_date": "February 6, 2024 9:35am EST",
        "author": "ByLawrence RichardFox News",
        "content": "Armed Israeli forces disguised as women and medical workers killed three Palestinian terrorists inside a hospital in the occupied West Bank Tuesday.\nIsrael has ordered an evacuation that now covers two-thirds of the Gaza Strip amid its ongoing war with the Hamas terror group,United Nationshumanitarian monitors said Tuesday.\nThe new evacuation order covers approximately 95 square miles of the Palestinian territory, according to the U.N. Office for the Coordination of Humanitarian Affairs (OCHA). Some 1.78 million Palestinians, or 77% of Gaza’s population, lived in the affected area before Israel’s war with Hamas. The ensuing conflict has left much of the territory unlivable.\nTheIsraeli militarysaid the evacuation order includes residential areas throughout the south as it continues to pursue Hamas targets, which it claims often operate within civilian sites.\nAccording to OCHA, most of Gaza’s 2.3 million people now seek shelter in the town of Rafah, on the border with Egypt and surrounding areas. Many of the Palestinians have been forced to live in makeshift tents without reliable sources of food or water.\nBIDEN ADMIN CUTS FUNDING TO CONTROVERSIAL UN AGENCY AMID ALLEGATIONS MEMBERS ASSISTED IN HAMAS MASSACRE\nMany Palestinian families take refuge under harsh conditions at a school affiliated to the United Nations Relief and Works Agency for Palestine Refugees at the Daraj neighborhood as the Israeli attacks continue in Gaza City, Gaza, on Feb. 6, 2024.(Dawoud Abo Alkas/Anadolu via Getty Images)\nAhead of the Israeli military’s ground invasion into the territory, it initially ordered Palestinians to flee Northern Gaza. The instructions included telling them to travel south and to seek refuge at United Nations Relief and Works Agency for Palestine Refugees in the Near East facilities in the city of Khan Younis.\nAs Israel’s war with Hamas continued, the fighting moved toward the central andsouthern parts of the territory,prompting further evacuations where residents were initially told to take refuge.\nPalestinians have been forced to flee Northern Gaza and now most of the territory's population seeks shelter near the border with Egypt.(Fox News)\nTens of thousands of people have fled and continue to flee from there, OCHA said.\nISRAEL ISSUES DETAILED THREAT TO HEZBOLLAH, IRAN AS GAZA WAR HITS 4 MONTHS\nIn recent weeks, the current focus of Israel’s ground offensive has moved to the southern cities, where Israeli aircraft have launched voluminous attacks. Israel continues to seek to eliminate Hamas’ rule in the territory and secure the safe release of its remaining hostages.\nPalestinians, trying to live in makeshift tents they set up, are viewed in Rafah, Gaza, on Feb. 5, 2024. Thousands of Palestinians who fled the Israeli army attacks and took refuge in Rafah city in the southern Gaza Strip are struggling to survive under hard conditions.(Abed Zagout/Anadolu via Getty Images)\nAccording to the Gaza health ministry, which is run by Hamas, the Palestinian death toll in the territory is more than 27,000. Health officials do not differentiate between combatants and civilians in the tally.\nThe war was triggered on Oct. 7, after Hamas led a deadly attack on unsuspecting border communities in southern Israel, leaving some 1,200 people dead. The terror group also took more than 200 hostages back into Gaza, where they are believed to have been escorted through a vast network system.\nCLICK HERE TO GET THE FOX NEWS APP\nSecretary of State Antony Blinken, left, meets with Saudi Arabia's Crown Prince Mohammed bin Salman in Riyadh, Saudi Arabia, Monday, Feb. 5, 2024. Blinken continues to meet with officials across the region in an effort to prevent the Israel-Hamas war from becoming a wider conflict.(AP Photo/Mark Schiefelbein)\nBoth sides continue to negotiate a cease-fire that would include ending military operations and the safe release of hostages, as well as allowing much-needed humanitarian aid into the region.\nSecretary of State Antony Blinken hasreturned to the Middle Eastin his latest attempt to keep the region stable as the Israel-Hamas war has caused conflicts to spring up in Iraq, Syria, Yemen, Lebanon and Jordan.\nThe Associated Press contributed to this report.",
        "scraped_at": "2025-12-23T09:42:31.121789",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israel-hamas-terrorists-reoccurring-battles-around-gaza-strip?msockid=1cd7b05cd5a66a1e1db0a6c1d4e66b41",
        "title": "Israel, Hamas terrorists and the reoccurring battles around the Gaza Strip",
        "publish_date": "October 9, 2023 12:27pm EDT",
        "author": "ByGabriele RegalbutoFox News",
        "content": "Fox News correspondent Trey Yingst reports from Gaza City amid the devastating aftermath of the deadly fighting.\nThe Gaza Strip - or Gaza - is a 140-square-mile piece of land along the Mediterranean Seabetween Egyptand Israel. It is comprised of the cities Rafah, Khan Younis, Deir al-Balah, Jabalia, Al-Nazlah and Gaza.\nThe Egyptians previously occupied the Gaza Strip by way of military rule from 1949 to 1956 and again from 1957 to 1967.The Israelisassumed occupation over the strip in 1967 during the Six Day War beginning with an airstrike that destroyed the Egyptian air force. The conflict began on June 5, 1967 and ended on June 10, resulting in Israel's possession of The Holy Basin including the Old City of Jerusalem and Gaza as well as the West Bank and East Jerusalem.\nIsraeli forces recaptured areas near the Gaza Strip that had been overrun in a Hamas mass-infiltration over the weekend.\nPalestinians walk away from the kibbutz of Kfar Azza, Israel, near the fence with the Gaza Strip on Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multifront attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday.(AP Photo/Hassan Eslaiah)\nPalestinians celebrate by a destroyed Israeli tank at the Gaza Strip fence east of Khan Younis southern Saturday, Oct. 7, 2023. The militant Hamas rulers of the Gaza Strip carried out an unprecedented, multifront attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations by air, land, and sea and catching the country off-guard on a major holiday.(AP Photo/Hassan Eslaiah)\n\"The Six Day Warwas one of the greatest victories in the history of Israel,\" Prime Minister Benjamin Netanyahu said in 2017.\nWHAT IS HAMAS? AN OVERVIEW OF THE ISLAMIC GROUP THAT ATTACKED ISRAEL\nThe Gaza Strip, where millions of Palestinians presently reside, was later seized by Hamas, an Iranian-backed terrorist group that brutally opposes Israel's existence.\nViolence between Israelis and Palestinians has occurred for years not exclusively to Israel, but also in Gaza andthe West Bank,killing thousands of civilians in years past.\nHamas, classified as aterrorist groupby the U.S. State Department, has brutalized and killed thousands of civilians, including several Americans, during a surprise attack on Israel the morning of Oct. 7, firing rockets from the Gaza Strip. The sound of rocket launches could be heard in Gaza as residents reported armed clashes along the separation fence with Israel, near the southern town of Khan Younis.\nBIDEN CLAIMS TO HAVE SERVED AS A ‘LIAISON’ DURING SIX-DAY WAR DESPITE STILL BEING IN LAW SCHOOL AT THE TIME\nMore than 100 Israeli civilians were taken by Hamas terrorists and are being held hostage in Gaza. Qatari mediators are negotiating with Hamas officials to release Israeli people that are presently captive. Hostages include civilians from ages of infancy to the elderly.Secretary of State Antony Blinkenstated he is aware of reports from Sunday that Americans may be among the hostages. As of Monday morning, the Biden administration has not yet confirmed the validity of this.\nPalestinian demonstrators chant slogans during a protest against the territory's chronic power outages and difficult living conditions along the streets of Khan Younis, southern Gaza Strip, Sunday, July 30, 2023. Several thousand people briefly took to the streets across the Gaza Strip chanting \"what a shame\" and in one place burning Hamas flags, before police moved in and broke up the protests.(AP Photo)\nSmoke rises after Israeli air forces targeting a shopping center in Gaza Strip, Gaza on Oct. 7, 2023. Israeli airstrikes on Gaza Strip launched after a Hamas offensive has killed at least 232 Palestinians, the territory's Health Ministry said on Saturday.(Ashraf Amra/Anadolu Agency via Getty Images)\nSmoke and flames rise during Israeli airstrikes in Khan Younis in the southern Gaza Strip, April 7, 2023.(REUTERS/Ashraf Amra)\nThe Israel Defense Forces surrounded the Gaza border on Monday where tens of thousands of Israeli troops are stationed and have regained control of the area. The same day, Israeli Energy and Infrastructure Minister Israel Katz ordered the water supply to Gaza Strip be cut off.\n\"I have ordered a complete siege on the Gaza Strip,\" said Israel Defense Minister Yoav Gallant at the IDF Southern Command in Beersheba. \"There will be no electricity, no food, no fuel, everything is closed.\"\nISRAEL AT WAR: SEE THE PHOTOS, VIDEO OF THE ATTACK AND AFTERMATH\nGallant added, \"We are fighting human animals and we are acting accordingly.\"\nBeer Sheva, a city around 25 miles south of Gaza, is aiding wounded persons, including those in serious and critical condition.\nGabriele Regalbuto is a Senior Editor of SEO at Fox News Digital. Gabriele has a Journalism and Communications degree from West Virginia University. She has worked to produce content for newspapers, magazines, and digital platforms. At Fox, she has assisted in coverage of breaking news events including the 2024 presidential cycle, 2022 midterm elections, Queen Elizabeth II's death, the ongoing war between Russia and Ukraine.",
        "scraped_at": "2025-12-23T09:42:35.363084",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "BBC",
        "url": "https://bbc.com/news/articles/clyv7w3gdy2o",
        "title": "What is Hamas and why is it fighting with Israel in Gaza?",
        "publish_date": "2025-10-14T14:51:27.261Z",
        "author": "N/A",
        "content": "Hamas is an armed Palestinian group and political movement in the Gaza Strip.\nOn 7 October 2023 it attacked Israel, killing about 1,200 people and taking 251 hostages. This triggered a massive Israeli military offensive in Gaza, which has killed tens of thousands of Palestinians.\nHamas, which the US, UK, Israel and many other nations have designated as a terrorist organisation, has been severely weakened during the conflict.\nIn October 2025, the first phase of a ceasefire deal brokered by US President Donald Trump saw the remaining 20 living Israeli hostages released and nearly 2,000 Palestinian prisoners and detainees freed from Israeli jails.\nHamas started as an offshoot of the Muslim Brotherhood in 1987. Its name means Islamic Resistance Movement.\nIt is opposed to the existence of Israel on what it says is Palestinian land. It wants a state based on Islam in its place and across the occupied West Bank, East Jerusalem and Gaza.\nIt has, however, signalled its willingness to accept an interim Palestinian state in just the West Bank, East Jerusalem and Gaza, without renouncing its claim to all of historic Palestine.\nBefore the 7 October attacks, Hamas was estimated to have about 30,000 fighters, but Israel said in August 2024 that its forces had killed more than 17,000 of them. This could not be independently verified.\nHamas became the sole ruler in the Gaza Strip in 2007, after winning Palestinian elections and violently ousting rivals.\nHowever, as a result of the war, the group's infrastructure and ability to operate openly have been all but destroyed.\nWhen Hamas attacked Israel on 7 October 2023, the group's main leader was Ismail Haniyeh. He was based in Qatar, where the group has its political headquarters.\nHaniyeh was assassinated while visiting the Iranian capital, Tehran, in July 2024,in an attack which Israel said it carried out.\nHe was replaced by Yahya Sinwar, who had been leader of Hamas in Gaza since 2017.\nSinwar was killed by Israel Defense Forces (IDF) soldiers in Gaza in October 2024.\nHe was the architect of the 7 October attacks and was Israel's most wanted man.\nSeveral other top commanders of Hamas have been killed by Israel since the war began.\nSince Sinwar's death, Hamas has been led by a five-man council. At its head is believed to beKhalil al-Hayya, Sinwar's former deputy. Al-Hayya has been based in Qatar since before the October 2023 attack and has led Hamas delegations in indirect ceasefire talks with Israel.\nThe council also includes Khaled Meshaal, the head of Hamas's relations with Palestinian communities abroad; Zaher Jabarin, the exiled West Bank leader; Muhammad Darwish, head of the Shura Council, Hamas's top decision-making body; and a fifth individual whose identity is unknown. All are based in Qatar or Turkey.\nIn September 2025, Israel carried out strikes targeting Hamas leaders including Al-Hayya in Qatar, ina move which received international condemnation. Five Hamas members and a Qatari security official were killed, but Hamas said its leaders survived.\nHamas's most important ally is Iran - its biggest backer in terms of funds, weapons and political support.\nHamas led the deadliest attack on Israel in its history, killing about 1,200 people, including more than 360 young people at a music festival.\nThe unprecedented attack sent shockwaves across the country, as Hamas gunmen targeted border communities for hours and took hostages.\nHamas has described the attack as a response to what it says are decades of Israeli oppression, the killings of Palestinians and years-long blockade of the Gaza Strip.\nAs Israel prepared to mark a year since the attack, al-Hayya justified it by saying it had put the plight of the Palestinians on the world's political agenda.\n\"It was necessary to raise an alarm in the world to tell them that here there is a people who have a cause and have demands that must be met,\" he told the BBC's Jeremy Bowen.\nHamas has also said the attack was a reaction to what it claims are Israeli efforts to take over the al-Aqsa mosque compound in Jerusalem - Islam's third holiest site. Hamas also wants the release of thousands of Palestinians in Israeli prisons.\nThe year leading up to the attack was also the deadliest in the occupation of the West Bank, since the UN began recording data in 2005. By the end of the year at least 505 Palestinians had been killed there, mostly by Israeli soldiers and settlers. In the same year, 30 Israelis were also killed in the West Bank.\nAll Palestinian factions and parties oppose Israel's presence in the West Bank, as well as occupied East Jerusalem and the Gaza Strip. They want the land to be part of a future independent state, something backed by the vast majority of the international community.\nIsrael's occupation of the land and settlements it has built there isillegal under international law. However, Israel's current government does not recognise the right of the Palestinians to have their own state, arguing that it would be a security threat. It also claims a historical right to the West Bank.\nAnalysts have suggested the attack could also have been timed to derail recognition of Israel by Saudi Arabia, which was considered likely at the time.\nIsrael launched a massive military offensive against Hamas in Gaza following the 7 October attack. It began with air strikes and was followed by a ground invasion.\nIsraeli Prime Minister Benjamin Netanyahu said Israel's aims included destroying Hamas, returning the hostages and making sure Israel cannot be threatened in future.\nMore than 67,000 people in Gaza - mostly civilians, about half of whom were women and children - have been killed in the fighting, according to the Hamas-run health ministry.\nSome 460 Israeli soldiers have been killed during the war, the Israeli military says.\nThe UN says most of the 2.3 million population of Gaza have been forced from their homes and that Gaza's buildings and infrastructure have suffered catastrophic damage.\nHundreds of thousands of Palestinians were forced to flee when Israel began a major offensive to fully occupy Gaza City which, it says, remains Hamas's \"main stronghold\". The offensive marked a major escalation in Israel's two-year military campaign.\nA United Nations (UN) commission of inquiry said that Israel has committed genocide in Gaza. The UN's top court – the International Court of Justice - is currently examining aclaim of genocide in a case brought by South Africa. Israel says the case is \"wholly unfounded\".\nUN-backed experts also say there is famine in Gaza City and surrounding areas, conditions which it says are \"entirely man-made\". Israel called the experts' declaration an \"outright lie\".\nBoth Israel and Hamas have been accused of committing war crimes and human rights abuses. TheUN Human Rights Council says both sides have mounted attacksagainst civilian populations and are responsible for \"murder or wilful killings\". Both have rejected the report's findings.\nIn September 2025, the UK formally recognised a Palestinian state,citing the \"appalling situation\" in Gazaand Israel's illegal settlement expansion in the West Bank. Several other countries, including France, Canada and Australia also extended recognition. Israel condemned the moves, saying they rewarded Hamas for the 7 October attack.\nIn October 2025, the Israeli government and Hamas agreed to the first phase ofUS President Donald Trump's 20-point peace plan, leading to a ceasefire in Gaza.\nIsrael pulled its troops back to an agreed position, and allowed more aid to enter the Strip. Hamas returned the remaining 20 living Israeli hostages, while Israel freed almost 2,000 Palestinian prisoners and detainees.\nNegotiations continue over the details of the later phases of the peace deal.\nSince its founding, Hamas has carried out bombings, rocket attacks and shootings, killing civilians and soldiers in Israel.\nIsrael has carried out operations against Hamas in Gaza and its cells in East Jerusalem and the West Bank, killing its fighters. In such operations, Israel has killed many Palestinian civilians.\nThe two sides have also fought several major conflicts - in 2008-09, 2012 and 2014.\nThe last major conflict between the two sides was in May 2021, which ended in a ceasefire after 11 days.\nEvery round of fighting has seen people killed on both sides, the vast majority of them Palestinians in Gaza.\nThe Gaza Strip is a 41km (25-mile) long and 10km-wide territory between Israel, Egypt and the Mediterranean Sea.\nIt was part of a proposed Arab state under the original UN partition plan in 1947. Gaza was then occupied by Egypt in the war that followed Israel's creation, then captured by Israel during the 1967 Six-Day War.\nIsrael withdrew its troops and about 7,000 settlers from the territory in 2005, though the UN still considers the land to be occupied.\nGaza is one of the world's most densely populated places.\nJust over three-quarters of its population are registered refugees, or descendants of refugees, the UN says.\nEven before the latest war between Israel and Hamas, the territory had one of the highest unemployment rates in the world, with most of its population living below the poverty line and depending on food aid to survive.\nIsrael controls Gaza's airspace, its shoreline and the shared border, as well as the movement of people and goods.",
        "scraped_at": "2025-12-23T09:42:41.326190",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "BBC",
        "url": "https://bbc.com/news/world-middle-east-67480680",
        "title": "How Hamas built a force to attack Israel on 7 October",
        "publish_date": "2023-11-27T17:05:55.000Z",
        "author": "N/A",
        "content": "Five armed Palestinian groups joined Hamas in the deadly 7 October attack on Israel after training together in military-style exercises from 2020 onwards, BBC News analysis shows.\nThe groups carried out joint drills in Gaza which closely resembled the tactics used during the deadly assault - including at a site less than 1km (0.6 miles) from the barrier with Israel - and posted them on social media.\nThey practised hostage-taking, raiding compounds and breaching Israel's defences during these exercises, the last of which was held just 25 days before the attack.\nBBC Arabic and BBC Verify have collated evidence which shows how Hamas brought together Gaza's factions to hone their combat methods - and ultimately execute a raid into Israel which has plunged the region into war.\nOn 29 December 2020, Hamas's overall leader Ismail Haniyeh declared the first of four drills codenamed Strong Pillar a \"strong message and a sign of unity\" between Gaza's various armed factions.\nAs the most powerful of Gaza's armed groups, Hamas was the dominant force in a coalition which brought together 10 other Palestinian factions in a war games-style exercise overseen by a \"joint operation room\".\nThe structure was set up in 2018 to coordinate Gaza's armed factions under a central command.\nPrior to 2018, Hamas had formally coordinated with Palestinian Islamic Jihad (PIJ), Gaza's second largest armed faction and - like Hamas - a proscribed terrorist organisation in the UK and other countries.\nHamas had also fought alongside other groups in previous conflicts, but the 2020 drill was billed in propaganda as evidence a wider array of groups were being unified.\nHamas's leader said the first drill reflected the \"permanent readiness\" of the armed factions.\nThe 2020 exercise was the first of four joint drills held over three years, each of which was documented in polished videos posted on public social media channels.\nThe BBC has visually identified 10 groups, including PIJ, by their distinctive headbands and emblems training alongside Hamas during the Strong Pillar drills in footage posted on the messaging app Telegram.\nFollowing the 7 October attack, five of the groups went on to post videos claiming to show them taking part in the assault. Three others issued written statements on Telegram claiming to have participated.\nThe role of these groups has come into sharp focus as pressure builds on Hamas to find dozens of women and children believed to have been taken as captives from Israel into Gaza by other factions on 7 October.\nThree groups - PIJ, the Mujahideen Brigades and Al-Nasser Salah al-Deen Brigades - claim to have seized Israeli hostages, alongside Hamas, on that day.\nEfforts to extend the temporary truce in Gaza were said to be hinging on Hamas locating those hostages.\nWhile these groups are drawn from a broad ideological spectrum ranging from hard-line Islamist to relatively secular, all shared a willingness to use violence against Israel.\nHamas statements repeatedly stressed the theme of unity between Gaza's disparate armed groups. The group suggested they were equal partners in the joint drills, whilst it continued to play a leading role in the plans to attack Israel.\nFootage from the first drill shows masked commanders in a bunker appearing to conduct the exercise, and begins with a volley of rocket fire.\nIt cuts to heavily armed fighters overrunning a mocked-up tank marked with an Israeli flag, detaining a crew member and dragging him away as a prisoner, as well as raiding buildings.\nWe know from videos and harrowing witness statements that both tactics were used to capture soldiers and target civilians on 7 October, when around 1,200 people were killed and an estimated 240 hostages were taken.\nThe second Strong Pillar drill was held almost exactly one year later.\nAyman Nofal, a commander in the Izzedine al-Qassam Brigades - the official name for Hamas's armed wing - said the aim of the exercise on 26 December 2021 was to \"affirm the unity of the resistance factions\".\nHe said the drills would \"tell the enemy that the walls and engineering measures on the borders of Gaza will not protect them\".\nAnother Hamas statement said the \"joint military manoeuvres\" were designed to \"simulate the liberation of settlements near Gaza\" - which is how the group refers to Israeli communities.\nThe exercise was repeated on 28 December 2022, and propaganda images of fighters practising clearing buildings and overrunning tanks in what appears to be a replica of a military base were published to mark the event.\nThe exercises were reported on in Israel, so it's inconceivable they were not being closely monitored by the country's extensive intelligence agencies.\nThe Israel Defense Forces (IDF) have previously carried out air strikes to disrupt Hamas's training activities. In April 2023, they bombed the site used for the first Strong Pillar drill.\nWeeks before the attacks, female surveillance soldiers near the Gaza border reportedly warned of unusually high drone activity and that Hamas was training to take over observation posts with replicas of their positions.\nBut,according to reports in the Israeli media, they say they were ignored.\nBrigadier General Amir Avivi, a former IDF deputy commander in Gaza, told the BBC:  \"There was a lot of intelligence that they were doing this training - after all, the videos are public, and this was happening just hundreds of metres from the fence (with Israel).\"\nBut he said while the military knew about the drills, they \"didn't see what they were training for\".\nThe IDF said they \"eliminated\" Nofal on 17 October 2023, the first senior Hamas military leader to be killed during the conflict.\nHamas went to great lengths to make sure the drills were realistic.\nIn 2022, fighters practised storming a mock Israeli military base built just 2.6km (1.6 miles) from the Erez crossing, a route between Gaza and Israel controlled by the IDF.\nBBC Verify has pinpointed the site in the far north of Gaza, just 800m (0.5 miles) from the barrier, by matching geographic features seen in the training footage to aerial images of the area. As of November 2023, the site was still visible on Bing Maps.\nThe training camp was within 1.6km (1 mile) of an Israeli observation tower and an elevated observation box, elements in a security barrier Israel has spent hundreds of millions of dollars constructing.\nThe mock base is on land dug several metres below ground level, so it may not have been immediately visible to any nearby Israeli patrols - but the smoke rising from the explosions surely would have been, and the IDF is known to use aerial surveillance.\nHamas used this site to practise storming buildings, taking hostages at gunpoint and destroying security barriers.\nBBC Verify has used publicly available information - including satellite imagery - to locate 14 training sites at nine different locations across Gaza.\nThey even trained twice at a site less than 1.6 km (1 mile) from the United Nations' aid agency distribution centre, and which was visible in the background of an official video published by the agency in December 2022.\nOn 10 September 2023, the so-called joint committee room published images on its dedicated Telegram channel of men in military uniforms carrying out surveillance of military installations along the Gaza barrier.\nTwo days later, the fourth Strong Pillar military exercise was staged, and by 7 October, all the tactics that would be deployed in the unprecedented attack had been rehearsed.\nFighters were filmed riding in the same type of white Toyota pickup trucks which were seen roaming through southern Israel the following month.\nThe propaganda video shows gunmen raiding mock buildings and firing at dummy targets inside, as well as training to storm a beach using a boat and underwater divers. Israel has said it repelled attempted Hamas boat landings on its shores on 7 October.\nHowever, Hamas did not publicise its training with motorcycles and paragliders as part of the Strong Pillar propaganda.\nA training video posted by Hamas three days after 7 October shows fences and barriers being demolished to allow motorcycles to pass through, a tactic they used to reach communities in southern Israel. We have not identified similar earlier videos.\nFootage of fighters using paragliding equipment was also not published until the 7 October attack was under way.\nIn a training video shared on the day of the attack, gunmen are seen landing in a mock kibbutz at an airstrip we have located to a site north of Rafah in southern Gaza.\nBBC Verify established it was recorded some time before 25 August 2022, and was stored in a computer file titled Eagle Squadron, the name Hamas uses for its aerial division - suggesting the paragliders plan was in the works for over a year.\nBefore 7 October, Hamas was thought to have about 30,000 fighters in the Gaza Strip, according to reports quoting IDF commanders. It was also thought that Hamas could draw on several thousands of fighters from smaller groups.\nHamas is by far the most powerful of the Palestinian armed groups, even without the support of other factions - suggesting its interest in galvanising the factions was driven by an attempt to secure broad support within Gaza at least as much as bolstering its own numbers.\nThe IDF has previously estimated 1,500 fighters joined the 7 October raids. TheTimes of Israelreported earlier this month the IDF now believes the number was closer to 3,000.\nWhatever the true number, it means only a relatively small fraction of the total number of armed operatives in Gaza took part. It is not possible to verify precise numbers for how many fighters from smaller groups took part in the attack or the Strong Pillar drills.\nWhile Hamas was building cross-faction support in the build-up to the attack, Hisham Jaber, a former Brigadier General in the Lebanese army who is now a security analyst at the Middle East Centre for Studies and Research, said he believed only Hamas was aware of the ultimate plan, and it was \"probable [they] asked other factions to join on the day\".\nAndreas Krieg, a senior lecturer in security studies at Kings College London, told the BBC: \"While there was centralised planning, execution was de-centralised, with each squad operationalising the plan as they saw fit.\"\nHe said people inside Hamas were said to be surprised by the weakness of Israel's defences, and assessed militants had likely bypassed Israel's surveillance technology by communicating offline.\nHugh Lovatt, a Middle East analyst at the European Council on Foreign Relations, said Israel would have been aware of the joint training drills but \"reached the wrong conclusion\", assessing they amounted to the \"standard\" activity of paramilitary groups in the Palestinian territories, rather than being \"indicative of a looming large-scale attack\".\nAsked about the issues raised in this article, the Israel Defense Forces said it was \"currently focused on eliminating the threat from the terrorist organisation Hamas\" and questions about any potential failures \"will be looked into in a later stage\".\nIt could be several years until Israel formally reckons with whether it missed opportunities to prevent the 7 October massacre.\nThe ramifications for its military, intelligence services and government could be seismic.\nAdditional reporting by Paul Brown, Kumar Malhotra and Abdirahim Saeed. Video production by Soraya Auer.\nWhat do you want BBC Verify to investigate?",
        "scraped_at": "2025-12-23T09:42:47.154368",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "BBC",
        "url": "https://bbc.com/news/articles/c4gdx1rpel6o",
        "title": "Israel confirms Hamas handed over hostages' bodies as Palestinian prisoners released",
        "publish_date": "2025-02-27T12:39:05.198Z",
        "author": "N/A",
        "content": "Israel has completed forensic tests confirming the identities of four dead Israeli hostages whose bodies were handed over by Hamas in exchange for the release of Palestinian prisoners.\nOn Wednesday night, Hamas passed four coffins to the Red Cross from Gaza. Israel's prime minister confirmed on Thursday that they contained the remains of Shlomo Mansour, 86, Ohad Yahalomi, 50, Tsachi Idan, 50, and Itzik Elgarat, 69, and said all four men had been murdered.\nThe handover cleared the way for the delayed release of more than 600 Palestinian prisoners and detainees.\nIt was the last exchange of the six-week-long first phase of the Gaza ceasefire deal, leaving questions over what happens next.\nHamas has said it is ready to start delayed indirect negotiations on the second phase, which aims to end the war and secure the release of the remaining Israeli hostages.\nThe office of Israeli Prime Minister Benjamin Netanyahu - who faces pressures from his political allies to resume fighting and crush Hamas - said he had instructed negotiators to depart for Cairo on Thursday for talks.\nThe Israeli military launched a campaign to destroy the Palestinian armed group in response to its unprecedented attack on Israel on 7 October 2023, in which about 1,200 people were killed and 251 were taken hostage.\nAt least 48,365 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry.\nMost of Gaza's population of 2.1 million has been displaced multiple times. Almost 70% of buildings are estimated to be damaged or destroyed. The healthcare, water, sanitation, and hygiene systems have collapsed, and there are severe shortages of food, fuel, medicine, and shelter.\nHamas handed over the four men's bodies late on Wednesday night, with no public ceremony, unlike in previous exchanges during the current ceasefire.\nIsraeli authorities carried out initial forensic testing close to the Israel-Gaza border before transferring the remains to the Abu Kabir Institute of Forensic Medicine in Tel Aviv.\nIt came after the body of a Palestinian woman from Gaza was handed over by Hamas to Israel instead of the body of hostage Shiri Bibas last week, prompting fury in Israel. Hamas said it was a mistake and transferred Bibas's body the following day.\nFollowing the identification of the bodies received overnight, the Israeli prime minister's office announced that military officials had informed the Mansour, Yahalomi, Idan and Elgarat families that their loved ones \"were murdered and have been returned for burial in Israel\".\n\"Pursuant to the intelligence and all of the information at our disposal, Ohad Yahalomi, Tsachi Idan and Itzik Elgarat were murdered while held hostage in Gaza,\" it added.\n\"Shlomo Mansour was murdered in the 7 October 2023 massacre and his body had been held in the Gaza Strip.\"\nThere was no immediate response to the allegations from Hamas.\nTsachi Idan was taken by Hamas gunmen from his home in Nahal Oz, a kibbutz near the Gaza border on 7 October 2023. His eldest child, Maayan - who had just turned 18 - was shot and killed in front of her siblings and parents.\nHis family said that \"the unbearable journey to bring back our beloved and dear Tsachi from the inferno in Gaza has ended with the identification of his body\".\nItzik Elgarat was kidnapped from Nir Oz, another kibbutz, and reportedly shot in the hand during the attack.\nOhad Yahalomi, a French-Israeli dual national, was abducted from Nir Oz, along with his 12-year-old son, Eitan, who was released during a week-long ceasefire in November 2023.\nIraq-born Shlomo Mansour was killed by Hamas at Kibbutz Kissufim on 7 October 2023 and his body was taken to Gaza as a hostage.\nHis sister, Hadassah Lazar, told Israel's Channel 12 that \"we've reached an absurd situation where we take comfort in receiving a body to bury\". But, she added: \"The circle is not yet closed. We will continue fighting until the last hostage returns home.\"\nPresident Isaac Herzog said: \"Together with the entire nation, we share in the immense grief and sorrow of the bereaved families and [their] communities.\n\"The return of our brothers' bodies from captivity underscores our moral obligation to do everything in our power to bring back all the hostages - the living to their loving families, and the fallen to be late to rest.\"\nThe Hostages and Missing Families Forum, which represents the hostages' families, insisted that Ohad Yahalomi, Tsachi Idan and Itzik Elgarat could have returned alive if the Israeli government had agreed to the ceasefire deal sooner.\n\"[They] endured a prolonged period in Hamas captivity in Gaza. They should have returned alive; they could have been saved and brought back through an agreement.\"\nIt urged Israel's leaders to ensure the return of the 59 hostages remaining in captivity - 35 of whom are presumed dead - by the start of next week, warning that they \"have no time left\".\nNetanyahu promised Israeli authorities would \"act relentlessly until we bring everyone back\".\nFollowing the handover of the hostages' bodies, buses carrying Palestinian prisoners were seen leaving Ofer prison in the north of the occupied West Bank and then arriving in Ramallah, where a large crowd gathered to celebrate their release.\n\"We have been taken out of suffering as if we have been dug out from our own graves. No prisoner has had the experience of having their own release delayed twice,\" one of the prisoners, Yahya Shrida, told reporters.\n\"What we have been through is a situation that the mountains can't carry. It is very hard to explain.\"\nLater, dozens more Palestinians were seen getting off buses outside the European Gaza hospital in Khan Younis, southern Gaza.\nMany of them said they had endured harsh conditions while in detention.\n\"During the first period in jail, we were handcuffed and blindfolded for 90 days, you see no-one and no-one sees us. And we used to sit on our knees or on our buttocks for 18 or 20 hours,\" Eyad al-Saudi said.\nHe added: \"We left behind young detainees, and our joy will not be complete until the remaining detained prisoners are released from prison.\"\nThe Israeli military and prison service have previously said that detainees and prisoners are treated in accordance with the law.\nThe Palestinian Prisoners Media Office said a total of 642 Palestinians in Israeli jails were supposed to be released in the exchange.\nAmong them were 445 Gazans who were detained by Israeli forces without charge during the war and 46 women and children, it said. The 151 prisoners include dozens convicted of carrying out deadly attacks on Israelis who are being sent abroad.\nIsrael had delayed the releases since last Saturday in protest at what it said were \"Hamas's repeated violations, including the ceremonies that humiliate our hostages and the cynical exploitation of our hostages for propaganda purposes\".\nHamas said Israel's decision was a \"blatant\" violation and said indirect talks about further steps in the ceasefire deal were conditional on the prisoners being released.\nAfter days of impasse, Egyptian mediators secured the new exchange, with the Israeli prime minister's office saying the hostages' bodies would be handed over \"in an agreed-upon procedure and without Hamas ceremonies\".\nA Hamas official meanwhile said the handover would take place \"without public presence to prevent the occupation from finding any pretext for delay or obstruction\".\nIt remains unclear whether the truce will be extended or progress to a planned second phase, which would see the release of all remaining living hostages in Gaza in exchange for more Palestinian prisoners.\nIndirect negotiations for the second phase were due to start earlier this month but they have not yet got under way.\nHamas affirmed the group's \"full commitment to the ceasefire agreement\" on Thursday and its \"readiness to enter into negotiations for the second phase\".\nLater, the Israeli prime minister's office said he had \"instructed the negotiation delegation to depart for Cairo today to continue the talks\", without giving any details.\n\"Our delegation will go to Cairo and see whether we have a common ground to negotiate,\" Foreign Minister Gideon Saar told reporters.\n\"We said we are ready to make the framework longer in return to release more hostages. If it is possible we'll do that.\"",
        "scraped_at": "2025-12-23T09:42:51.601522",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "BBC",
        "url": "https://bbc.com/news/articles/cx2dklj3rxvo",
        "title": "Israel targets senior Hamas official in deadly Gaza strike",
        "publish_date": "2025-12-13T18:46:45.506Z",
        "author": "N/A",
        "content": "Israel said it killed a senior Hamas commander on Saturday in a strike on a vehicle inside Gaza.\nIn a joint statement, the Israeli military and security agency Shin Bet announced it had \"eliminated\" Raed Saad, the head of weapons production for Hamas's military wing, the Qassam Brigades, in Gaza city.\nSaad had been regarded as one of the most prominent Qassam commanders and led several brigades during Hamas's 7 October attacks on Israeli communities east of Gaza City.\nThe Hamas-run Civil Defence spokesman, Mahmoud Basal, told the BBC that four people were killed in the strike. He said multiple passers-by were also injured by the blast.\nA local Hamas official in Gaza told the BBC that the strike also killed Saad's aide and another lower-ranking official identified as Abu Imad al-Laban.\nThe BBC is prevented by Israel from reporting independently from inside Gaza and is unable to verify details of the incident.\nThe IDF and ISA joint statement added that Saad had been \"responsible for the deaths of many soldiers\" killed in the Gaza Strip as the result of explosive devices.\nSaad is believed to be a member of the newly formed five-member leadership military council established since a ceasefire took hold in October.\nIsrael has attempted to kill him on multiple occasions.\nOne of the most notable attempts was during a surprise Israeli operation in Gaza City in March 2024, when Israeli forces reportedly sought to arrest or kill him. Sources at the time said Saad had been inside the targeted complex but managed to escape moments before the raid.\nHe has long been considered one of Israel's most wanted Hamas figures, with Israeli attempts to kill him spanning more than two decades.\nSaturday's attack happened on the Palestinian-controlled side of the so-called Yellow Line which has divided Gaza since an unstable US-led ceasefire came into effect on 10 October.\nIsraeli forces control the area to the east of the line, which includes just over half of the Gaza Strip.\nThe first phase of US president Donald Trump's 20-point plan for peace in the region required the return of all 20 living and 28 dead hostages taken in the Hamas-led attack on southern Israel on 7 October 2023.\nAbout 1,200 people were killed in the attack and more than 250 people were taken hostage.\nAll have been returned except for the remains of an Israeli police officer, Ran Gvili, 24, who is believed to have been killed while fighting Hamas gunmen in Kibbutz Alumim.\nSince then, according to Gaza's Hamas-run health ministry more than 70,000 Palestinians have been killed by Israeli military action.\nThe diplomatic focus is now shifting to the next stage of President Trump's plan which would require the disarmament of Hamas as part of what it calls the de-radicalisation and redevelopment of Gaza.\nIt envisages Gaza being run by the \"temporary transitional governance of a technocratic, apolitical Palestinian committee,\" overseen by a \"Board of Peace\" chaired by Trump.\nSecurity would be provided by an International Stabilisation Force although its make up remains unclear.\nThe eventual aim is for a reformed Palestinian Authority to take control of the territory, and for Israeli forces to withdraw, after which \"the conditions may finally be in place for a credible pathway to Palestinian self-determination and statehood\".\nMany aspects of the plan are controversial in Israel where prime minister Benjamin Netanyahu has repeatedly rejected calls for the establishment of a Palestinian state.\nTrump is due to meet Netanyahu to discuss the plan in the US on 29 December.",
        "scraped_at": "2025-12-23T09:42:55.541103",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Autre",
        "url": "https://www.cnn.com/2023/12/21/middleeast/palestinians-back-hamas-survey-intl-cmd",
        "title": "Palestinians support Hamas decision to go to war with Israel, survey suggests, with no political solution on horizon",
        "publish_date": "N/A",
        "author": "N/A",
        "content": "If Ramallah has a center, it is Al-Manara Square. Six roads meet here, and pedestrians weave their way confidently across the tight roundabout, forcing cars to make way. It is always busy.\nDemonstrators will rally here to protest, but when CNN visited on a Sunday morning, people were going about their business. All the same, photos from the war inGazaposted in the square and hung on banners and fences remind anyone who needs reminding of the horrors unfolding not far away.\n“This destruction resembles the conscience of the world,” reads one poster, under a picture of rescue workers clearing rubble.\nAnother photograph shows ambulances outside a hospital with the text, “Medical Heroes demand action: Stop the Massacre in Gaza!”\nAt his office about a mile away, where desks and shelves groan under piles of paperwork, Khalil Shikaki is thinking about the conflict.\nPalestinians, he says, overwhelmingly support the Hamas decision to go to war with Israel.\nNetanyahu’s mission: Destroy Hamas, bring hostages home – and get reelected\nHis research company, the Palestinian Center for Policy and Survey Research (PCPSR), has just published the findings of its latest survey into Palestinian attitudes.\nSeven hundred and fifty adults were interviewed face to face in the West Bank, and 481 were interviewed in Gaza, also in person. The Gaza data collection was done during the recent truce, when it was safer for researchers to move about.\nThe survey, which has a four-point margin of error (rather than the usual three-point), found that almost three-quarters (72%) of all respondents believe Hamas’s decision to launch its attack on Israel on October 7 was “correct.”\nLess than a quarter (22%) said it was “incorrect.”\nBut that doesn’t mean support for atrocities, he adds. “No one should see this as support for any atrocities that might have been committed by Hamas on that day.”\n“Palestinians believe that diplomacy and negotiations are not an option available to them, that only violence and armed struggle is the means to end the siege and blockade over Gaza, and in general to end the Israeli occupation,” Shikaki said.\nThis important distinction is teased out by three of the poll’s data points. Almost 80% of respondents told PCPSR researchers that killing women and children in their homes is a war crime.\nAn even higher number (85%) of respondents said they had not watched videos shown by international news outlets of acts committed by Hamas on October 7 – a figure which may hint at why only 10% of those surveyed said they believed Hamas had committed war crimes that day.\nTo a considerable extent, Palestinians, just like Israelis, are getting a skewed perspective from their media. In addition to this bubble effect, Shikaki says, there might also be a desire to avoid other sources to maintain deniability. Denial, as he says, is useful during periods of stress and pain.\nPolling in a war zone comes with difficulties even in the lulls. Interviewing people in the center and south of the enclave was relatively straightforward as most were still at home, but surveying people from the north of Gaza was partially compromised because so many had been displaced to shelters.\nGaza and the West Bank, what are now called the Palestinian territories, have been geographically separated since 1948. Recent decades have seen that separation take root between the two populations, not least because it has become harder and harder for Palestinians to move between the territories.\nSince 2005, when Israel moved its soldiers and settlers out of Gaza and essentially sealed off the territory with help from Egypt, the day-to-day experiences of Palestinians in Gaza have diverged even further from those ofPalestinians in the West Bank.\nPolitically, the territories are split. The Palestinian Authority under aging President Mahmoud Abbas has partial control over the West Bank, while Hamas controls what goes on inside Gaza – or it did until Israel invaded.\nThese differences are reflected across the attitudes surveyed, in particular, on the use of violence.\nIn Gaza, support for armed struggle has risen only slightly from 50% in September 2022 (a year before the current war) to 56% in December 2023. In the West Bank, however, support has been rising dramatically from 35% in September 2022 to 54% in September 2023 (a month before the war). This month, polled support for armed struggle reached 68% in the West Bank.\nShikaki says these divergences reflect the rise in attacks by violent Jewish settlers on Palestinians in the West Bank, which have drawn condemnation from the US and Europe, along with the pervasive sense that Israel’s current hard-right government is not overly perturbed by that state of affairs.\nRelease of Palestinian prisoners sheds light on controversial Israeli justice system in the occupied West Bank\nHamas, unsurprisingly perhaps, finds growing support, especially among West Bank Palestinians. Backing for the militant group as a political party has increased there nearly four-fold (from 12% to 44%) in the three months between September 2023 and December 2023.\nIn besieged Gaza, by contrast, support has remained relatively stable with 38% support in September and 42% in December.\nFatah, the secular-nationalist party of Palestinian Authority (PA) President Abbas, which led the Palestine Liberation Organization to its historic agreements with Israel in the 1990s — which created the PA but crucially did not get around to solving some of the conflict’s most fundamental issues — has seen its support fall across the territories from 26% three months ago to 17% now.\nSupport for Abbas himself is even lower – so low, in fact, that he is seen as almost entirely discredited.\nBut Shikaki cautions that higher support for Hamas should not be over-stated, at least not yet. As more Palestinians come to terms with the atrocities committed by Hamas on October 7, so attitudes could change — though that is unlikely to be the case so long as Gaza remains under massive attack.\nImportant again is how many people have watched videos from October 7 and the differences between the territories. In Gaza, 25% of those asked said they had viewed such videos; and 16% of all respondents told researchers Hamas had committed war crimes. In the West Bank, the corresponding numbers were just 7% and 1%.\nGaza is moving out of denial more quickly than the West Bank, Shikaki says, and that means a reckoning for Hamas. Already, only 38% of Gazans want to see the militant group return to governance after the war.\nBut it is not just greater awareness of events on a single day that matter. It is also what happens when politics resumes when the war is over, and whether Palestinians see any sort of political horizon.\nAt a time when people believe the only way to get Israel to end the occupation is by inflicting pain and suffering on Israelis, Palestinians see Hamas as the party most capable of delivering violence effectively, Shikaki says.\nOn the other hand, “if and when you give the Palestinians the option of negotiating a permanent end to Israeli occupation and the creation of a Palestinian state … support for Hamas will probably decline to below where it was before the war,” he says.\nSupport for the two-state solution has remained largely stable across Gaza and the West Bank over the past three months, moving from 32% to 34%, but historically, those figures are still low. In the past, PCPSR polling has shown support for the existence of an independent Palestine sitting next to the state of Israel at between 70% and 80%.\nUS President Joe Biden has sought to convince both Israelis and the Palestinians that ﻿he sees negotiations as important, saying last month, “I don’t think (the conflict) ultimately ends until there is a two-state solution.” The problem is, Palestinians do not seem to believe him. Nearly three-quarters (70%) of respondents said they do not regard US talk about Palestinian statehood as serious.\nShikaki says it is obvious why this is so.\n“Since you have all that power, people are not going to believe you if you say, well, I can’t use leverage against Israel. So, the conclusion is you are paying lip service to the two-state solution, but you have absolutely no intention of doing anything to make it a reality.”\nScan the QR code to download the CNN app on Google Play.\nScan the QR code to download the CNN app from the Apple Store.",
        "scraped_at": "2025-12-23T09:43:13.039379",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/politics/ex-hamas-hostage-freed-after-505-days-gaza-tunnels-warns-evil-spreading-across-world",
        "title": "Ex-Hamas hostage freed after 505 days in Gaza tunnels warns 'evil is spreading' across the world",
        "publish_date": "December 19, 2025 2:48pm EST",
        "author": "ByEmma ColtonFox News",
        "content": "Hamas hostage survivor Omer Shem Tov spoke with Fox News Digital ahead of his speech at Turning Point USA's AmericaFest in Arizona.\nOmer Shem Tov spent 505 days in Hamas captivity after he was captured at the Nova Music Festival in Israel on Oct. 7, 2023, living in the terrorist group's elaborate tunnel system under the Gaza Strip before PresidentDonald Trumpassisted in his release.\nNow, the Israeli is a free man and delivered a speech at Turning Point USA's AmericaFest in Arizona, championing his message that the war in Israel is a war of good versus evil that is spreading across the world. The event has drawn widespread attention and support among conservatives following the tragic September assassination of its founder,Charlie Kirk.\n\"This fight is between good and evil. A fight against terrorists will turn hospitals into torture chambers, schools into military bases,\" he said. \"Who starve their own people. Who murder young people at a music festival. Who kill Jews because they are Jewish, and Christians because they are Christian. This evil is spreading.\"\nShem Tov spoke to Fox Digital in a Zoom interview ahead of his speech, previewing that it would underscore that the war in Israel is a growing war on Western civilization overall, pointing to horrific attacks such as the fatal National Guard shooting in November in Washington, D.C. He also recounted his 505 days in Hamas captivity in the reflective interview and eventual release in February under the Trump administration.\nTRUMP'S ELECTION WIN FILLED HAMAS WITH 'FEAR,' HOSTAGE HELD LIKE 'SLAVE' FOR 505 DAYS RECOUNTS\nOmer Shem Tov spoke to AmFest on Dec. 19 after 505 days in Hamas captivity.(Fox News Digital )\n\"As soon as Trump was elected, I saw the fear in their eyes,\" Shem Tov said of Hamas following the U.S. election in November 2024. \"They knew that everything on ground is gonna change, that something else is gonna happen, and they were scared. They were very scared.\"\nShem Tov said that for roughly the last five months of his captivity, he lived in Hamas’ tunnel system beneath the Gaza Strip, where he was worked mercilessly.\n\"I was digging for them, and I was cleaning for them, and I was moving around bombs from place to places, and (carrying) food. I can tell you, just so you know, crazy amounts of food. Amounts of food that I've never seen before,\" he recounted.\nOmer Shem Tov traveled to Arizona on Friday to deliver a speech at TPUSA's AmFest.(Fox News Digital )\nShem Tov learned about the American presidential election from his Hamas captors, who watched Al Jazeera on a TV kept in the tunnels. He said he overheard the terrorists discussing the election and \"how they want Kamala to win.\"\nAMERICAN-ISRAELI HELD HOSTAGE IN GAZA FOR OVER 580 DAYS SENDS MESSAGE TO HAMAS: 'I’LL GIVE YOU HELL'\nOnce the election was decided, Shem Tov said, the terrorists changed the way they treated him, even offering him more food. He said he mostly survived on small biscuits throughout his captivity, despite Hamas controlling large amounts of food.\nHamas terrorists marching in Gaza during a parade.(Getty Images)\n\"Thank you, President Donald Trump, for our freedom,\" Shem Tov said as the crowds began breaking out into chants of \"USA.\" \"He fought for us. He brought us home.\"\nShem Tov told the crowds Friday in his speech that he had not prayed or spoken to God much before his capture.\n\"Alone in the darkness, I began to pray,\" he said, receiving praise from the crowd. \"Every day, I spoke to Him. I whispered, ‘God, how are You? How was your day? Are you okay?\" he said.  \"And in that darkness, I felt His presence. I thanked Him for everything. I thanked Him for everything. For the food, even when there was almost none. For the water, even when it was salty. For my life, even though it was in danger every single day.\"\nOmer Shem Tov spoke with Fox News Digital, recounting his 505 days in Hamas captivity before his February release.(Amir Levy/Getty Images)\nThe 23-year-old told Fox Digital that the assassination of Kirk on Sept. 10 left him \"completely shocked\" even after experiencing his own horrors for months in Gaza.\nIDF ANNOUNCES TRANSFER OF DECEASED ISRAELI HOSTAGE REMAINS THROUGH RED CROSS\n\"I couldn't believe it at first, but ever since I got out of captivity, I noticed Charlie's work and what he's done for us. And it's just, it's amazing to see someone who is not Jewish, yeah he is a Christian and is American, is not related toIsraelin in any way possible, and he's just is so supportive of us,\" he said.\nA tribute to Charlie Kirk is shown on the Jumbotron before a NASCAR Cup Series auto race, Saturday, Sept. 13, 2025, in Bristol, Tennessee.(Wade Payne/AP)\n\"But then it reminds me what we're fighting for. It reminds me that, there is extremists … we just have to stand in front of them and and just fight for everything we've got,\" he continued.\nShem Tov said that he hopes his TPUSA speech and ongoing advocacy for Israel following his captivity leaves readers and listeners with the message that he and others are fighting on behalf of Western civilization in the face of terrorism.\nHe reflected on that message in his speech, pointing to the terror attack on a Hanukkah celebration in Australia that killed 15 and injured dozens of others, as well as the National Guard shooting in D.C. ahead of Thanksgiving that killed one and injured another.\nEX-HAMAS HOSTAGE EMILY DAMARI RECOUNTS 471 DAYS OF SURVIVAL IN GAZA: ‘EVERYONE NEEDS TO KNOW WHAT HAPPENED’\n\"We have seen these same radical terrorists commit violence in Israel, in Europe, in Australia, and even here in the United States, including the recent attack in Washington, D.C., where two National Guardsmen were shot. This is the evil we are fighting. This is not a distant conflict,\" he said.\n\"And that is whyTurning Point USAmatters. Because you see the truth. And you stand for freedom,\" he told the crowds.\nOmer Shem Tov was held in Hamas captivity for 505 days before his release in February 2025.(Fox News Digital )\nShem Tov underscored his support of Trump in his interview with Fox News Digital, explaining that he did not know much about Trump and stayed out of politics ahead of his capture beyond that he was a supporter of Israel.\n\"I always knew that Trump was a big supporter of Israel. And for us as Israelis, you know, we … love Trump,\" he said. \"He supports us, he's he's a great man, I think. I I also met him nine days after I was released, like I've said, and and I can truly say that he's he's an amazing person. He really, really cared about us.\"\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\n\"I personally told him that me and my family, and I would say all of Israel, believe that he was sent by God to release those hostages and to help Israel,\" Shem Tov recounted of what he told Trump during his meeting in February. \"And he made that promise. He made that promise, he said that he will bring back all the hostages.\"\nAll hostages have been released except for the remains of slain police officer Ran Gvili. There were 168 hostages who survived in Gaza, and 83 who died. Israel released some 2,000 prisoners in October as part of a hostage exchange deal with Hamas to secure peace in the region.",
        "scraped_at": "2025-12-23T09:43:17.845190",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/taking-out-hamas-million-dollar-root-tunnel-game-changer-analyst-says",
        "title": "Taking out Hamas' million-dollar 'root' tunnel is game changer, analyst says",
        "publish_date": "November 23, 2025 7:52pm EST",
        "author": "ByEmma BusseyFox News",
        "content": "Israel Defense Forces uncover an elaborate tunnel in the Hamas stronghold of Khan Younis. (Credit: IDF via APTN)\nTheIsraeli Defense Forces(IDF) released a video showing what it describes as one of Hamas’s \"most complex\" underground infrastructures extending beneath the southern Gaza city of Rafah.\nAccording to the IDF, the seven-kilometer-long \"root tunnel\" runs roughly 25 meters underground, contains about 80 rooms and was used for command operations, weapons storage and sheltering Hamas operatives.\nThe video shared on X on Nov. 20 travels through reinforced concrete passageways and large chambers, showing the sophistication and scale ofHamas’s underground network.\nThe Israeli military claims the tunnel originated beneath a United Nations Relief and Works Agency (UNRWA) compound and stretched beneath civilian sites.\nISRAEL'S DOHA STRIKE SENT A DECISIVE MESSAGE THAT TERROR WILL FIND NO SAFE HAVEN\n\"IDF troops uncovered one of Gaza’s largest and most complex underground routes, over 7 km long, ~25 meters deep, with ~80 hideouts, where abducted IDF officer Lt. Hadar Goldin was held,\" the post read.\nIsraeli analysts say the demolition of this tunnel marks a strategic blow to Hamas and \"paves the path to its defeat.\"\n\"The destruction of this tunnel as well as many others like it or similar… as well as other terror facilities pushes Hamas to the edge,\" said Professor Kobi Michael, senior researcher at the Institute for National Security Studies (INSS) and the Misgav Institute.\nIDF HOLDS MEMORIAL CEREMONY AT BASE ATTACKED BY HAMAS ON OCT. 7 HONORING FALLEN TROOPS\nThe IDF uncovered one of Gaza's largest underground Hamas infrastructures, stretching 25 meters deep beneath civilian sites, including mosques and schools in Rafah.\n\"It is one of the longest and [most] complicated tunnels that have been discovered, but it is not the only one,\" he told Fox News Digital.\nMichael explained thatHamas’ root tunnelsform the backbone of its underground warfare system.\n\"This is an example of a root tunnel, a strategic one that feeds many tactic tunnels and is used for strategic purposes [such] as command and control, weapon storage, manufacturing platforms of weapon[s] and strategic logistics,\" he said.\nISRAEL SET TO LAUNCH GAZA CITY OFFENSIVE: HIGH STAKES, HIGH COSTS AHEAD\nSmoke rises from Gaza City seen from Deir al-Balah, following intense Israeli military attacks on northern Gaza, on Oct. 5, 2025.(Khames Alrefi/Getty Images)\n\"Such a tunnel is usually manned by hundreds of militants and commanders.\"\nThe IDF believes this particular tunnel network may have been connected to the area whereLt. Hadar Goldin, an Israeli soldier abducted during the 2014 Gaza war, was held captive. Hamas returned Goldin’s remains earlier this month – after more than a decade.\nThe tunnel’s exposure sheds new light on the extent of its underground operations.\nISRAEL’S COVERT CAMPAIGN TARGETS HAMAS TERRORISTS BEHIND OCT 7 MASSACRE\nIsraeli forces destroyed a major Hamas tunnel system in Rafah connected to the area where Lt. Hadar Goldin was held, marking a strategic blow to the militant group's capabilities.\n\"I have no idea about the cost but if you take into consideration the amount of the building materials, labor and facilities and its length, it is a matter of millions of INS,\" he claimed. \"Hamas chose routes under sensitive civilian and humanitarian facilities in order to prevent the IDF from attacking the tunnel.\"\nAsIsrael continues operations in Gaza, the destruction of Hamas’s tunnel networks remains central to its strategy to dismantle the group’s military capabilities and prevent future attacks.\nIn 2014, Israeli Prime Minister Benjamin Netanyahu said he wanted to destroy the tunnels, whichHamas militantsused to infiltrate Israeli territory, \"with or without a ceasefire.\"\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\nAccording to a 2023 investigation by Reuters, Hamas had said it had been using the tunnels to hide hostages seized in its Oct. 7 attack on Israel.\nIsrael’s military said its ground forces had uncovered around 1,500 Hamas tunnels and shafts throughout the Gaza Strip, perthe report.\nEmma Bussey is a breaking news writer for Fox News Digital. Before joining Fox, she worked at The Telegraph with the U.S. overnight team, across desks including foreign, politics, news, sport and culture.",
        "scraped_at": "2025-12-23T09:43:23.788594",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/hamas-hardens-stance-ceasefire-talks-netanyahu-recalls-negotiation-team",
        "title": "Hamas 'hardens' stance in ceasefire talks as Netanyahu recalls negotiation team",
        "publish_date": "July 24, 2025 1:07pm EDT",
        "author": "ByEfrat LachterFox News",
        "content": "Israeli Ambassador to the U.N. Danny Danon discusses the number of Palestinians killed trying to seek aid and efforts to bring back Israeli hostages on 'Fox News @ Night.'\nCeasefire negotiationsbetween Israel and the Hamas terrorist organization hit a setback Thursday, as Prime Minister Benjamin Netanyahu recalled Israel’s negotiating delegation from Doha following what officials described as a hardening of Hamas’ demands.\n\"In light of the response Hamas delivered this morning, it has been decided to recall the negotiating team for further consultations in Israel,\" the Prime Minister’s Office said in a statement. \"We appreciate the efforts of the mediators, Qatar and Egypt, and the efforts of envoy Steve Witkoff to achieve a breakthrough in the talks.\"\nAccording to reports in Israeli media, the terror group is now demanding the release of 200 Palestinians serving life sentences for murdering Israelis, and an additional 2,000 Palestinians detained in Gaza after Oct. 7. That demand significantly exceeds the previous mediator-backed framework – reportedly accepted byIsrael– which included the release of 125 life-term prisoners and 1,200 other detainees.\nHUCKABEE HITS BACK AT WESTERN COUNTRIES THAT 'SIDE’ WITH TERROR GROUP HAMAS\nPalestinians carry aid supplies from the U.S.-backed Gaza Humanitarian Foundation, in Khan Younis, in the southern Gaza Strip, May 29, 2025.(Reuters/Hatem Khaled)\nWitkoff announced on X that his team is returning from Doha \"for consultations after the latest response from Hamas, which clearly shows a lack of desire to reach a ceasefire in Gaza.\"\nHe praised the mediators’ efforts but said, \"Hamas does not appear to be coordinated or acting in good faith.\" Witkoff added, \"We will now consider alternative options to bring the hostages home and try to create a more stable environment for the people of Gaza,\" calling it \"a shame that Hamas has acted in this selfish way.\"\n\"The return of the delegation is not a collapse or a crisis, but the gaps are significant and present across all core issues,\" a senior Israeli official told Channel 12. Another official confirmed to U.S. Middle East envoy Steve Witkoff that Hamas’ updated prisoner exchange terms are \"unacceptable.\"\nA joint statement by 25 countries condemning Israel’s conduct in Gaza may have further complicated already fragile ceasefire negotiations, Israeli officials suggested. In response to the condemnation, Israel’s Foreign Ministry issued a sharply worded statement, warning, \"At these sensitive moments in the ongoing negotiations, it is better to avoid statements of this kind.\n\"Israel rejects the joint statement published by a group of countries, as it is disconnected from reality and sends the wrong message to Hamas.\" The ministry added that \"all statements and all claims should be directed at the only party responsible for the lack of a deal for the release of hostages and a ceasefire: Hamas, which started this war and is prolonging it.\"\nHostage familiesexpressed deep concern about the breakdown in negotiations. \"The families are watching with concern as reports emerge about the negotiating team’s return,\" the Hostages and Missing Families Forum said in a statement. \"Every day that passes endangers the hostages’ chances of recovery and the ability to locate the dead. Another missed opportunity to bring everyone home would be unforgivable – a moral, security, and diplomatic failure.\"\nThe negotiations, which have dragged on for weeks, are part of a proposed U.S.-backed deal involving a 60-day ceasefire in exchange for the release of some 50 remaining Israeli hostages, a phased release of Palestinian prisoners and expanded humanitarian aid to Gaza.\nHamas terrorists take up positions ahead of a hostage release in Deir al-Balah, central Gaza Strip, Feb. 8, 2025.(AP)\nHamas is also demanding that Israeli troops withdraw to positions held before March 2, when the last ceasefire collapsed, and that the Rafah crossing between Gaza and Egypt reopen in both directions. The group further opposes the newly established U.S.-backed Gaza Humanitarian Fund, demanding that aid distribution return to the previous U.N.-supervised mechanism.\nRelatives and supporters of Israeli hostages held captive in the Gaza Strip since the Oct. 7 attack in southern Israel hold their portraits at Hostages Square in Tel Aviv on May 28, 2025, to mark 600 days of their captivity and demand their release and an end to the war.(Ahmad Gharabli/AFP via Getty Images)\nA Hamas official told Reuters the group is insisting on a return to a Jan. 19 protocol for aid entry, and that ceasefire negotiations must include a clause preventing Israel from resuming military operations after the 60-day truce – even if a broader deal is not reached.\nAt the center of the deadlock is the growing humanitarian crisis. The U.N. and international aid groups warn that hundreds of thousands of people in Gaza face severe food insecurity. It is claimed that civilians in the north have been forced to survive on animal feed and foraged plants, while chaotic aid distributions in the south have repeatedly turned deadly.\nLt. Gen. Eyal Zamir, the chief of the General Staff, conducts a field tour in the Rafah area of the Gaza Strip.(IDF)\nISRAEL ACCEPTS TRUMP-LED CEASEFIRE PLAN THAT COULD END GAZA WAR WITHIN 60 DAYS\nIn response to mounting pressure, Israel is visibly increasing the pace of aid deliveries. On Thursday, COGAT (Coordinator of Government Activities in the Territories) reported that 70 aid trucks were transferred into Gaza on Wednesday through the Zikim and Kerem Shalom crossings. The shipments, primarily food, were delivered under IDF coordination withthe U.N.and humanitarian organizations.\nCOGAT said more than 150 trucks were collected inside Gaza, but warned that over 800 trucks remain uncollected at the crossings due to logistical breakdowns on the Palestinian side.\nThe Gaza Humanitarian Foundation (GHF) statedon Xthat it offered on Wednesday to deliver the U.N.’s tons of aid sitting in Gaza for free. John Acree, GHF’s interim director, said, \"We’ve seen aid by the U.N. and other organization(s) being piled near the borders but not being delivered.\"\nPrime Minister Netanyahu meets with Steve Witkoff, special envoy to the Middle East.(Prime Minister's Media Adviser)\nIsraeli journalist Nadav Eyalreported Thursdaythat senior defense officials say they’ve been instructed by the political echelon to \"greatly speed up the entry of humanitarian aid into Gaza\" and to \"be less concerned with precautions or plans to keep it out of Hamas’ hands.\"\nCLICK HERE TO GET THE FOX NEWS APP\nAs talks stall and military activity resumes, Israeli officials warn that the window for a deal may be closing. \"There are still significant gaps,\" one source told Channel 12. \"The negotiations are not over – but time is running out.\"\nEfrat Lachter is an investigative reporter and war correspondent. Her work has taken her to 40 countries, including Ukraine, Russia, Iraq, Syria, Sudan and Afghanistan. She is a recipient of the 2024 Knight-Wallace Fellowship for Journalism. Lachter can be followed on X @efratlachter.",
        "scraped_at": "2025-12-23T09:43:27.917484",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/former-hamas-hostage-warned-australian-leaders-about-dangers-antisemitism-months-before-bondi-beach-attack",
        "title": "Former Hamas hostage warned Australian leaders about dangers of antisemitism months before Bondi Beach attack",
        "publish_date": "December 20, 2025 8:16am EST",
        "author": "ByRachel Wolf,Ronn BlitzerFox News",
        "content": "Eli Sharabi, who spent 491 days as a hostage in Gaza, said he warned Australian officials to speak out against antisemitism months before the deadly shooting during a Hanukkah event at Bondi Beach.\nA former Hamas hostage told Fox News Digital that he had warnedAustralian leadersto take antisemitism more seriously months before the deadly shooting at Bondi Beach.\nEli Sharabi, who spent 491 days as a hostage in Gaza, said the attack on Bondi Beach was \"crazy,\" but far from unpredictable. Sharabi told Fox News Digital that while in Australia in June, he met with Deputy Prime Minister Richard Marles and Foreign Minister Penny Wong and warned them thatrising antisemitismwould lead to something worse.\nFox News Digital sat down with Sharabi prior to an appearance he made at an event held in support of Magen David Adom, Israel's emergency response organization, in Miami Beach, Fla. During the conversation, Sharabi recalled telling the Australian officials that ahate crimewould take place, and that he would \"see the fears\" of Jewish people walking on the streets. He urged them to speak out against antisemitism before it was too late.\n\"When it happens, a hate crime here, it will be your responsibility, because you have to have a stronger voice against antisemitism,\" Sharabi recalled telling them.\nRABBI KILLED IN SYDNEY HANUKKAH ATTACK HAD WARNED AUSTRALIAN PM ABOUT RISING ANTISEMITISM\nRabbi Yossi Friedman speaks to people gathering at a flower memorial by the Bondi Pavilion at Bondi Beach on Tuesday, Dec. 16, 2025, following a shooting in Sydney, Australia.(Mark Baker/AP Photo)\n\"Unfortunately, it happened. And that's crazy, it's crazy. Really, I'm so sorry for that,\" he said.\nA spokesperson for Wong said that she \"deeply appreciated her meeting with Eli Sharabi and thanks him for sharing his insights and experiences.\"\n\"Minister Wong has consistently condemned antisemitism and antisemitic attacks,\" the spokesperson said. \"In response to the horrific antisemitic terror attack at Bondi, we are further strengthening laws against those who spread antisemitism and online abuse, ensuring our education system properly responds to antisemitism, and lowering the threshold to cancel visas for those who come to Australia to spread antisemitism.\"\nThe spokesperson also conveyed Wong's sympathies to the loved ones of the Bondi Beach shooting victims.\nFox News Digital reached out to Marles' office for comment.\nSharabi told Fox News Digital that theattack on a Hanukkah celebrationat Bondi Beach that left at least 15 dead and dozens wounded reminded him of the persecution of European Jews in the 1940s.\n\"Suddenly you feel like it's the 1940s again, and we are in 2025, 90 years later, all these things are happening again,\" Sharabi said.\nAUSTRALIA ANTI-TERROR POLICE DETAIN 7 MEN AS COUNTRY LAYS YOUNGEST BONDI BEACH VICTIM TO REST\nA member of the Jewish community reacts as he walks with police toward the scene of a shooting at Bondi Beach in Sydney on Dec. 14, 2025.(David Gray/AFP via Getty Images)\nOn Feb. 8, 2025, Sharabi was released from Hamas captivity, 491 days after he was taken hostage from Kibbutz Be'eri during the Oct. 7, 2023, massacre. He did not know until after he was freed that his wife, Lianne, and their daughters, Noiya and Yahel, had been killed when Hamas terrorists attacked Israel.\nSince his release, Sharabi has traveled the world speaking to Jewish communities, world leaders and various audiences about his experience as a hostage, something he recounted in his book, \"Hostage,\" which has been translated into multiple languages.\nIsraeli hostages Or Levy, Eli Sharabi and Ohad Ben Ami were handed over to the International Committee of the Red Cross by Hamas under a ceasefire and prisoner exchange agreement with Israel, in Deir al Balah, Gaza, on Feb. 8, 2025.(Ashraf Amra/Anadolu via Getty Images)\nAfter he was released, he learned that while he was in the hands of terrorists, there were people around the world praying for him and demanding he and the other hostages be freed.\nHe said that while he was in the hospital in the days following his release, he was slowly exposed to the work that people in Israel and around the world did to advocate for him and the other hostages. It started with revelations about his family and friends, then his realization that people in Israel and around the world also took part in the fight for his release.\nHe soon joined the fight, advocating for the release of all hostages, including Alon Ohel, someone who Sharabi bonded with during his time in captivity.\n\"It was an amazing feeling to see him released. He's like my son,\" Sharabi told Fox News Digital.\nSharabi said that he and Ohel have seen each other a few times as free men and that they try to speak every day.\nEli Sharabi, who spent 491 days in Hamas captivity, and whose wife and two daughters were killed by terrorists, speaks at the United Nations.(Lev Radin/Pacific Press/LightRocket via Getty Images)\nOPINION: AUSTRALIA’S HANUKKAH MASSACRE: THE HORROR OF BEING PROVEN RIGHT\nSharabi told Fox News Digital about his life after captivity. Now a free man for nearly a year, he said he appreciates every moment.\n\"First of all, I'm alive. Second, I'm free, and I've learned that freedom is priceless,\" he said. \"Every morning I wake up, I say thank you very much for what I have and for my freedom, and I can be able to choose whatever I do that day and not to ask permission from anyone to eat or drink or speak,\" he told Fox News Digital. \"I'm happy with my life. The memory of my wife, my daughters and my brother will be with me until my last day.\"\nFormer Hamas hostage Eli Sharabi and Israeli U.N. Ambassador Danny Danon hold a photo of Sharabi's family that shows his wife and daughters, all three of whom were murdered on Oct. 7, 2023.(Perry Bindelglass/Israeli U.N. Mission)\nSharabi told Fox News Digital that while in captivity, he promised himself that he would move his family to London, where they could live a peaceful life. He said that he made the decision because of the fear he saw in his daughters' eyes on Oct. 7.\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\nWhile his plans on relocating to London have changed, Sharabi envisions himself living a quiet life and focusing on his own healing once the body of Ran Gvili, the last remaining hostage in Gaza, is returned to Israel. However, Sharabi said that he cannot go back to Kibbutz Be'eri and that he will likely seek a fresh start a bit further north in central Israel.\n\"I can't go back to Be'eri. It's something I need to solve with myself and with my therapist, of course. How can I get into my house again? For me, living in Be'eri, it's not an option. In every corner, I can see the tragedy,\" Sharabi said. \"I need a new place, a new restart for my life, so it cannot be in Be'eri.\"\nRachel Wolf is a breaking news writer for Fox News Digital and FOX Business.",
        "scraped_at": "2025-12-23T09:43:34.911659",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/hamas-faces-legitimacy-crisis-desperate-gazans-flock-us-backed-aid-centers",
        "title": "Hamas faces 'legitimacy crisis' as desperate Gazans flock to US-backed aid centers",
        "publish_date": "May 29, 2025 8:54am EDT",
        "author": "ByCaitlin McFallFox News",
        "content": "New aid distribution center established in the Tel al-Sultan area of Gaza. (Video: IDF.)\nThe terrorist group known as Hamas has long plagued theGaza Stripbut is facing a point of crisis as its influence and support, which was already far from sweeping, continues to drop amid internal pressure to end the war and return the hostages taken during the Oct. 7, 2023 attacks.\n\"Hamas’s current posture reveals a critical inflection point in its grip over the Gaza Strip,\" Joe Truzman, a senior research analyst and editor at the Foundation for Defense of Democracies' Long War Journal and an expert on Palestinian terrorist groups, told Fox News Digital. \"By opposing the new aid distribution mechanism, one that is coordinated by the U.S. and Israel, Hamas is signaling that its primary concern is not the well-being of Palestinians but the preservation of its authority.\"\nDespite the monthslong aid blockade on the Gaza Strip byIsraeland the images of starvation, Hamas this week threatened any Palestinian civilians who accept food aid for their families and warned they \"will pay the price, and we will take the necessary measures.\"\nDisplaced Palestinians line up pans to collect hot food from a charity food distribution center in Gaza City, northern Gaza, on Tuesday, May 27, 2025.(Photographer: Ahmad Salem/Bloomberg via Getty Images)\nHAMAS TERROR GROUP REPORTEDLY BUCKLING UNDER FINANCIAL STRAIN AMID ISRAELI MILITARY GAINS AND GROWING UNREST\nDespite the threats, Palestinians have flooded theaid siteserected by the U.S.-Israeli-backed Gaza Humanitarian Foundation (GHF), reportedly resulting in scenes of chaos as desperate civilians overran one distribution location on Tuesday. The Israel Defense Forces (IDF) said its \"troops fired warning shots in the area outside the compound,\" adding, \"Control over the situation was established … and the safety of IDF troops was not compromised.\"\nThe U.N. Human Rights Office claimed some 47 people were injured during the gunfire, while the Hamas-run health ministry said one person was killed and 48 others were wounded, reported theBBC, though Fox News Digital could not independently verify the casualty count.\nOn Wednesday, GHF said in a statement that, contrary to reports, no Palestinians have been questioned or detained while receiving aid. Additionally, GHF said that no Palestinians had been shot or killed while trying to get aid.\n\"As we have repeatedly cautioned, there are many parties who wish to see GHF fail. Their goal is to force a return to the status quo, even if it means risking lifesaving aid to the people of Gaza,\" the GHF said in a statement. \"Reports to the contrary originated from Hamas and are inaccurate.\"\nHamas fighters stand in formation as Palestinians gather on a street to watch the handover of three Israeli hostages to a Red Cross team in Deir el-Balah, central Gaza, on February 8, 2025(Majdi Fathi/NurPhoto via Getty Images)\nTruzman explained that it is in Hamas interest to portray the aid delivery as negatively as possible, and to use the chaos to promote itsreturn to power.\n\"Hamas had significant influence over aid flows, which it used not only for governance but also as leverage to reinforce loyalty, reward patronage networks, and maintain internal control,\" the expert explained. \"The erosion of this influence poses both a symbolic and operational threat to the group.\n\"With Hamas becoming sidelined from the aid process, the group is facing a legitimacy crisis,\" Truzman added.\nDespite the chaotic scenes that arose as aid finally returned to Gaza, the GHF said Tuesday that it had distributed about 8,000 food boxes totaling 462,000 meals so far.\nDisplaced Palestinian children wait to receive a free meal from a charity food distribution center in Gaza City, northern Gaza, on Tuesday, May 27, 2025.(Photographer: Ahmad Salem/Bloomberg via Getty Images)\nOn Wednesday, eight trucks worth of aid were delivered, which equates to some 378,262 meals.\n\"Operations will continue to scale up tomorrow,\" the GHF confirmed.\nOne Gazan told the Center for Peace Communications that the failure of Hamas, which serves as the local government, to secure affordable and accessible food has driven civilians to the American distribution site.\n\"In fact, they were good to us,\" he said. \"They were handing out rations cards and started to tell us to take them. Unlike those ruling Gaza who don't do anything for us.\n\"We, as a people, are telling you that we need anyone, anyone who can provide us with these necessities,\" he added. \"Otherwise, no one would be going to the American distribution point. If Hamas is listening to us, get off the people's backs.\n\"The people are dying,\" the man added.\nISRAELI AMBASSADOR SLAMS UN'S 'MAFIA-LIKE' TACTICS AGAINST US-BACKED GAZA FOUNDATION\nIn recent months, civilian populations have not only been turning to external actors for relief where possible, they haveincreasingly called on Hamasto return the hostages, stop the war and even leave the Gaza Strip.\n\"This shift undermines Hamas’s image as the authority in Gaza and exposes its weakened state,\" Truzman said.\n\"However, any assumption that Hamas might yield under these conditions must be tempered by the nature of its surviving leadership,\" he warned. \"Those who remain at the helm are among the most ideologically entrenched and militarily committed members of the organization.\"\nHamas took over the Gaza Strip in 2007 after it defeated its rival party, Fatah, which is part of the Palestine Liberation Organization.\nDespite the plurality vote nearly two decades ago, Hamas has struggled to maintain control and stability for years and its support – even in the lead up to the 2023 attacks that prompted the largest-ever war between Israel and Hamas in Gaza – was reportedly lacking and its leadership growing increasingly unpopular.\nBritish volunteer doctor Victoria Rose, left, is seen working at Nasser Hospital in Khan Yunis, Gaza, on May 25, 2025.((Photo by Alaa Y. M. Abumohsen/Anadolu via Getty Images)\nISRAEL BLOCKS HUMANITARIAN AID INTO GAZA AFTER HAMAS REJECTS CEASEFIRE EXTENSION PROPOSAL\nIsrael and Egypt have limited the flow of goods into the Gaza Strip for the last two decades, and border crossing restrictions have been heavily enforced since the 1980s. Israel withdrew from Gaza in 2025.\nHowever, according to a report by theWilson Center, only a fraction of the population prior to the Oct. 7, 2023 attacks blamed food shortages on external factors like sanctions, while a third blamed the Hamas-run government for mismanagement, while another quarter of the population blamed inflation.\nThe report also found that nearly half of Palestinian civilians said they had no trust in Hamas' leadership, while roughly a third of the population threw their support behind the group.\nSupport isbelieved to have droppedin the nearly 600 days that followed the Oct. 7, 2023 terror attacks, and the subsequent devastation brought to the Gaza Strip.\nDisplaced Palestinians wait to receive a free meal from a charity food distribution center in Gaza City, northern Gaza, on Tuesday, May 27, 2025.(Photographer: Ahmad Salem/Bloomberg via Getty Images)\nCLICK HERE TO GET THE FOX NEWS APP\n\"If the new aid mechanism succeeds in improving living conditions for Palestinians, surpassing what Hamas has been able to provide during wartime, it is unlikely to reverse the growing public dissatisfaction with the group,\" Truzman told Fox News Digital. \"Even an imperfect but externally managed aid system may further expose Hamas’s governance failures, particularly its prioritization of power retention over the welfare of the population.\n\"While tangible improvements will take time to materialize, the mere perception that life can improve without Hamas may be enough to shift public attitudes further against the group,\" he added.\nCaitlin McFall is a Reporter at Fox News Digital covering Politics, U.S. and World news.",
        "scraped_at": "2025-12-23T09:43:40.394844",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "Fox News",
        "url": "https://www.foxnews.com/world/israel-constructs-large-pumps-flood-hamas-terror-tunnels-seawater-wall-street-journal",
        "title": "Israel constructs large pumps to flood Hamas terror tunnels with seawater: Wall Street Journal",
        "publish_date": "December 5, 2023 7:25am EST",
        "author": "ByChris PandolfoFox News",
        "content": "FOX News' Greg Palkot reports the latest on the Israel-Hamas war.\nThe Israeli military has assembled several large pumps it could use to flood the Hamas tunnels beneath the Gaza Strip with seawater, driving out terrorists hiding there,The Wall Street Journalreported, citing U.S. officials.\nConstruction of five large seawater pumps was completed in November about one mile north of the Al-Shati refugee camp. Each pump is capable of drawing water from the Mediterranean Sea and can move thousands of cubic meters of water per hour, which would flood the tunnels within weeks, the report said.\nIsrael has not yet committed to the plan, and it is unclear whether it would attempt to flood the tunnels while there are still hostages, including Americans, held by Hamas. The Palestinian terror group took some 240 people captive duringthe Oct. 7 attack on Israeland brought them back to the Gaza Strip.\nAccording to the report, Israel has identified about 800 tunnels beneath Gaza that Hamas has used to move fighters, store weapons and plan terror attacks on Israel. However, Israeli officials believe the tunnel network is much larger.\nISRAEL LAUNCHES 10,000TH AIRSTRIKE AGAINST HAMAS, AS PALESTINIANS SEEK SHELTER IN CROWDED SOUTHERN GAZA\nIsraeli soldiers operate at the opening to a tunnel at Al Shifa Hospital compound in Gaza City, amid the ongoing ground operation of the Israeli army against Palestinian Islamist group Hamas, in the Gaza Strip, November 22, 2023.(REUTERS/Ronen Zvulun/File Photo)\nBy flooding the tunnels over several weeks, Israel would enable Hamas terrorists and potentially hostages to move out, the outlet reported, citing a source familiar with the plan.\n\"We are not sure how successful pumping will be since nobody knows the details of the tunnels and the ground around them,\" the source said. \"It’s impossible to know if that will be effective because we don’t know how seawater will drain in tunnels no one has been in before.\"\nUN ACCOUNT HIT FOR EXPLICITLY CONDEMNING HAMAS' ATTACK ON ISRAEL EIGHT WEEKS LATER: ‘TOOK YOU LONG ENOUGH’\nA view shows the entrance to what Israel's military says is the shaft of a Hamas underground tunnel that was uncovered during Israel's ground operation against the Palestinian Islamist group Hamas, in the Gaza Strip as seen in a screen grab from a video released by the Israel Defense Forces on December 3, 2023.(ISRAEL DEFENSE FORCES/Handout via REUTERS)\nThe Wall Street Journal said an Israel Defense Forces official declined to comment on the flooding plan, but said: \"The IDF is operating to dismantle Hamas’s terror capabilities in various ways, using different military and technological tools.\"\nU.S. officials were informed of the plan last month, the Wall Street Journal reported, but the U.S. does not know how closeIsraeli Prime Minister Benjamin Netanyahu's governmentis to executing the plan.\nUS WARSHIP, MULTIPLE COMMERCIAL VESSELS REPORTEDLY ATTACKED IN RED SEA\nAn Israeli soldier secures a tunnel underneath Al Shifa Hospital in Gaza City, amid the ongoing ground operation of the Israeli army against Palestinian Islamist group Hamas, in the northern Gaza Strip, November 22, 2023.(REUTERS/Ronen Zvulun)\nIsrael has committed to continuing its war effort until Hamas is eradicated in Gaza. The Israeli military said it launched its 10,000th airstrike against the terror group in the Gaza Strip late Sunday.\nIsrael has vowed to do everything it can to protect civilians as it targets Hamas and its network of tunnels. Many of the 10,000 airstrikes have been aimed at destroying Hamas' underground labyrinth.\nCLICK HERE TO GET THE FOX NEWS APP\nThe IDF saysit has struck over 400 separate Hamas targets since the cease-fire agreement collapsed on Friday. White House National Security Council spokesperson John Kirby said Sunday that Hamas was to blame for the end of the cease-fire, because they did not release \"additional women and children that we know that they are holding, and they're refusing to let go.\"\n\"Our policy is clear — we will forcefully strike any threat posed against our territory,\" IDF spokesman Daniel Hagari said in a statement.\nFox News Digital's Anders Hagstrom contributed to this report.\nChris Pandolfo is a breaking news reporter for Fox News Digital. Send tips to chris.pandolfo@fox.com and follow him on Twitter @ChrisCPandolfo.",
        "scraped_at": "2025-12-23T09:43:44.230008",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c17x0xjqj21o",
        "title": "Israel confirms Hamas and PIJ returned body of Gaza hostage Dror Or",
        "publish_date": "2025-11-26T08:04:46.295Z",
        "author": "N/A",
        "content": "Israel has confirmed that Hamas and Palestinian Islamic Jihad (PIJ) handed over the body of deceased Israeli hostage Dror Or on Tuesday.\nIsraeli Prime Minister Benjamin Netanyahu's office said his government \"shares in the deep sorrow of the Or family\" following the completion of forensic testing overnight.\nIt stressed that Israeli authorities were working \"tirelessly\" to bring home the last two dead hostages still in Gaza and demanded that Hamas uphold its commitments to hand over their remains under the six-week-old Gaza ceasefire agreement.\nOr's body was transferred via the Red Cross after PIJ and Hamas announced that it had been recovered in central Gaza on Monday.\nOn Wednesday morning, the Israel Defense Forces (IDF) said its representatives had informed Or's family that his body was returned after experts at the National Centre of Forensic Medicine in Tel Aviv confirmed its identity.\nAccording to the IDF, the 48-year-old father of three was killed by PIJ at his home in Kibbutz Be'eri during the Hamas-led attack on southern Israel on 7 October 2023. His body was then abducted and taken to Gaza as a hostage.\nMr Or's wife, Yonat, was also killed during the attack, while two of their children, Noam and Alma, were kidnapped alive. They were held hostage in Gaza until November 2023, when they were released as part of a week-long ceasefire deal.\n\"The IDF expresses deep condolences to the families, continues to make every effort to return all the deceased hostages, and is prepared for the continued implementation of the agreement,\" an IDF statement said.\n\"Hamas is required to fulfil its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial.\"\nUnder the first phase of the US-brokered ceasefire deal, which took effect on 10 October, Hamas agreed to return the 20 living Israeli hostages and the bodies of the 28 dead Israeli and foreign hostages still in Gaza within 72 hours.\nAll the living hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.\nSo far, the remains of 23 dead Israeli hostages have been handed over, along with those of three foreign hostages – one of them Thai, one Nepalese and one Tanzanian.\nIn exchange, Israel has handed over the bodies of 330 Palestinians killed during the war. It should hand over another 15 bodies in return for Mr Or's remains.\nOne of the remaining dead hostages is Israeli - Ran Gvili, 24 - and the other is Thai - Suthisak Rintalak, 43.\nIsrael has accused Hamas of deliberately delaying the recovery of the hostages' bodies, while Hamas has insisted it is struggling to find them under rubble.\nThe slow progress has meant there has been no advance on the second phase of President Donald Trump's Gaza peace plan. This includes plans for the governance of Gaza, the withdrawal of Israeli troops, the disarmament of Hamas and reconstruction.\nThe two dead hostages still in Gaza were among the 251 people abducted by Hamas and its allies on 7 October 2023, when about 1,200 other people were killed.\nIsrael responded to the attack by launching a military campaign in Gaza, during which more than 69,770 people have been killed, according to the territory's Hamas-run health ministry.",
        "scraped_at": "2025-12-23T09:43:48.674738",
        "keywords": [],
        "summary": "",
        "conflict": "Gaza"
    }
]