[
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cwypp1jwjz1o",
        "title": "Stigma of Ukraine's forgotten soldiers who 'died the wrong way'",
        "content": "This article contains distressing details and references to suicide. Some of the names have been changed to protect identities. Kateryna cannot talk about her son, Orest, without tears. Her voice trembles with anger as she explains how she found out the news that he had died on the front line in the eastern Donetsk region of Ukraine in 2023. According to the official investigation by the army, he died by a \"self-inflicted wound\", something Katernya finds hard to believe. Kateryna has asked for her and her late son to remain anonymous due to the stigma that surrounds suicide and mental health in Ukraine. Orest was a quiet 25-year-old who loved books and dreamed of an academic career. His poor eyesight had made him initially unfit for service at the start of the war, his mother says. But in 2023, a recruitment patrol stopped him in the street. His eyesight was re-evaluated and he was deemed fit to fight. Not long after, he was sent to the front as a communications specialist. While Ukraine collectively mourns the loss of soldiers who have died since Russia's full-scale invasion in 2022, a quieter tragedy unfolds in the shadows. There are no official statistics surrounding suicide among soldiers. Officials describe them as isolated incidents. Yet human rights advocates and bereaved families believe they may be in the hundreds. \"Orest was caught, not summoned,\" Kateryna says bitterly. The local recruitment centre denied wrongdoing to the BBC, saying impaired vision made Orest \"partially fit\" during wartime. Once deployed near Chasiv Yar in Donetsk, Orest became increasingly withdrawn and depressed, Kateryna recalls. She still writes letters to her son every day - 650 and counting - her grief made worse by how Ukraine classifies suicide as a non-combat loss. Families of those who take their own lives receive no compensation, no military honours and no public recognition. \"In Ukraine, it's as if we've been divided,\" says Kateryna. \"Some died the right way, and others died the wrong way.\" \"The state took my son, sent him to war, and brought me back a body in a bag. That's it. No help, no truth, nothing.\" For Mariyana from Kyiv, the story is heartbreakingly similar. She too wishes to keep her identity and her late husband's hidden. Her husband Anatoliy volunteered to fight in 2022. He was initially refused because of his lack of military experience but he \"kept coming back until they took him\", she says with a faint smile. Anatoliy was deployed as a machine-gunner near Bakhmut, one of the bloodiest battles of the war. \"He said that, after one mission, about 50 guys were killed,\" Maryana recalls. \"He came back different; quiet; distant.\" After losing part of his arm, Anatoliy was sent to hospital. One evening, after a phone call with his wife, he took his own life in the hospital yard. \"The war broke him,\" she says through tears. \"He couldn't live with what he'd seen.\" Because Anatoliy died by suicide, officials denied him a military burial. \"When he stood on the front line, he was useful. But now he's not a hero?\" Mariyana feels betrayed: \"The state threw me to the roadside. I gave them my husband, and they left me alone with nothing.\" She has also felt stigma from other widows. Her only source of support is an online community of women like her - widows of soldiers who took their own lives. They want the government to change the law, so that their bereaved families have the same rights and recognition. Viktoria, who we met in Lviv, still cannot talk about her husband's death publicly for fear of condemnation. Her husband Andriy had a congenital heart condition, but insisted on joining the army. He became a driver in a reconnaissance unit and witnessed some of the most intense battles, including the liberation of Kherson. In June 2023, Viktoria received a phone call telling her Andriy had taken his own life. \"It was like the world had collapsed,\" she says. His body arrived 10 days later, but she was told she could not see it. An attorney she later hired found inconsistencies in the investigation into his death. The photos from the scene made her doubt the official version of her husband's death. The Ukrainian military has since agreed to reopen the investigation, recognising failures. Now she is fighting to re-open the case: \"I'm fighting for his name. He can't defend himself anymore. My war isn't over.\" Oksana Borkun runs a support community for military widows. Her organisation now includes about 200 families bereaved by suicide. \"If it's suicide, then he's not a hero - that's what people think,\" she says. \"Some churches refuse to hold funerals. Some towns won't put up their photos on memorial walls.\" Many of these families doubt the official explanations of death. \"Some cases are simply written off too quickly,\" she adds. \"And some mothers open the coffin and find bodies covered in bruises.\" Military chaplain Father Borys Kutovyi says he has seen at least three suicides in his command since the full-scale invasion began. But to him even one is too many. \"Every suicide means we failed somewhere.\" He believes that many recruited soldiers, unlike career servicemen, are especially psychologically vulnerable. Both Osksana and Father Borys say those who died by suicide should be considered heroes. Olha Reshetylova, Ukraine's Commissioner for Veterans' Rights, says she receives reports of up to four military suicides each month and admits not enough is being done: \"They've seen hell. Even the strongest minds can break.\" She says her office is pushing for systemic reform but it can take years to set up a good military psychology unit. \"Families have a right to the truth,\" she says. \"They don't trust investigators. In some cases, suicides may cover up murders.\" When it comes to honouring theses soldiers as military heroes, she prefers to look to the future. \"These people were your neighbours, your colleagues,\" says Ms Reshetylova. \"They've walked through hell. The warmer we welcome them, there will be fewer tragedies\" With additional reporting by Kevin McGregor, Oleksii Nazaruk and Phoebe Hopson. If you have been affected by any of the issues in this story you can findinformation and support on the BBC Action online website here. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. Edmund Doyle takes on the challenge to help men's mental health services after his own struggles. New figures reveal one in 13 people will spend Christmas alone in the South East. Four organisations are working together to provide the carers support service. Guernsey Mind shares ways to help cope with the challenges Christmas and New Year can bring. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/live/ce8np3pnljdt",
        "title": "EU agrees â¬90bn loan for Ukraine as Putin tells BBC the West is 'making Russia the enemy'",
        "content": "European Union leaders have struck a deal to give Ukraine a â¬90bn (Â£79bn; $105bn) loan after failing to agree on using frozen Russian assets valued at â¬210bn Meanwhile, at Putin's marathon end-of-year address, he tells the BBC's Russia editor Steve Rosenbergthe West is \"making Russia the enemy\" Belgium - where most of Moscow's assets are held - hasrefused to unlock the cash without assurancesthat it would be protected in case the Kremlin decided to sue This EU loan is about two-thirds of the â¬135bn that Kyiv is thought to need to stay afloat over the next two years Here's what else you need to know about the deal While Kyiv is getting what it wants from a divided donor,explains our Ukraine correspondent, nearly everyone can claim a victory, writes ourEurope digital editor Edited by Rorey Bosotti and Angus Thompson, with reporting from Russia editor Steve Rosenberg and Vitaliy Shevchenko A gloomy Dnipro River and the city skyline in Kyiv this morning Russian President Vladimir Putin marked the end of the year with a mammoth address, taking questions from the media and the public and outlining his view of the world. Ukraine's Volodymyr Zelensky was in Poland to highlight the important role Kyiv and Warsaw play for the security of Europe. He also thanked EU leaders for agreeing toprovide his country with a â¬90bn (Â£79bn; $105bn) loan- althoughapproval only came after a fraught, at times heated, summit. We'll be ending our live coverage of those two headlines shortly - but before we do, here's a quick recap of what's happened today: Elizaveta FokhtBBC News Russian After talks on ending the war in Ukraine in Berlin earlier this week, the US representatives said that 90% of the problems standing in the\nway of peace had been resolved at the meeting. It is quite hard to believe this\nafter watching the first 20 minutes of Vladimir Putinâs press conference. In his speech, he repeated the now-familiar phrase\nthat Russia is ready for negotiations â on the conditions he outlined at a\nmeeting of the Foreign Ministry last summer. This is the toughest and most\nmaximalist version of the demands. Among them are the withdrawal of the Ukrainian\nArmed Forces from all regions that Russia considers its own (moreover, within\ntheir administrative boundaries), Ukraineâs refusal to join Nato, its\nnon-nuclear and neutral status, as well as âdemilitarizationâ and\nâdenazificationââ that is, reductions in the army and armaments and political\nchanges demanded by Moscow. If Moscow truly expects precisely these\nconcessions, it is impossible to imagine that the Kremlin would agree, for\nexample, to a package of security guarantees that European leaders and a US delegation discussed last week with Ukrainian President Volodymyr Zelensky. The sense that Russia is preparing for the end of\nthe war was also dispelled by Putinâs subsequent statements. He spoke in detail\nabout successes at the front, and a military officer was also invited to the\npress conference, who told those gathered about allegedly-committed crimes by\nthe Ukrainian Armed Forces against civilians (without evidence). However, it had already become clear from Putinâs\nspeech at the Collegium of the Russian Ministry of Defense earlier this week:\nRussia is preparing to continue military operations in 2026 as well. Rob CameronBBC Prague Correspondent âI have fulfilled my task,â Slovakiaâs Robert Fico announced in an\nofficial statement released via the Slovak government office. âSlovakia will not be part of any loan when it comes to Ukraineâs wartime needs,â he went on, adding that his country believed there was no\nmilitary solution to the war. Critics say Fico - along with Hungaryâs Viktor Orban - has become\none of the Kremlinâs most valuable assets in the European Union, consistently\nadopting the positions and rhetoric of Moscow. The Slovak PM has met Vladimir Putin three times in the past 12\nmonths, and has said the Russian leader has been \"wrongly demonised\" by the\nwest. He says the roots of the conflict go back long before 2022, and has\nspoken of âthe rampages of Ukrainian neo-Nazisâ in 2014. However, he stressed Slovakia remained a strong supporter of\nUkraineâs EU ambitions, and pointed out his country was supplying Ukraine with\nelectricity and also allowed reverse flows of gas. Dearbail JordanSenior business and economics reporter Just how much of a dent does a â¬90bn (Â£79bn; $105bn) loan put in the EUâs coffers?\nThere are a few things to bear in mind. The EU budget covers a seven-year period. The current one runs up\nto 2027 and is â¬1.2 trillion (Â£1 trillion; $1.4 trillion). It might seem like oodles of dough but break it down and it works\nout at an annual average of around â¬171bn (Â£150bn; $200bn). A â¬90bn loan looks pretty\nsignificant against that. However, the loan will not be coming out of the EUâs budget.\nInstead, the EU will go to financial markets to raise the money for the loan to\nUkraine. It will be guaranteed against what is known as the budget\nheadroom, or a buffer. This is the difference between the maximum amount the\nEuropean Commission (EC) â the EUâs executive arm â can ask countries to\ncontribute to the budget and spending. In addition, â¬90bn will not be handed over to Ukraine in one\nfell swoop. The interest-free loan will be given to Ukraine over 2026 and 2027,\naccording to Melanie Debono, senior Europe economist at Pantheon\nMacroeconomics. She adds that it is âunlikelyâ that the EUâs credit rating will be\naffected by having to borrow more money. That, she says, is âdependent on a number of things, not least\namong them the stability of the governments issuing the debt which, of course,\nincludes the likes of Germany which no-one thinks is about to fail on its\ndebtâ. In the end, this is a loan and therefore should be repaid by\nUkraine. So, what are the chances of that? The EC said the âloan would be repaid by Ukraine only once\nreparations are receivedâ. In other words, thatâs very difficult to say. A little earlier on, theBBC's Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putinabout his plans for the future of the country. You can see how the Russian leader responded in the clip below - as he called for greater respect from other western leaders. This video can not be played Putin says Western leaders deceived Russia Putin has blamed Ukraine for the war, but some messages from the public have been critical Russian President Vladimir Putin has wrapped up an annual news conference. At the end of each year, the Russian leader takes questions from Russian and foreign press - and in some cases, members of the public. Here's what we heard this year: Vitaliy ShevchenkoRussia editor, BBC Monitoring There were no\nsurprises in Vladimir Putin's presser this year, which has now come to an end. In a session lasting nearly five hours, there were familiar\naccusations ofUkraine being to blame for the ongoing war, claims of Russia\nmaking advances on the battlefield, and no indication that the Russian president\nis any more willing to compromise than when he launched the full-scale invasion\nin 2022. One key difference\nfrom past years is that America is no longer presented as an enemy. Since\nDonald Trump's re-election, it is Europe that is portrayed as Russia's enemy\nnumber one in the West. Ukraine's Volodymyr Zelensky has been in Warsaw today visiting Poland's new president, Karol Nawrocki. He says the trip \"opens a new, even more meaningful stage\" in relations between the countries. \"Relations not merely between neighbors, but between two European elements without which there would be no freedom and no reliable security in our entire part of Europe,\" he writes in a post on X. He says he discussed Europe's security with Nawrocki, as well as the war in Ukraine. \"Ukrainian independence and Polish independence are the foundation that enables every nation in our part of Europe to live freely â without Moscowâs rule,\" Zelensky says. \"That is why it is essential that we cooperate, support one another, and coordinate our efforts to defend Europe and our nations.\" Samira HussainReporting from Kyiv Sir Richard Knighton says Russia's battlefield gains are slow Putin devoted the early part of his marathon press conference toRussia's alleged battlefield accomplishments, claiming Ukrainian forces were being pushed back along the whole front line and seeing \"no success\". The UKâs Chief of the Defence\nStaff says Russian claims of taking large swaths of Eastern Ukraine are\n\"nonsense\". Sir Richard Knighton has just\nreturned from visiting Ukrainian troops close to the front line. Speaking to me\nin Kyiv, he says the progression of Russian forces has been slow. âI have seen the data to show me\nwhat the situation really is and Ukraine continues to fight hard against\nRussian aggression and continues to inflict huge casualties, so the claims that\nPutin makes are simply not borne out with the facts on the ground,â Knighton says. Callum TulleyReporting from Kyiv 'We need this,' says student Yelyzaveta Horiaieva In central Kyiv - as some go about their Christmas shopping, and others attend yet another military funeral in St Michaelâs monastery - weâve been speaking to people about their viewson the EU's â¬90bn loan. Yelyzaveta Horiaieva, a 19-year-old student from Lviv, says sheâs grateful. \"We need this, our people need this, but every day is so hard because you feel the cost of war. We have lost many people and money can not change this. I am hopeful for peace in the new year but we canât give up the territories our people are dying for,\" she says. Tetiana Cherniavska, 33, from Kyiv, starts telling me that the loan will \"help us hold onto our lands\" before her partner interrupts. âI have no faith that the money will help our fighters or our peopleâ, says Denis Kozhemiakin. âOur authorities are corrupt.â Oleksiy Ostapovych, an officer in the Ukrainian army, shares Denis Kozhemiakin's concern about corruption. âItâs very good that our partners are giving us the loan, but I would like these funds to be controlled so that they are not stolen,\" he says while standing outside St Michaelâs monastery before the funeral of a comrade. On the chances of peace he says, âI donât see any prospects for peace in the new year because neither me nor my people are ready to give up the territories for which so many people have died.â Oleksiy Ostapovych is concerned about corruption We earlier brought you an update from BBC's Samira Hussain, reporting from Kyiv, about Ukraine's claim it has struck a tanker in Russia's \"shadow fleet\" in the Mediterranean sea. But what is the shadow fleet, and why does it matter in Russia's war? The term commonly refers to tankers used to bypass a cap on Russian oil exports. Many Western nations imposed sanctions on Russian energy after the full-scale invasion in 2022, with Moscow accused of attempting to dodge them using tankers with unclear ownership. Former UK foreign secretary David Lammy described Russian oil revenues as \"fuelling the fires of war and destruction in Ukraine\" when he announced a raft of sanctions in November 2024. Samira HussainReporting from Kyiv Ukraine says its security forces have, for the first time,hit a Russian tanker in the Mediterranean Sea, using an aerial drone. Sources in the Security Service of Ukraine (SBU) have shared a video showing a large vessel engulfed in flames. The video has not been independently verified by the BBC. The vessel was a part of Russiaâs âshadow fleet,â a collection of tankers used to avoid Western sanctions, Ukraine claims. Kyiv says the money earned from such fleets goes directly to fund the war. They say the operation took place in neutral waters of the Mediterranean Sea, some 2,000km (1,242 miles) from Ukrainian shores. Sources in the SBU say the Russian ship was not carrying any cargo. If confirmed, this would be an audacious attack thousands of miles away from the front lines and a continuation of Kyivâs message to Moscow that they will fight the Russian war machine wherever it is. Rob CameronBBC Prague Correspondent The decision by the newly-appointed Czech prime minister, Andrej Babis, to join Hungary's Viktor Orban and Slovakia's Robert Fico in refusing to guarantee the loan is being interpreted in Prague as a radical departure from the Czech Republic's heavily pro-Ukraine foreign policy under his predecessor. \"I'm surprised we're giving [Ukraine] money for the next two years, when it's been announced that a peace deal is getting close,\" Babis said after EU leaders agreed the loan - with the Czechs, Hungarians and Slovaks granted an exemption from stumping up any cash. Babis - a billionaire populist who formed his second administration this week - had signalled a change of course for policy on both Ukraine and the EU. He has been firm that Czech taxpayers should not bear the cost of arming Kyiv. The BBC's Russia editor Steve Rosenberg has just asked a question of Vladimir Putin at the Russian president's annual news conference. What is the future you are planning for Russia and its people, Rosenberg asks. Will there be new special military operations? Putin delivers a lengthy response, in which he defends Russia's political system, raises the problem of \"fake news\", and references Donald Trump's lawsuit against the BBC. The Russian leader also accuses western leaders of \"dirty tricks\", and says that Nato member countries are continuing this through statements that they are preparing for a confrontation with Russia. \"Are we truly going to attack Europe? This is nonsense,\" he adds. \"They are creating the image of an enemy and they are making Russia the enemy.\" He continues that Russia is willing to work with countries like the US and UK \"but on par\" with \"due respect\" for one another. Vitaliy ShevchenkoRussia editor, BBC Monitoring Vladimir Putin's set-piece events are often rife with symbolism, and this time around even the set is sending an uncompromising message to Ukraine and its allies. The Russian president is speaking against a huge map of Russia in the background - including parts of Ukraine's southeast such as Crimea. Crimea was illegally annexed by Russia in 2014. He's said it many times in the past, and now even the visuals say: Ukraine's territory is ours. Hungarian Prime Minister Viktor Orban (L) and Slovakia's Prime Minister Robert Fico Hungary, Slovakia and the Czech Republic are exempt from paying towards the â¬90bn loan for Ukraine agreed by the EU. Here's what we've heard from them following last night's agreement: Hungary PM Viktor Orbansays: \"Hungary remains the voice of peace in Europe and will not let Hungarian taxpayersâ money be used to finance Ukraine.\" He adds that their exemption means they have \"spared our children and grandchildren from the burden of this massive â¬90 billion loan\". Slovakia's Prime Minister Robert Ficosays \"Slovakia will not âbe part of any military loan for Ukraine\", and adds that he rejects any further financing \"because we âdo not\nbelieve in âa military solution to the conflict\", according to a translation of his earlier address by Reuters News Agency. Czech Prime Minister Andrej Babissays the EU delegations \"agreed on further support for Ukraine in the form of a loan; I supported the conclusions and ensured that the Czech Republic will not guarantee the loan. Exactly as I promised\". Ukraine says it has struck a Russian \"shadow fleet\" tanker in the Mediterranean Sea, according to AFP and Reuters news agencies. The agencies quote a source in Ukraine's Security Service who says drones hit the tanker, which was unoccupied and sitting some 2,000km (1,243 miles) from Ukraine's borders. The source says critical damage was caused to the vessel in the attack. Laura GozziEurope reporter The first question to Putin from foreign media came from Keir Simmons from NBC, who asked whether the president would consider himself repsonsible for the deaths of Ukrainians and Russians if he rejected US President Donald Trump's peace plan proposal. No, Putin said, adding: \"We did not start this war.\" This is a statement we have heard before from the Russian president, despite the fact that Russia illegally annexed Ukraine's Crimean peninsula in 2014, triggered a war in Ukraine's eastern Donbas region, set up rebel states supported by Moscow and later, in 2022, launched a full-scale invasion of Ukraine. He praised Trump's \"sincere\" efforts to end the war and pushes back against the idea that Russia is blocking efforts towards a peace deal. \"It's incorrect to say that we reject something. The ball is in the hands of our Western opponents,\" Putin said. But in reality Moscow has been immovable on its demands for Ukrainian territory, specifically demanding that Kyiv withdraws from some sections of the Ukrainian region of the Donbas. More talks between US and Russian officials are planned for this weekend, but there has been no sign that Russian position has changed. While we continue to bring you lines from Vladimir Putin's annual address, let's recap the what we've heard today. The EU's loan deal for Ukraine Vladimir Putin's annual speech Volodymyr Zelensky visits Poland There has been a significant increase in the number of clashes between Ukrainian and Russian forces in the past 24 hours, according to the National Guard of Ukraine. Russia lost around 1,220 troops on Thursday and Ukrainian forces also destroyed one tank, 10 armoured vehicles, 18 artillery systems, one multiple rocket launcher, 426 operational-tactical UAVs and 111 vehicles, the National Guard says. It also explains that the number of Russian troops being killed each day has increased and for the third day in a row a Russian multiple rocket launcher has been destroyed. Copyright Â© 2025 BBC. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c30jre652gvo",
        "title": "Briton who fought in Ukraine jailed for 13 years by Russia",
        "content": "A Briton who fought in Ukraine has been sentenced to 13 years in a maximum-security prison, the Russian Prosecutor-General's office has said. Hayden Davies, a former British soldier who Russia has called a mercenary, was reportedly captured in Ukraine's Donbas region in late 2024 or early 2025 while serving with the country's foreign legion. He was tried in a Russian-controlled court in the city of Donetsk, which is currently occupied by Moscow. The UK Foreign, Commonwealth & Development Office (FCDO) said it strongly condemned the sentencing of Mr Davies \"on false charges\", adding he was a prisoner of war. It said: \"We remain in close contact with Mr Davies' family and are providing consular support.\" The FCDO said that under international law, prisoners of war cannot be prosecuted for participating in hostilities. It added: \"We demand that Russia respect these obligations, including those under the Geneva Conventions, and stop using prisoners of war for political and propaganda purposes.\" In a statement, Russian prosecutors said Mr Davies joined the Ukrainian army in August 2024 and \"took part in military operations against the Russian armed forces on the territory of [Donetsk Region]\". In court footage released by prosecutors, a man with a British accent speaks via a translator from inside a barred cage, which is standard practice for many Russian hearings. The man said he was a member of the Ukrainian Army's foreign legion and travelled to Ukraine by bus via Poland. He said he was paid $400 (£300) or $500 a month as a salary. When asked if he pleaded guilty to the charge, the man said \"yeah\" and nodded his head. It is not clear whether he was speaking under duress. Earlier this year, the FCDO also criticised the case brought against James Anderson, another Briton captured fighting with Ukraine forces, after he wasjailed for 19 yearsfor terrorism and mercenary activity. The 22-year-old was the first British national to be convicted by Russia during the war. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c1dz6wgn2w9o",
        "title": "In this secret missile factory, Ukraine is ramping up its domestic arms industry",
        "content": "We're driven blindfolded to a secret location where Ukraine is making one of its latest weapons. We're told to turn off our phones - such is the secrecy around the production of Ukraine's Flamingo cruise missile. For Ukraine, dispersing and hiding the production of weapons like this is key to survival. Two factories belonging to the company that makes it - Fire Point - have already been hit. Inside the one we're visiting we're told not to film any features such as pillars, windows or ceilings. We're also asked not to show the faces of workers on the assembly line - where Flamingo missiles are at various stages of completion. Even under fire, Ukraine is ramping up its arms industry. President Volodymyr Zelensky says the country now produces more than 50% of the weapons it uses on the front line. Almost its entire inventory of long-range weapons is domestically made. At the start of the war Ukraine mostly relied on its old Soviet-era arsenal. Western military support helped modernise the country's armed forces, but it now leads much of the world in developing unmanned systems – like robots and drones. Now, domestically produced cruise missiles are adding to Ukraine's long-range capability. Iryna Terekh is the chief technical officer of Fire Point – one of Ukraine's largest drone and missile manufacturers whose Latin motto translates to \"if not us, then who\". The 33-year-old once studied architecture, but she is now trying to help dismantle the Russian war machine. She cuts a tiny figure in front of the giant Flamingo missile, which she tells me is painted black not pink (unlike early prototypes) \"because it eats Russian oil\". The end product looks similar to the German V1 rocket from World War Two. It consists of a large jet engine placed on top of a tube the length of a London bus. They've already been used in combat, though the company won't confirm specific targets. The Flamingo is the kind of deep-strike weapon that Western nations have been reluctant to supply. The cruise missile is said to have a range of 3,000km (1,900 miles). That's similar to a US-made Tomahawk – the more sophisticated and expensive weapon that US President Donald Trump refused to give Ukraine. But deep strikes are seen as a critical part of the war, for which Ukraine mainly uses long-range drones. It is still losing ground to Russia on a front line that stretches for more than a thousand kilometres. So Ukraine is increasingly trying to target Russia's war economy, to slow those advances. The head of Ukraine's Armed Forces, General Oleksandr Syrskyi, says Ukraine's long-range strikes have already cost the Russian economy more than $21.5bn this year. Ruslan, an officer in Ukraine's Special Operations Forces, says the strategy is simple: \"To reduce the enemy's military capabilities and their economic potential.\" He says Ukraine's Special Operations Forces have carried out hundreds of strikes on oil refineries, weapons factories and ammunition dumps - deep inside enemy territory. Of course Russia has been doing the same, and on a greater scale. On average it has been launching around 200 Shahed drones a day; Ukraine's response has been about half that number. Nor is Russia limiting its strikes to military targets. Its long-range missile and drone attacks have led to massive power cuts right across the country – making life harder for millions of civilians. \"I'd like to launch as many drones as Russia does,\" Ruslan says. \"But we're scaling up very quickly\". Ms Terekh, of Fire Point, says Ukraine may not be able to match Russia's resources, but, she says, \"we are trying to fight with brains and tactics\". Denys Shtilerman, the chief designer and co-founder of the company, admits there is no \"Wunderwaffe\" – or wonder weapon. \"The game changer is our will to win,\" he says. Fire Point didn't even exist before Russia's full-scale invasion. But the start-up is now producing 200 drones a day. Its FP1 and FP2 drones, each the size of a small aeroplane, have carried out 60% of Ukraine's long-range strikes. Each drone costs around $50,000 - a third of the price of a Russian Shahed drone. Russia is still producing nearly 3,000 of those a month. Ukraine still needs outside help, not least with intelligence, targeting and money. But it is trying to be more self-sufficient. Ms Terekh says they've made a deliberate decision to source as many of their components as possible from within Ukraine. \"We are following the principle that no one can influence the weapons we build,\" she says. They avoid parts from two specific countries – China and the United States. Asked why there should be no American components, she says \"we're on an emotional roller coaster [with the US]. Tomorrow somebody may want to shut it down, and we would not be able to use our own weapons.\" Until the end of last year, under President Biden, the United States supplied nearly $70bn-worth of military support to Ukraine. That was soon stopped under President Trump – instead he has set up a scheme to allow European Nato to purchase US weapons. The US is no longer Ukraine's biggest military backer, and Europe has struggled to fill the gap left by America or to match its previous support. Concerns about future US support spills over into talk of future US security guarantees – a key issue of the current peace talks. Ms Terekh dismisses the ongoing negotiations as \"capitulation talks\", and says that Ukraine making its own weapons \"is the only way to really provide security guarantees\". The former architecture student also hopes that the rest of Europe will be watching, and learning lessons. \"We are a bloody example,\" she says, \"in terms of being prepared for war.\" Ms Terekh says she wants to shock them into action, and believes that if any other country had faced the same onslaught as Ukraine \"then they'd already have been conquered.\" Additional reporting by Volodymyr Lozhko and Kyla Herrmannsen. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c0l0k4389g2o",
        "title": "Ukraine in maps: Tracking the war with Russia",
        "content": "Fighting has raged in Ukraine since Russia launched a full-scale invasion more than three years ago. Over the past year, Russian forces have slowly expanded the amount of territory they control, mostly in the east of Ukraine, and have continued their recent barrage of air strikes on Kyiv and other cities. With the fourth anniversary of the invasion approaching, here's a look at the situation on the ground in Ukraine. Analysts at the US-based Institute for the Study of War (ISW), say Russia has taken about 4,700 sq km (1,800 sq miles) of territory in 2025 - an area about twice the size of the city of Moscow - although Russia claims to have taken 6,000 sq km. In eastern Ukraine, Moscow's war machine has been churning mile by mile through the wide open fields of the Luhansk and Donetsk regions - also known as the Donbas - surrounding and overwhelming villages and towns. It has been trying to gain full control of the area along with two more regions to the west - Zaporizhzhia and Kherson. Shortly after the invasion, Russia held referendums to try to annexe all these regions - in the same way it had annexed Crimea in 2014 - but it has never had them under full control. Under a US-backed peace plan unveiled in November, Ukraine would cede control of all of Luhansk, Donetsk and Crimea, along with the areas of Zaporizhzhia and Kherson that Russia currently occupies, to Moscow. Ukrainian forces would have to withdraw from parts of Donetsk they still hold and this would become a demilitarised area under de facto Russian control. Russian forces would withdraw from the small areas of Ukraine they currently occupy outside those regions. Ukraine's President Volodymyr Zelensky has consistently said Ukraine will not hand over the Donbas in exchange for peace, saying such a concession could be used as a springboard for future attacks by Russia. A recent report by the ISW describes a \"fortress belt\" running 50km (31 miles) through western Donetsk. \"Ukraine has spent the last 11 years pouring time, money, and effort into reinforcing the fortress belt and establishing significant defence industrial and defensive infrastructure,\" it writes. A Russian summer offensive near the eastern town of Pokrovsk did make rapid advances just north of the town and Russia has recently made advances in the south of the town itself and to the east of nearby Kostyantynivka. The town, once a key logistics hub for Ukraine's military, is already in ruins. Russian officials claim to have captured the key strategic town, known in Russian as Krasnoarmeysk, which could give Moscow a platform to drive north towards the two biggest remaining Ukrainian-controlled cities in the Donetsk region, Kramatorsk and Slovyansk. Ukraine is losing ground, but the ISW notes Russia has been trying to take Pokrovsk - a town of about 23 sq km - for nearly two years and that cities in the fortress belt are \"significantly larger\". It suggests that it would take Russian forces another two years to seize the remainder of the Donetsk region \"at great cost\". Further north on the main front line, Russia has been trying to advance on the city of Kupyansk, which analysts suggest could allow it to encircle the northern Donetsk region. It has also been trying to push Ukrainian forces back from the border with the Russian region of Belgorod. ISW analysts say Russia is trying to create a buffer zone inside Ukraine's northern borders and get within artillery range of Kharkiv, Ukraine's second-biggest city. Russian President Vladimir Putin says he wants this buffer zone to protect Russia, after Ukrainian forces captured a swathe of territory further north in Kursk in the summer of 2024. Russian forces eventually drove them out, with the help of North Korean troops. As well as the counter-offensive in the Kursk region, Ukraine has struck air bases deep inside Russia. One of these attacks involvedusing 100 drones to target nuclear-capable long-range bombers. The Russian Defence Ministry confirmed the attacks had occurred in five regions of Russia - Murmansk, Irkutsk, Ivanovo, Ryazan and Amur - but stated planes had been damaged only in Murmansk and Irkutsk, while in other locations the attacks had been repelled. More recently Moscow blamed Ukrainian drones for a massive oil depot fire near Russia's Black Sea resort of Sochi - the venue of the 2014 Winter Olympic Games. Deep strikes are seen as a critical part of the war- Ukraine is trying to target Russia's war economy to slow the advances on the front line. The head of Ukraine's Armed Forces, General Oleksandr Syrskyi, says Ukraine's long-range strikes have already cost the Russian economy more than $21.5bn this year. Since US President Donald Trump took office at the start of 2025, the US has been pursuing an end to the war through negotiations. Trump had been seen as more sympathetic to Russia than his predecessor Joe Biden was, and strained relations with Zelensky came to a head on 28 February when he and Vice-President JD Vance berated the Ukrainian president in the Oval Office on live television. Public relations with Zelensky have vastly improved in recent months and Ukraine remains critically dependent on deliveries of US-made advanced weaponry, including air defence systems to repel deadly Russian air assaults, as well as intelligence provided by Washington. Ukraine has presented its own 20-point peace plan to the US, to counter the initial American plan which was seen as heavily favouring Russia. Details haven't been shared, but last week Zelensky said the points should be seen as a \"foundation\" on which to build provisions for the reconstruction of Ukraine and security guarantees. However, the Kremlin has shown little sign that it is willing to compromise on its key demands, including ruling out any future path to Ukraine joining the Nato military alliance. Putin has also restated his willingness to continue fighting until his forces take full control of the Donetsk and Luhansk regions. Russia's full-scale invasion began with dozens of missile strikes on cities all over Ukraine before dawn on 24 February 2022. Russian ground troops moved in quickly and within a few weeks were in control of large areas of Ukraine and had advanced to the suburbs of Kyiv. Russian forces were bombarding Kharkiv, and had taken territory in the east and south as far as Kherson, and surrounded the port city of Mariupol. But they hit very strong Ukrainian resistance almost everywhere and faced serious logistical problems with poorly-motivated Russian troops suffering shortages of food, water and ammunition. Ukrainian forces were also quick to deploy Western supplied arms such as the Nlaw anti-tank system, which proved highly effective against the Russian advance. By October 2022, the picture had changed dramatically and, having failed to take Kyiv, Russia withdrew completely from the north. The following month, Ukrainian forces recaptured the southern city of Kherson. Since then, the battle has mostly been in the east of Ukraine with Russian forces slowly gaining ground over many months - military experts estimate between 165,000 and 235,000 Russian service personnel have been killed since the invasion. Ukraine last updated its casualty figures in December 2024, when President Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be an under-estimate. By Dominic Bailey, Mike Hills, Paul Sargeant, Chris Clayton, Kady Wardell, Camilla Costa, Mark Bryson, Sana Dionysiou, Gerry Fletcher, Kate Gaynor and Erwan Rivault To indicate which parts of Ukraine are under control by Russian troops we are using daily assessments published by theInstitute for the Study of Warwith theAmerican Enterprise Institute's Critical Threats Project. The situation in Ukraine is often fast moving and it is likely there will be times when there have been changes not reflected in the maps. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. EU leaders said the loan would be repayable only when Russia paid reparations for the war. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/videos/cx2e1kr2drdo",
        "title": "Could the EU release frozen assets to fund Ukraine?",
        "content": "Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c9vjlj1ezpgo",
        "title": "Zelensky gives stark warning as EU leaders decide on Russia's frozen assets",
        "content": "Volodymyr Zelensky has called on EU leaders at a crunch summit urgently to agree  to a multi-billion euro loan in frozen Russian money to fund Ukraine's military and economic needs. Ukraine is months from running out of cash and Zelensky said without an injection by spring Ukraine \"will have to reduce production of drones\". Most of Russia's €210bn (£185bn; $245bn) worth of assets in the EU are held by Belgium-based organisation Euroclear. Until now Belgium and some other member states have said they are opposed to using the cash as a \"reparations loan\". Russia has warned EU leaders not to use its money, but Polish Prime Minister Donald Tusk said they had to \"rise to this occasion\". The Brussels summit comes at a pivotal moment in the war and Russia has filed a lawsuit against Euroclear in a Moscow court in a bid to get its money back. Zelensky said Ukraine was definitely facing a 45-50bn [euro] deficit next year, and European Commission chief Ursula von der Leyen vowed \"we will not leave the summit without a solution\". One European government official described being \"cautiously optimistic, not overly optimistic\" that a deal would be agreed. All eyes are on Belgian Prime Minister Bart De Wever, who told the Belgian parliament on Thursday that if everything was nailed down and shared by the rest of the EU, \"then we'll jump into the abyss together with the rest of the Europeans and hope the parachute holds us\". Meanwhile, US President Donald Trump has said a deal is closer than ever to end the war - which began with Russia's full-scale invasion of Ukraine in February 2022. US and Russian officials are due to meet in Miami this weekend for further talks on a peace plan, a White House official has told AFP news agency. It is thought Kremlin envoy Kirill Dmitriev will talk to Trump envoys Steve Witkoff and Jared Kushner in Miami. Ukrainian officials are also heading to the US, and President Zelensky, who is in Brussels, said Kyiv needed the money, either to support its army if the war continued, or to direct the funding entirely for recovery: \"It's moral, it's fair and it's legal, confirmed by the expertise of many, many professionals.\" Russia has not yet responded to the latest peace proposals, but the Kremlin has stressed that plans for a European-led multinational force for Ukraine supported by the US would not be acceptable. President Vladimir Putin made his feelings towards Europe clear on Wednesday, when he said the continent was in a state of \"total degradation\" and that \"European piglets\" - a derogatory description of Ukraine's European allies - were hoping to profit from Russia's collapse. The European Commission - the EU's executive arm - has proposed loaning Kyiv about €90bn (£79bn) over the next two years - out of the €210bn of Russian assets sitting in Europe. That is about two-thirds of the €137bn that Kyiv is thought to need to get through 2026 and 2027. Until now the EU has handed Ukraine the interest generated by the cash but not the cash itself. \"This is a crunch time for Ukraine to keep fighting for the next year,\" a Finnish government official told the BBC. \"There are of course peace negotiations but this gives Ukraine leverage to say 'we're not desperate and we have the funds to continue fighting'.\" The head of the European Commission says it will also ramp up the cost of war for Russia. Russia's frozen assets are not the only option on the table for EU leaders. Another idea, backed by Belgium, is based on the EU borrowing the money on the international markets, using the EU budget as a guarantee. However, that would require a unanimous vote and Hungary's Viktor Orban has made it clear he will not allow any more EU money to help Ukraine. For Ukraine, the hours ahead are significant and EU leaders have been keen to stress the momentous nature of the loan decision. \"We know the urgency. It is acute. We all feel it. We all see it,\" Ursula von der Leyen told the European Parliament on Wednesday. German Chancellor Friedrich Merz has played a leading role in pushing for the Russian assets to be used, telling the Bundestag on the eve of the summit it was about sending a \"clear signal\" to Moscow that continuing the war was pointless. EU officials are confident they have a sound legal basis to use the frozen Russian assets, but so far the Belgian prime minister remains unconvinced. Hungary is seen as the biggest opponent of the move and, ahead of the summit, Prime Minister Orban and his entourage even suggested that the frozen assets plan had been removed from the summit agenda. A European Commission official stressed that was not the case and it would be a matter for the 27 member states at the summit. Slovakia's Robert Fico has also opposed using the Russian assets, if it means the money being used to procure weapons rather than for reconstruction needs. When the pivotal vote does finally take place, it will require a majority of at least 15 member states making up 65% of Europe's population to go through. Whatever happens, European Council President António Costa has promised not to go over the heads of the Belgians. \"We're not going to vote against Belgium,\" he told Belgian public broadcaster RTBF. \"We'll continue to work very intensively with the Belgian government because we don't want to approve something that might not be acceptable for Belgium.\" Belgium will also be aware that ratings agency Fitch has placed Euroclear on a negative watch, partly because of \"low\" legal risks to its balance sheet from the European Commission's plans to use the Russian assets. Euroclear's chief executive has also warned against the plan. \"We have to find a way to respond to Belgium's worries,\" the Finnish official added. \"We are on the same side as Belgium. We will find a solution together to make sure all the risks are checked as much as they can be checked.\" However, Belgium is not the only country to have doubts, and a majority is not guaranteed. Italian Prime Minister Giorgia Meloni has told Italian MPs she will endorse the deal \"if the legal basis is solid\". \"If the legal basis for this initiative were not solid, we would be handing Russia its first real victory since the beginning of this conflict.\" Malta, Bulgaria and the Czech Republic are also said to be unconvinced by the controversial proposals. If the deal is passed and the Russian assets are given to Ukraine, the worst-case scenario for Belgium would be one in which a court would order it to hand the money back to Russia. Some countries have said they would be prepared to provide billions of euros in financial guarantees, but Belgium will want to see the numbers add up. At any rate, Commission officials are confident that the only way for Russia to get it back would be by paying reparations to Ukraine - at which point Ukraine would hand its \"reparations loan\" back to the EU. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/crmd1xgy38go",
        "title": "British soldier killed in Ukraine told family to 'be proud' in letter",
        "content": "A British paratrooper killed serving in Ukraine told his family to \"be proud\" and not \"remember him with sadness\", in a letter to be opened in the event of his death. The body of Lance Corporal George Hooley was repatriated to RAF Brize Norton on Wednesday after his death last week. The 28-year-old was killed while observing Ukrainian forces test \"a new defensive capability, away from the front lines\", in what the Ministry of Defence (MoD) described as a \"tragic accident\". An extract of the letter, shared at the request of L/Cpl Hooley's family, said he \"went out doing what I trained to do, what I chose to do, and I had all of you in my heart the whole way\". \"If you are reading this, it means I didn't make it home,\" he wrote. \"Please don't let that be the thing that breaks you. You know I was doing what I believed in as well as loved, with people I respected, and for reasons that matter to me, my country and democracy and freedom in this world. \"I was proud of what I was doing. Don't remember me with sadness and loss. Be proud.\" Earlier on Wednesday, a private ceremony was held at Brize Norton before L/Cpl Hooley's body was carried past mourners lining the route to the Carterton Repatriation Memorial Garden. He was due to be promoted to Corporal in January and had been given the role's responsibilities on his deployment to Ukraine, the MoD said. L/Cpl Hooley, who had previously been deployed to Afghanistan, Africa and Eastern Europe, was described in tributes as having a \"rare gift\" of \"deep kindness\". His company commander said: \"If you met George Hooley, you remembered it. His energy and enthusiasm were simply extraordinary. \"He provided spark that lifted others, a drive that inspired, and a zest for life that reminded us all how to live with purpose and joy. And we loved him for it. George had a rare gift: a deep kindness and genuine time for everyone.\" Twenty-three vehicles were already taken out of use after soldiers fell ill from noise and vibration. Families who lost loved ones in the 1994 Chinook helicopter crash met government ministers for the first time in London. Twelve of the 30 jobs that the maintenance contract will support will be based in Oxford. The application was made by lawyers acting for two families whose relatives were killed in the mid-1970s by the so-called Glenanne gang. The overhaul comes as the minister for armed forces warns \"the shadow of war is knocking on Europe's door\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c80xjkm0283o",
        "title": "Ukraine struggling to keep lights on under Russian attack, says energy boss",
        "content": "Ukraine's biggest private energy provider is living in permanent crisis mode because of Russian attacks on the grid, its chief executive has told the BBC. Most of Ukraine is suffering from lengthy power cuts as temperatures drop and Maxim Timchenko, whose company DTEK provides power for 5.6 million Ukrainians, says the intensity of strikes has been so frequent \"we just don't have time to recover\". President Volodymyr Zelensky said on Tuesday that Russia knew the winter cold could become one of its most dangerous weapons. \"Every night Ukrainian parents hold their children in basements and shelters hoping our air defence will hold,\" he told the Dutch parliament. As the fourth anniversary of Russia's full scale invasion approaches, Maxim Timchenko says Russia has repeatedly targeted DTEK's energy grid with \"waves of drones, cruise and ballistic missiles\" and his company has found it difficult to cope. Tens of thousands of people in the southern city of Odesa have been without electricity for three days this week, following a co-ordinated Russian attack. \"Life has been difficult, but people are very supportive of each other,\" says Yana, who is among those lucky enough still to have power. She has invited friends to her home to charge their phones. Power outages also cut off heat and water supplies and Yana says those still connected to the grid have offered strangers the chance to wash or take a shower. Across Ukraine electricity is being rationed – with supplies turned on for a few hours each day. Many Ukrainians rely on power banks and generators as a back-up, and the sound of generators in the capital is now more constant than the air raid warnings. Kyiv resident Tetiana says the first thing she does in the morning is to check her phone to find out the daily schedule for when her power will be switched on. Like many she has invested in power banks to make life more bearable: \"You need to remember when you leave home to leave the powerbanks on so that you have them charged when you get back home.\" About 50% of Ukraine's energy is currently supplied by three large nuclear power plants in central and western Ukraine. But the network that transfers that power has been severely damaged. DTEK runs about 5 power stations, most of them fuelled by coal. One was recently targeted by five 5 ballistic missiles and Mr Timchenko said some of their power plants and sub stations had been attacked \"every three or four days\". \"I don't remember a single day when I had no reports about some damage to our grid.\" Finding spare parts to repair damaged equipment has become a significant challenge. The energy provider used to be able to source equipment from within Ukraine, but now it has to scour the ret of Europe for replacement parts. This year DTEK has had to spend $166m (£123m) on repairing its damaged thermal power plants and coal facilities. \"We will not give up,\" Maxim Timchenko insists: \"We have a responsibility to millions of mothers to have power and heat\". DTEK's origins are in the Donbas in Eastern Ukraine where the fighting is fiercest and where power supplies have been disrupted the most. Eight of its engineers have been killed doing their job. \"Every day they risk their lives to keep power in this area,\" Mr Timchenko said. Additional reporting by Anastasia Levchenko and Kyla Herrmannsen. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/clyzzxggl7go",
        "title": "What it would take to stop Putin fighting in Ukraine",
        "content": "Vladimir Putin may have a reputation among some as a ruthless autocrat, a master manipulator of the international scene. But one thing Russia's president does not have is a poker face. The late US Senator John McCain used to joke that when he looked into Putin's eyes, he saw three things, \"a K and a G and a B\", a reference to his past life as a Soviet intelligence officer. I thought of this as I watched footage of Russia's leader sitting opposite American envoys in the Kremlin. He could not hide his emotions; he exuded an air of supreme confidence. For President Putin reckons the diplomatic tide has turned in his favour, with an improved relationship with America and gains on the battlefield. Some analysts say Putin has no incentive to retreat from his demands: that Ukraine gives up the last 20% of Donetsk it still controls; that all occupied territory is recognised internationally as Russian; that Ukraine's army is curtailed to a point of impotence; and Nato membership is ruled out forever. As things stand, there are a few possible scenarios. The first is that US President Donald Trump may try to force Ukraine into a ceasefire on terms unwelcome to its people, one that cedes territory and lacks sufficient security guarantees to deter future Russian aggression. If Ukraine demurs or Russia vetoes, President Trump has hinted he could wash his hands of the war; last week, he said \"sometimes you have to let people fight it out\". He could remove the vital US intelligence Ukraine needs to detect incoming Russian drones and target Russian energy facilities. Another possibility is that the war could just stumble on with Russia's forces continuing to make slow advances in the east. The Trump administration's new national security strategy implied that Russia is no longer an \"existential threat\" to the US, and urged the US to \"re-establish strategic stability\" with Russia. So, with American support for Ukraine in serious question, what - if anything - could potentially change Putin's mind? And what else could Ukraine, Europe and even China, do differently? At the moment, the continent is preparing for a ceasefire. Under the banner of the \"coalition of the willing\", it is preparing an international military force to help Ukraine deter future Russian invasion, alongside a financial effort to help reconstruct the war-ravaged country. But some officials suggest that Europe should instead prepare for the war to muddle on. They want to help Ukraine not only \"win the fight tonight\", with more drones and cash; but also provide longer term support and prepare for a 15 to 20 year war with Russia. Europe could also do more to help protect Ukrainian skies from drones and missiles. There is already a plan – called the European Sky Shield Initiative – which could be expanded to allow European air defences to protect western Ukraine. Others argue European troops could be deployed to western Ukraine to help patrol borders, freeing up Ukrainian soldiers to fight on the front line. Most proposals such as this have been rejected for fear of provoking Russia or escalating the conflict. Keir Giles, senior consulting fellow at the Russia and Eurasia programme at Chatham House think tank, said these fears were based on \"nonsense\" because Western troops were already present on the ground and Sky Shield could be deployed in western Ukraine with little chance of any clash with Russian aircraft. European leaders, in his view, had to \"insert themselves into the conflict in a manner that will actually make a difference\". Mr Giles said: \"The only thing that will unarguably, undeniably stop Russian aggression is the presence of sufficiently strong western forces where Russia wants to attack, and the demonstrated will and resolve that they will be used to defend.\" This strategy would of course come with huge political difficulty - with some voters in western Europe unwilling to risk a confrontation with Russia. Few analysts expect Ukraine to reverse the tide and make actual territorial gains of its own. Having spent several weeks in Ukraine recently, I heard no mention of any Spring offensive, only the need to slow Russia's advance and increase the price it pays in blood and treasure. Some western diplomats claim Russia's generals are lying to the Russian president, pretending the situation on the ground is better than it is - adding to what they see as a deliberate strategy to exaggerate Russian gains, designed to suggest Ukraine is on the back foot and should thus sue for peace. According to Thomas Graham in Foreign Affairs, in this year, Russia has seized only 1% of Ukrainian territory at a cost of more than 200,000 dead and wounded. Fiona Hill, senior fellow at the Center on the United States and Europe at the Brookings Institution, who served on Trump's national security council during his first term, says the biggest thing Putin has in his favour is that many people believe Ukraine is losing. \"Everyone is talking of Ukraine as the loser when it now has the most potent military in Europe,\" she says. \"Just think what they have done to Russia. It is remarkable they have held off for so long not least fighting with one hand behind their back.\" Then there's the lever of sanctions. Certainly, Russia's economy is suffering. Inflation at 8%, interest rates 16%, growth slowed, budget deficits soaring, real incomes plunging, consumer taxes rising. A report for the Peace and Conflict Resolution Evidence Platform says Russia's war economy is running out of time. \"The Russian economy is substantially less able to finance the war than it was at the beginning of it in 2022,\" the authors say. But so far none of this appears to have changed much Kremlin thinking, not least because businesses have found ways of evading restrictions, such as transporting oil on unregistered ghost ships. Tom Keatinge, director of the Centre for Finance and Security at Rusi, said western messaging about sanctions was convoluted and there were too many loopholes. Russia would, he said, work around recent US sanctions on two Russian oil giants, Lukoil and Rosneft, just by re-labelling the exported oil as coming from non-sanctioned companies. Mr Keatinge said if the West really wanted to hurt Russia's war economy, it would embargo all Russian oil and fully implement secondary sanctions on countries that still buy it. \"We need to stop being cute and go full embargo,\" he said. \"We need to take our implementation of sanctions as seriously as the Kremlin takes circumvention.\" In theory, sanctions could also affect Russian public opinion. In October, a survey by the state-run Public Opinion Research Centre (VCIOM) said 56% of respondents said they felt \"very tired\" of the conflict, up from 47% last year. But the consensus among Kremlinologists is that much of the Russian public remains supportive of Putin's strategy. The European Union could agree to use about €200bn (£176bn) of frozen Russian assets to generate a so-called \"reparation loan\" for Ukraine. The latest European Commission proposal is to raise €90bn (£79bn) over two years. In Kyiv, officials are already banking on getting the cash. But still the EU hesitates. Belgium, where the bulk of the Russian assets are held, has long feared being sued by Russia - and on Friday, the Russian Central Bank announced legal action against Belgian bank Euroclear in a Moscow court. Belgium says it will not agree the loan unless legal and financial risks are shared more explicitly with other EU members. France has concerns, such is its own vast debts, and fears exploiting the frozen assets could undermine the stability of the eurozone. EU leaders will make a further attempt to agree a deal when they meet in Brussels on 18 December for their final summit before Christmas. But diplomats say there is no guarantee of success. There is also disagreement over what the cash should be used for: keeping Ukraine's state solvent now or paying for its reconstruction after the war. As for Ukraine, it could mobilise more of its armed forces. It remains the second-biggest army in Europe (behind Russia), and the most technically advanced - but it is nonetheless struggling to defend an 800-mile frontline. After almost four years of war, many soldiers are exhausted and desertion rates are rising. Army recruiters are finding it harder to fill gaps as some younger men hide from press gangs or flee the country. But Ukraine could widen its conscription laws. Currently only men aged 25 to 60 must be available to fight. This is a deliberate strategy by Kyiv to manage Ukraine's demographic challenges; a country with a low birth rate and millions living abroad cannot afford to lose what have been dubbed \"the fathers of the future\". This puzzles outsiders. \"I find it incredible that Ukraine has not mobilised its young people,\" one senior UK military figure told me. \"I think Ukraine must be one of the only countries in history facing an existential threat that has not thrown its mad 20-year-olds into the fight.\" Fiona Hill said Ukraine had simply learned the lesson of history and the devastating impact World War One had on 20th Century European empires, which declined after failing to rediscover the population growth that had fuelled their economic rise. \"Ukraine is just thinking of their demographic [future].\" If Ukraine could import and manufacture more long-range missiles, it could hit Russia harder and deeper. This year it stepped up its air strikes on targets both in occupied territory and the Russian Federation. Earlier this month Ukraine's military commanders told Radio Liberty they had hit more than 50 fuel and military-industrial infrastructure facilities in Russia during the autumn. Alexander Gabuev, director of the Carnegie Russia Eurasia Center, says some Russians experienced fuel shortages earlier this year. \"By late October, Ukrainian drones had hit more than half of Russia's thirty-eight major refineries at least once. \"Production outages spread across multiple regions, and some Russian gas stations began rationing fuel.\" But would more deep strikes on Russia make an impact, when both the Kremlin and public opinion in Russia seem indifferent? Mick Ryan, former Australian major general and now fellow of the Center for Strategic and International Studies, says deep strikes are not a magic bullet. \"They are an extraordinarily important military endeavour, but insufficient by themselves to force Putin to the negotiating table or to win the war.\" Dr Sidharth Kaushal, senior research fellow in military sciences at the Royal United Services Institute (Rusi) think tank, said more deep strikes would certainly damage Russia's energy and military infrastructure, as well as using up its air defence missiles. But he warned the tactic could be counterproductive. \"It could reinforce the argument the Russian leadership makes that an independent Ukraine poses a massive military threat,\" he said. There's also - still - a diplomatic route. Some analysts argue that if Putin is offered a way out of the war, he may choose it. The theory goes like this: a deal is agreed that allows both sides to claim victory. Say, a ceasefire along the line of contact; some areas demilitarised; no formal territorial recognition. Compromises all round. But the deal would require the US to engage hard with Russia, setting up negotiating teams, using its power to drive through agreement. \"The United States… needs to deploy its formidable psychological leverage it possesses over Russia,\" Thomas Graham argues. \"One cannot overstate the role the United States – and Trump personally – plays in validating Russia as a great power and Putin as a global leader.\" The wild card is China. President Xi Jinping is one of the few world leaders Putin listens to. When Xi warned earlier in the conflict against Russian threats of nuclear weapon use, the Kremlin fell swiftly in line. Russia's war machine is also hugely dependent on China's supply of dual use goods – such as electronics or machinery that can be used for civilian and military purposes. So if Beijing decided it was no longer in China's interests for the war to continue, then it would have substantial leverage over Kremlin thinking. For now, the US shows no sign of trying to encourage – or force – China to put pressure on Moscow. So the question is whether President Xi would be willing to apply any leverage off his own bat. At the moment China seems happy for the US to be distracted, for transatlantic allies to be divided, and for the rest of the world to view China as a source of stability. But if Russia's invasion escalated, if global markets were disrupted, if the US applied secondary sanctions on China in punishment for its consumption of cheap Russian energy, then the thinking in Beijing might change. For now though, Putin believes he is sitting pretty, with time on his side. The longer this conflict goes on, analysts say, the more Ukrainian morale will fall, the more divided its allies will become, and the more territory Russia will gain in Donetsk. \"Either we liberate these territories by force of arms or Ukrainian troops leave these territories,\" Putin said last week. \"Nothing will change his position,\" Fiona Hill told me. \"Unless he exits stage left. Putin is betting right now that he can keep this going for long enough that circumstances play out to his advantage.\" Top picture credit: Reuters BBC InDepthis the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published -click here to find out how. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c0l9954yr9ko",
        "title": "One million households without power in Ukraine after Russia attacks energy grid",
        "content": "More than a million households are without electricity in Ukraine after a barrage of overnight Russian strikes hit energy and industrial infrastructure, officials said. Ukraine's internal affairs minister, Ihor Klymenko, said five regions were hit and at least five people were injured, and work was under way to extinguish fires and restore supplies. While Russian attacks on Ukrainian energy infrastructure have been common throughout the war, Moscow has intensified strikes as the country heads into winter. It comes as US President Donald Trump's overseas envoy will travel to Germany this weekend to meet Ukrainian President Volodymyr Zelensky and European leaders for more talks on ending the war. Steve Witkoff, who has been leading White House attempts to mediate between Ukraine and Russia, will discuss the latest version of the proposed peace agreement in Berlin. On Saturday, Zelensky said more than 450 drones and 30 missiles were used by Russia in overnight strikes. Klymenko said the Dnipropetrovsk, Kirovohrad, Mykolaiv, Odesa and Chernihiv regions were hit. Russia's defence ministry said it used weapons including Kinzhal hypersonic missiles in the strikes - which are hard to track as they can change direction mid-flight. The International Atomic Energy Agency (IAEA) said Ukraine's Zaporizhzhia nuclear power plant temporarily lost all offsite power overnight \"due to widespread military activities affecting the electrical grid\", but is now reconnected. The plant is in Russian-controlled territory in Ukraine. It is not operating, but relies on a constant power supply to cool its reactors. In Russia, regional governor Roman Busargin said two people were killed in Saratov after a drone strike hit a residential building. The Trump administration is pushing for a deal to end the war to be in place by Christmas and has held several rounds of talks with Ukrainian and Russian representatives in recent weeks, though there has been little sign a breakthrough is imminent. It has not yet been confirmed which European leaders will attend the Berlin talks. The Wall Street Journal, which first reported details of the meeting, said UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz would all take part. The Witkoff-Zelensky meeting comes after Ukraine gave the US its revised version of a 20-point peace plan, the latest iteration of a proposal which first emerged in late November and has triggered a flurry of diplomatic activity. The fate of territory in eastern Ukraine remains one of the most intractable topics in the negotiations, with Kyiv refusing to cede land which has been illegally occupied, and Moscow repeating its intention to take the Donbas region in full by force unless Ukraine withdraws. Zelensky hasreacted sceptically to the White House's latest proposalon resolving the territorial question, which is for Ukraine's army to pull out of the region and for it to be turned into a \"special economic zone\". The Ukrainian president told reporters that under the US-proposed terms, the Kremlin would undertake not to advance into the areas vacated by Ukraine's forces, with the land between Russian-controlled parts of the Donbas and Ukraine's defensive lines effectively turned into a demilitarised zone. \"What will restrain [Russia] from advancing? Or from infiltrating disguised as civilians?\" said Zelensky. In public, Ukraine and its allies in Europe have described the US-led talks as fruitful, and have hailed progress on securing amendments to a plan which was widely viewed as favouring Russia when it first emerged. But there have been signs in recent weeks that Trump is losing patience with Zelensky and his backers on the continent. In ascathing interview with Politico earlier this week, the US president labelled European leaders \"weak\" and renewed his calls for Ukraine to hold elections. Zelensky said elections could be held within 90 days if the US and Europe provided the necessary security. Elections have been suspended since martial law was declared when Russia launched its full-scale invasion in February 2022. As the White House's diplomatic push continues, attention in Europe is focused on how to support Ukraine in the event of a peace deal, with talks ongoing over security guarantees and funding. The Ukrainian government faces a stark financial situation: it needs to find an extra €135.7bn (£119bn; $159bn) over the next two years. On Friday, EU nationsagreed to indefinitely freeze around €210bn (£185bn; $247) worth of Russian assetsheld in Europe. It is hoped the agreement paves the way for the funds to be loaned back to Ukraine if a deal can be reached at an EU summit next week, providing Kyiv with financial help for its military and efforts to rebuild parts of the country left devastated after nearly four years of all-out war. That move has been condemned as theft by the Kremlin, and Russia's central bank has said it will sue Euroclear, a Belgian bank where the vast majority of Russian assets frozen after the invasion are held. Officials are still negotiating the exact structure of a deal to repurpose the Russian assets on behalf of Ukraine, with the Belgian government particularly sceptical due to its legal exposure as the main holder. Elsewhere, it was reported that the latest version of the peace plan being circulated envisions Ukraine rapidly joining the European Union. The Financial Times said Brussels backed Ukraine's swift accession to the bloc, an idea proposed by Ukraine in the latest draft it has given to Washington. Ukraine formally applied to join the EU days after the 2022 invasion, but despite promises of an accelerated process is still several years away from becoming a member. Under the plan, Ukraine would become a member as soon as January 2027, AFP reported, citing an unnamed senior official. It was unclear whether Washington had approved that element of the draft. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cqlkk9qk7vyo",
        "title": "Ukraine's health supplies hit in series of Russian strikes on medical warehouses",
        "content": "Warehouses supplying the vast majority of Ukraine's pharmacies have been destroyed in a series of Russian attacks over recent months. Medical supplies worth about $200m (£145m) were destroyed in just two strikes in December and October. A large warehouse storing medicines in the city of Dnipro was destroyed in a Russian air strike on 6 December. As a result, about $110m worth of medicines were destroyed - estimated at up to 30% of Ukraine's monthly supply. \"It was a missile and drone strike against our facility. The missiles flew past, but the drones hit it,\" said Dmytro Babenko, acting director-general of pharmaceutical distributor BADM. \"They caused a fire which unfortunately proved impossible to contain and the whole facility was destroyed.\" BADM is one of two companies that supply about 85% of Ukrainian pharmacies in roughly equal shares. The other company is Optima Pharm, whose warehouses have been hit three times this year - on 28 August, 25 October and 15 November. The October attack destroyed its main storage facility in Kyiv, and cost the company more than $100m, says Optima Pharm's chief financial officer Artem Suprun. Russia denies hitting civilian targets, but when the Optima Pharm warehouse was hit in October, the defence ministry in Moscow said only that it had targeted a factory producing drones. On the day BADM's warehouse was destroyed, Russia said it had hit \"a warehouse storing military equipment\" as well as energy and transport infrastructure. Such attacks significantly complicate the treatment of sick and wounded in Ukraine,   after almost four years of Russia's full-scale war. The International Rescue Committee (IRC), an NGO that had been using the warehouse in Dnipro, says it lost $195,000 worth of medication and supplies, which could have served 30,000 people in need. \"When I arrived at the site I was devastated, the scene was simply awful. All of this medicine could have served people for years, and in a single moment it was all lost,\" says the IRC's Andriy Moskalenko. The IRC said the Dnipro facility had served \"as a critical hub for hospitals, healthcare providers, pharmacies and humanitarian actors\". Mr Babenko from BADM said the Russian attack had destroyed \"vitally important medicines\" that had been imported and are not produced in Ukraine. \"It's a pretty complicated situation,\" he told the BBC. But he is hopeful that the attack will not leave Ukrainians without medicines. \"There won't be significant shortages, possibly only of certain types of goods. We're hoping to restore all supplies in a month or a month-and-a-half,\" Mr Babenko said. Ukrainian authorities accuse Russia of deliberately targeting hospitals, ambulances, medics and rescue workers, claims Moscow has denied. According to the government in Kyiv, more than 2,500 medical institutions have been damaged or destroyed, and more than 500 civilian doctors, nurses and other medical workers killed. Earlier this month, the World Health Organization said it had recorded 2,763 attacks on Ukraine's healthcare system since the start of Russia's full-scale invasion, and it said that in 2025 there had been a 12% increase in attacks from the previous year. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c5yjj2epvlro",
        "title": "Turkish car ferry damaged in strike at Ukrainian port",
        "content": "A large fire broke out on a Turkish car ferry anchored at the Ukrainian port city of Odesa after it was hit in a strike on Friday. The company that operates the Cenk T confirmed the attack occurred at 16:00 local time (14:00 GMT) shortly after it docked at the Chornomorsk port. Ukraine's President Volodymr Zelensky has blamed the strike on Russia, which has not commented. The attack came hours after Turkish President Tayyip Erdogan told Russian President Vladimir Putin that a limited ceasefire for energy facilities and ports could be beneficial. Russia has resisted all calls for a ceasefire. Moscow has threatened to cut \"Ukraine off from the sea\" in response to Kyiv'smaritime drone attacks on Russia's \"shadow fleet\"tankers thought to be used to export oil - and a main source for funding the ongoing war. Cenk Denizcilik, the company that owns the cargo ship that operates on the Karasu-Odesa route across the Black Sea, said on Friday that it had been carrying \"essential food supplies\" when it was hit shortly after anchoring at the Ukrainian port city. Emergency response measures were immediately activated with the vessel's crew, port fire brigade and assisting tugboats after a fire broke out on the forward section of the ship, the company's statement added. \"At this stage, there are no reports of casualties or injuries among the crew,\" it said. Video footage of the attack's aftermath, which was shared on Zelensky's Telegram account, shows crews attempting to extinguish a large blaze on the vessel. While condemning a series of missile attacks that Russia had carried out on the Odesa region the night before, the Ukrainian leader blamed Moscow for targeting the civilian Turkish ship, saying it \"could not have any military meaning\". Turkey's foreign ministry said an agreement should be reached that would guarantee \"the security of shipping and suspending attacks against energy and port infrastructure in order to prevent escalation in the Black Sea\". \"We once again underline the importance of urgently ending the war between Russia and Ukraine,\" the ministry said. Turkey has sought to maintain relations with the two warring countries since Russia's full-scale invasion of Ukraine began in February 2022. It also controls the Bosphorus Strait, which is a key passage for transporting Ukrainian grain and Russian oil out to the Mediterranean. Russia carried out a second round of strikes on Odesa later in the evening which damaged the port infrastructure facility, according to the region's head of administration. \"[This] emphasises the deliberate nature of enemy strikes on the civilian infrastructure of the region,\" Oleg Kiper wrote in a Telegram post. Friday's strikes knocked out electricity for thousands of homes in Odesa. This comes as US President Donald Trump appears to have grown frustrated by the slow progress his administration is making in securing a deal to end the war between Ukraine and Russia. Despite Washington's recent diplomatic push, Kyiv and Moscow have rejected key parts of the Trump administration's proposal. While Ukraine is adamant that there should be security guarantees from the US and Europe in place before agreeing to an end to the war, Russia is continuing to demand territorial concessions - which Kyiv has resisted. Russia has been making slow gains on the ground recently. But claims it is in control of key hubs, such as the key town of Pokrovsk - a strategic point on a big road and rail artery in the eastern  Donetsk region - are being denied by the Ukrainians. And in a show of defiance on Friday, President Zelensky posted a video of himself in  Kupyansk - which Moscow claimed to have captured last month. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. EU leaders said the loan would be repayable only when Russia paid reparations for the war. EU leaders agreed to loan Ukraine €90bn to stay financially afloat for the next two years. There are no official statistics surrounding suicide among Ukrainian soldiers, but they are thought to count in the hundreds. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c98nnd01g91o",
        "title": "EU backs indefinite freeze on Russia's frozen cash ahead of loan plan for Ukraine",
        "content": "European Union governments have agreed to immobilise indefinitely Russian assets of up to €210bn (£185bn) that have been frozen in the EU since the start of Russia's full-scale invasion of Ukraine. Most of Moscow's cash is held in Belgian bank Euroclear, and European leaders are hoping to agree a deal at next week's crunch EU summit that would use the money for a loan to help Kyiv fund its military and economy. After almost four years of Russia's full-scale war Ukraine is running out of cash, and needs an estimated €135.7bn (£119bn; $159bn) over the next two years. Europe aims to provide two-thirds of that, but Russian officials accuse the EU of theft. The Russian Central Bank said on Friday it was suing Belgian bank Euroclear in a Moscow court, in response to the EU loan plan. Russia's assets in the EU were frozen within days of the full-scale invasion of Ukraine in February 2022, and €185bn of that is held by Euroclear. The EU and Ukraine argue that money should be used to rebuild what Russia has destroyed: Brussels calls it a \"reparations loan\" and has come up with a plan to prop up Ukraine's economy to the tune of €90bn. \"It's only fair that Russia's frozen assets should be used to rebuild what Russia has destroyed – and that money then becomes ours,\" says Ukraine's Volodymyr Zelensky. German Chancellor Friedrich Merz says the assets will \"enable Ukraine to protect itself effectively against future Russian attacks\". Russia's court actionwas expected in Brussels and European Economic Commissioner Valdis Dombrovskis said on Friday that EU financial institutions were \"fully protected\" from legal proceedings. But it is not just Moscow that is unhappy. Belgium is worried it will be saddled with an enormous bill if it all goes wrong and Euroclear chief executive Valérie Urbain says using it could \"destabilise the international financial system\". Euroclear also has an estimated €16-17bn immobilised in Russia. Belgian Prime Minister Bart De Wever has set the EU a series of \"rational, reasonable, and justified conditions\" before he will accept the reparations plan, and he has refused to rule out legal action if it \"poses significant risks\" for his country. The EU is working to the wire ahead of next Thursday's summit to come up with a solution that Belgium can accept. Until now the EU has held off touching the assets themselves directly but since last year has paid the \"windfall profits\" from them to Ukraine. In 2024 that was €3.7bn. Legally using the interest is seen as safe as Russia is under sanction and the proceeds are not Russian sovereign property. But international military aid for Ukraine has slipped dramatically in 2025, and Europe has struggled to make up the shortfall left by the US decision to all but stop funding Ukraine under President Donald Trump. There are currently two EU proposals aimed at providing Ukraine with €90bn, to cover two-thirds of its funding needs. One is to raise the money on capital markets, backed by the EU budget as a guarantee. This is Belgium's preferred option but it requires a unanimous vote by EU leaders and that would be difficult when Hungary and Slovakia object to funding Ukraine's military. That leaves loaning Ukraine cash from the Russian assets, which were originally held in securities but have now largely matured into cash. That money is Euroclear property held in the European Central Bank. The EU's executive, the European Commission, accepts Belgium has legitimate concerns and says it is confident it has dealt with them. The plan is for Belgium to be protected with a guarantee covering all the €210bn of Russian assets in the EU. Should Euroclear suffer a loss of its own assets in Russia, a Commission source explained that would be offset from assets belonging to Russia's own clearing house which are in the EU. If Russia went after Belgium itself, any ruling by a Russian court would not be recognised in the EU. In a key development, EU ambassadors have agreed that Russia's central bank assets held in Europe should be immobilised indefinitely. Until now they have had to vote unanimously every six months to renew the freeze, which could have meant a repeated risk to Belgium. The EU ambassadors used an emergency clause under Article 122 of the EU Treaties so the assets remain frozen as long as an \"immediate threat to the economic interests of the union\" continues, or until Russia pays war reparations to Ukraine in full. Swedish Finance Minister Elisabeth Svantesson said the decision was an \"important step in enabling more support for Ukraine and protecting our democracy\". Belgium is adamant it remains a staunch ally of Ukraine, but sees legal risks in the plan and fears being left to handle the repercussions if things go wrong. A usually divided political landscape in this case has rallied behind Prime Minister Bart De Wever, who is under pressure from European colleagues. \"Very important decisions\" would be made by the EU in the coming week, he said during a meeting with UK Prime Minister Sir Keir Starmer in London on Friday. He added that Belgium and the UK would work together to \"get the certainty that we can support Ukraine to stay a free, democratic and sovereign country\". The EU believes it can secure sufficient guarantees for the loan itself, but Belgium fears an added risk of being exposed to extra damages or penalties. \"Belgium is a small economy. Belgian GDP is about €565bn – imagine if it would need to shoulder a €185bn bill,\" says Veerle Colaert, professor of financial law at KU Leuven University. She also believes the requirement for Euroclear to grant a loan to the EU would violate EU banking regulations. \"Banks need to comply with capital and liquidity requirements and shouldn't put all their eggs in one basket. Now the EU is telling Euroclear to do just that. \"Why do we have these bank rules? It's because we want banks to be stable. And if things go wrong it would fall to Belgium to bail out Euroclear. That's another reason why it's so important for Belgium to secure water-tight guarantees for Euroclear.\" There is no time to lose, warn seven EU member states including those closest geographically to Russia such as the Baltics, Finland and Poland. They believe the frozen assets plan is \"the most financially feasible and politically realistic solution\". \"It's a matter of destiny for us,\" says leading German conservative MP Norbert Röttgen. \"If we fail, I don't know what we'll do afterwards. That's why we have to succeed in a week's time\". While Russia is adamant its money should not be touched, there are added concerns among European figures that the US may want to use Russia's frozen billions differently, as part of its own peace plan. Zelensky has said Ukraine is working with Europe and the US on a reconstruction fund, but he is also aware the US has been talking to Russia about future co-operation. An early draft of the US peace plan referred to $100bn of Russia's frozen assets being used by the US for reconstruction, with the US taking 50% of the profits and Europe adding another $100bn. The remaining assets would then be used in some kind of US-Russia joint investment project. An EU source said the added advantage of Friday's expected vote to immobilise Russia's assets indefinitely made it harder for anyone to take the money away. Implicit is that the US would then have to win over a majority of EU member states to vote for a plan that would financially cost them an enormous sum. Hungary's Viktor Orban, seen as Russia's closest partner in the EU, said Europe's leaders were \"placing themselves above the rules\" and replacing the rule of law with the rule of bureaucrats. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cgjnd9y52pno",
        "title": "US wants 'special economic zone' in Ukraine's frontline region, Zelensky says",
        "content": "The US has proposed Ukraine withdraw from the eastern Donetsk region and create a \"special economic zone\" in the areas it currently controls, Ukrainian President Volodymyr Zelensky has said. Zelensky said territory and control of the Zaporizhzhia nuclear power plant remained the two main unresolved issues in the peace plan proposal for Ukraine. In a sobering briefing to reporters, Zelensky addressed the US desire for a quick end to the conflict, the complex nature of the ongoing negotiations, and his belief that Russia had no desire to stop the war. Ukraine has sent the US an updated 20-point plan plus separate documents on security guarantees and provisions for Ukraine's reconstruction, Zelensky said. It follows weeks of high-level diplomatic activity which has seen several peace plans drawn up, adjusted and revised by the US, Ukraine, Russia and European leaders. \"The final mile is the hardest. Everything could fall apart for many reasons,\" Zelensky said on Thursday. Russia demands that Ukraine relinquish control of roughly 30% of the eastern Donetsk region it still holds - something Ukraine has refused to do, both on principle and because it fears it would allow Moscow a foothold for future invasions. According to Zelensky, the US is now envisaging a solution that would see Ukrainian forces withdraw from parts of Donetsk, and Russian forces committing to not advancing into the territory. This area would become a \"special economic zone\" or a \"demilitarised zone\", Zelensky said. However, he noted that it would not be fair for the Ukrainians to withdraw unilaterally, and that Russia should also pull back by the same distance. \"What will restrain [Russia] from advancing? Or from infiltrating disguised as civilians?\" he asked. Zelensky said these were \"very serious concerns\" and that Ukraine might not accept the proposal at all – although he opened the door to elections or a referendum to give the Ukrainian people a choice. But he acknowledged that the fighting would continue and may yet shape the future of the negotiations: \"Much depends on our military – what they can hold, where they can stop the enemy, what they can destroy. This affects the entire configuration.\" The management of the Zaporizhzhia nuclear power plant was another highly contentious point, Zelensky said. The power plant – Europe's largest – sits on the front line and has been under Russian control since March 2022. Zelensky said a possible solution would be for the Russians to withdraw and Kyiv to share control of the plant with the Americans – although he acknowledged that the details of such an arrangement were still unclear, and it is doubtful that Moscow would agree. US President Donald Trump appears to have grown frustrated with the intricacies of the conflict, and Kyiv and its allies fear the Americans might eventually seek to impose a Russian-led solution on Ukraine. Zelensky told reporters that although the Americans wanted a \"quicker conclusion\" to the war, there were no deadlines for an agreement. Ukraine - which is targeted by widespread aerial attacks on a near-nightly basis - has been pushing for respite and would want an immediate ceasefire to be implemented ahead of a more laborious agreement being fleshed out. But Russia stands to gain more from a ceasefire being delayed, as its troops continue to make small but incremental gains on the frontline and its attacks exhaust the Ukrainian population. \"After multiple rounds of talks with Russia\" the Americans were now aligned on Moscow on this position, Zelensky said. Kremlin officials have been more tight-lipped than their European, US and Ukrainian counterparts. However, whenever possible, Russia has sought to cement the impression that Moscow and Washington are aligned on their hopes for the terms of a peace deal. On Thursday, Russian Foreign Minister Sergei Lavrov praised Trump for trying to broker a deal and said a recent meeting between President Vladimir Putin and US envoy Steve Witkoff at the Kremlin had \"eliminated\" the \"misunderstandings\" between the two sides. The foreign minister also batted off suggestions that Kyiv could be given security guarantees in the form of foreign troops stationed in Ukraine. \"This is yet another return to the sad logic of Zelensky's so-called peace formula,\" Lavrov said, adding that Moscow had handed the US \"additional\" proposals on collective security and that Russia was ready to give legal guarantees not to attack Nato or EU countries. But neither Ukraine nor Europe will be likely to take any promise by Moscow at face value, given Russia has previously violated ceasefires and truce deals. European and Ukrainian officials want the US to be involved in giving security guarantees so that Kyiv doesn't become the target of renewed attacks. Zelensky said he had received a draft proposal on American security guarantees but that the draft was a work in progress, suggesting that what has been offered by the US falls short of provisions that could assuage Kyiv's fears. \"The US does not want Ukraine in Nato. They say this openly... So I do not think they have difficulties discussing Nato with the Russians,\" Zelensky said. Zelensky also said Ukraine had to be \"cautious\", adding: \"We do not know what other agreements the US may have with Russia. We will learn in time.\" Ukraine's president also acknowledged that US support for Kyiv may one day end, both in terms of the flow of weapons that the US is selling through other countries and in terms of intelligence sharing. Reflecting the fraught nature of the talks and his scepticism that Russia was negotiating in good faith, Zelensky told reporters: \"No one knows what may happen the day after tomorrow... We do not know how these negotiations will end.\" Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/clydz0j1yego",
        "title": "Poland arrests Russian archaeologist wanted in Ukraine",
        "content": "Polish authorities have arrested a prominent Russian academic from St Petersburg's world-famous Hermitage Museum who is sought by Ukraine for allegedly conducting illegal excavations and partially destroying the ancient city of Myrmekion in Crimea. The suspect, identified under Polish law as Aleksandr B, is the head of the Ancient Archaeology of the Northern Black Sea region at the museum, according to Ukrainian prosecutors. Ukrainian prosecutors accuse him of conducting illegal excavations at the site in Kerch between February 2014 and November 2025. \"As a result of these excavations, from 2014-2019, he illegally partially destroyed the 'Ancient City of Myrmekion' archaeological complex,\" Prosecutor Piotr Skiba, a spokesman for the Warsaw District Prosecutor's Office told the BBC, citing information from Ukrainian prosecutors. Ukraine estimates the damage at UAH 201.6 million ($4.77 million). Russia invaded Crimea in February 2014 and annexed it. Russia's foreign ministry identified the man as Alexander Butyagin, an employee of the State Hermitage Museum and condemned his detention. \"This is absolute legal tyranny. We will of course demand through diplomatic channels the right to protect the interests of our citizen,\" Kremlin spokesman Dmitry Peskov said. Myrmekion was an Ancient Greek colony founded by the Ionians in the first half of the Sixth Century BCE located in contemporary Crimea. Prosecutor Skiba said the man was detained in Poland on 4 December and was later questioned by prosecutors in Warsaw, \"where he refused to provide explanations\". The Ukrainian Prosecutor's Office issued an extradition request for Aleksandr B in November, Skiba said. According to the request: \"He searched for movable objects on cultural heritage sites without the appropriate permit to conduct excavations at the 'Ancient City of Myrmekion' archaeological complex in Kerch….and conducted illegal excavations at this cultural heritage site from the beginning of the temporary occupation of the territory of Crimea\". Russia's foreign ministry said Butyagin had been invited to deliver lectures on Pompeii in Warsaw and several other European cities. Warsaw District Court has agreed to remand Aleksandr B in custody at the Warsaw-Białołęka detention centre for 40 days until 13 January whilst the extradition process goes ahead. The Russian embassy in Warsaw has been informed of his arrest and pre-trial detention and are providing him with consular assistance, Prosecutor Skiba said. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c5y20p7xweko",
        "title": "Intensive work continuing on Ukraine plan, European leaders say after Trump call",
        "content": "European leaders have said \"intensive work\" will continue in the coming days on a US-led plan to end the Russia-Ukraine war, after a joint phone call with President Donald Trump. UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz said they \"agreed that this was a critical moment - for Ukraine, its people and for shared security across the Euro-Atlantic region\". Trump later said \"we discussed Ukraine in pretty strong words\", admitting that there were \"some little disputes about people\". The joint call comes the day afterTrump called European leaders \"weak\", suggesting the US could scale back support for Ukraine. In the wide-ranging Politico interview published on Tuesday, Trump also claimed Ukraine was \"using war\" to avoid holding elections, promptingPresident Volodymyr Zelensky to reply he was \"ready\" for them. Russian President Vladimir Putin launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory. The three European leaders issued identical statements shortly after their call with Trump on Wednesday. They read: \"The leaders discussed the latest on the ongoing US-led peace talks, welcoming their efforts to achieve a just and lasting peace for Ukraine, and to see an end to the killing. \"Intensive work on the peace plan is continuing and will continue in the coming days.\" The call lasted for about 45 minutes, and was initiated by the Americans last night. Sources characterise progress as \"inching towards a deal\" - but emphasise the complexity of arriving at one. A key sticking point remains Ukrainian territory and whether it is viable or reasonable to expect Kyiv to effectively give up land regarded as its own. The longstanding formulation of the British government is that decisions about Ukraine have to be made by Ukraine. This is an argument European governments are making to Washington, while publicly and privately praising Trump's commitment to bringing an end to the war. National Security Advisers from around Europe, including the UK's Jonathan Powell, are meeting regularly with Ukrainian officials. Summaries of those conversations and others are then shared by allies with Washington. It is expected that were a point to be reached where a potential deal was arrived at, America would then lead a conversation with Moscow. At a White House briefing later on Wednesday, Trump admitted that \"strong words\" were used during the phone call. He said he was yet to decide on whether to agree with European proposals to hold more meetings this weekend involving Washington and Kyiv. \"We don't want to be wasting time,\" the US president said. He also called on Zelensky to be \"realistic\", saying that Ukrainians \"want a settlement... they wanna see it [the war] end\". Earlier on Wednesday, Zelensky wrote on social media that a 20-point document on how to end the war would be handed over to the US in \"the near future\" after \"our joint work with President Trump's team and partners in Europe\". The Ukrainian leader provided no further details. The original US draft peace plan - widely leaked to media last month - had 28 points, and was seen as favouring Russia. Ukraine has since held separate talks with US and European negotiators, seeking to change some key clauses such as territorial issues and security guarantees. Zelensky is under increasing pressure from Trump to agree to a peace deal to end the war, with the US president urging Kyiv to \"play ball\" by ceding territory to Moscow. Zelensky has repeatedly refused to do so, seeking instead an immediate ceasefire on the vast front line and iron-clad security guarantees for Kyiv in any future settlement. The Ukrainian leader is on a diplomatic tour of Europe following intensive talks between US and Ukrainian negotiators over the weekend which failed to produce a deal to which Kyiv could agree. Zelensky has been pressing his European allies to help deter the US from backing an agreement that could leave Ukraine exposed to future attacks by Russia. Meanwhile, the Kremlin said Trump's \"very important\" statements on Ukraine, including saying Moscow would win the war and that Kyiv would need to hand over land, align with Russia's view. \"In many ways, on the subject of Nato membership, on the subject of territories, on the subjects of how Ukraine is losing land, it is in tune with our understanding,\" Putin's spokesman Dmitry Peskov said. Last week, Putin repeated his warning thatUkrainian troops must completely withdraw from Ukraine's eastern Donbas regionor Russia will seize it, rejecting any compromise over how to end the war. In recent weeks Russian troops have continued their slow advance in south-eastern Ukraine - despite reported heavy combat casualties. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cn5l1474yv7o",
        "title": "Ukraine 'ready for elections' if partners guarantee security, Zelensky says",
        "content": "Ukraine is \"ready for elections\", President Volodymyr Zelensky has said, after US President Donald Trump repeated claims Kyiv was \"using war\" to avoid holding them. Zelensky's five-year term as president was due to end in May 2024, but elections have been suspended in Ukraine since martial law was declared after Russia's full-scale invasion in February 2022. Speaking to reporters following Trump's comments in a wide-ragingPolitico interview, Zelensky said he would ask for proposals to be drawn up which could change the law. Elections could be held in the next 60 to 90 days if security for the vote was guaranteed with the help of the US and other allies, he said. \"I'm asking now, and I'm stating this openly, for the US to help me, perhaps together with our European colleagues, to ensure security for the elections,\" he told reporters. \"The issue of elections in Ukraine, I believe, depends first and foremost on our people, and this is a question for the people of Ukraine, not the people of other countries. With all due respect to our partners,\" Zelensky said. \"I've heard hints that we're clinging to power, or that I personally am clinging to the presidency\" and \"that's why the war isn't ending\", which he called \"frankly, a completely unreasonable narrative\". Zelenskywon the election in 2019with more than 73% of the vote. Discussions around holding elections have made headlines since Russia's full-scale invasion of Ukraine. Moscow has consistently claimed Zelensky is an illegitimate leader and demanded new elections as a condition of a ceasefire deal – a talking point which has been repeated by Trump. \"They talk about a democracy, but it gets to a point where it's not a democracy anymore,\" the US president told Politico. There are significant practical obstacles to a wartime election. Soldiers serving on the front lines could be either unable to vote or require leave to do so. According to the UN, there are about 5.7 million Ukrainians living abroad because of the conflict. And any ballot would require complex, additional security measures. Such a vote would only be fair if all Ukrainians could participate, including soldiers fighting on the front line, a Ukrainian opposition MP told the BBC. Lesia Vasylenko of Golos also told the BBC World Service's Newsday programme that \"elections are never possible in wartime\", alluding to the suspension of elections in the UK during World War Two. Oleksiy Goncharenko, an opposition MP from the European Solidarity party, said: \"I am completely against the idea, I can't even understand why Zelensky would say it.\" \"It is completely impossible,\" he said, adding that elections involve an entire process of debates and campaigns. \"Maybe Zelensky sees it as an opportunity to hold quasi-elections that will be favourable to him, while he controls the media and his opponents are likely not ready.\" There is little domestic political pressure on Zelensky to call elections while the conflict is ongoing, said Oleksandr Merezhko, the chairman of the foreign policy committee in Ukraine's parliament. There was \"strong consensus\" among politicians and civil organisations that elections would not be held under martial law, the MP from the Servant of the People - Zelensky's party - told the BBC. \"Even the opposition, which is against Zelensky and would like to see him removed are against elections, because they understand the danger of attempting to hold elections during the war,\" he said. The idea was \"exactly what Putin would want\", Merezhko added. \"An election campaign would be divisive. Having failed to destroy us from outside, Putin wants to destroy us from within, using elections as another tool to do so.\" There is no widespread public support in Ukraine for elections, Anton Grushetsky, director of the Kyiv International Institute of Sociology, told the BBC. According to data gathered over the past week, he said, only about 10% of the population supports the idea of going to the polls before a ceasefire or peace agreement. A poll by the Kyiv International Institute of Sociology (KIIS) in September found about 63% of people opposed holding elections after a ceasefire with security guarantees and were of the opinion they could only be held after a complete settlement. Zelensky remains Ukraine's most popular politician, with 22.3% of those polled in October saying they would vote for him if elections were held,according to Socis. He is closely followed by Gen Valerii Zaluzhnyi, the ambassador to the UK, with 21.3%, who has not indicated whether he would run in an election. Yulia Tovkach, who owns a shoe business in Bucha near Kyiv, said she thought it was vital for Ukraine to end martial law before any election. \"If we don't, we will be accused of not having a legitimate, proper election,\" she said. \"And to end martial law, we need a truce with security guarantees.\" Yana Kolomiets, a casting director based in the southern city of Odesa, said she thought the idea of holding an election was \"foolish\", even if she was dissatisfied with Zelensky's leadership. \"It would complicate things a lot and would not be in Ukraine's favour,\" she said. Hanna Shelest, a foreign policy analyst with the think tank Ukrainian Prism, told the BBC that \"even a year ago, Zelensky said that he was ready for elections as soon as the conditions allow\". The question was, however, how to create the conditions Zelensky outlined, Shelest told the Newsroom programme on the BBC World Service, given soldiers and refugees who would be voting, unsecured areas in the country and ongoing strikes. \"You cannot guarantee the security of the polling stations,\" she said. Zelensky is also facing increasing pressure from Trump to agree to a peace deal to end the war, with the US leader urging Zelensky to \"play ball\" by ceding territory to Moscow. On Wednesday, Zelensky wrote on social media that a 20-point document on how to end the war would be handed over to the US in \"the near future\" after \"our joint work with President Trump's team and partners in Europe\". The Ukrainian leader provided no further details. The original US draft peace plan - widely leaked to media last month - had 28 points, and was seen as favouring Russia. Ukraine has since held separate talks with US and European negotiators, seeking to change some key clauses such as territorial issues and security guarantees. Later on Wednesday, Trump held phone talks with UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz to discuss a potential ceasefire in Ukraine. After the call, the three European leaders jointly said in statements issued in London, Paris and Berlin that \"intensive work on the peace plan is continuing and will continue in the coming days. The statements said that the participants \"agreed that this was a critical moment - for Ukraine, its people and for shared security across the Euro-Atlantic region\". Meanwhile, the Kremlin said Trump's \"very important\" statements on Ukraine, including saying Moscow would win the war and that Kyiv would need to hand over land, align with Russia's view. \"In many ways, on the subject of Nato membership, on the subject of territories, on the subjects of how Ukraine is losing land, it is in tune with our understanding,\" Kremlin spokesman Dmitry Peskov said. The Ukrainian president is on a diplomatic tour of Europe following intensive talks between US and Ukrainian negotiators over the weekend which failed to produce a deal to which Kyiv could agree. He has pressed European and Nato leaders to help deter the US from backing a deal that Kyiv fears would leave it exposed to future attacks and has ruled out surrendering land. Additional reporting by Vitaliy Shevchenko Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c3e07kxey74o",
        "title": "Member of UK armed forces dies in accident in Ukraine",
        "content": "A member of the UK armed forces has died in Ukraine while watching the testing of a new defensive capability, the Ministry of Defence (MoD) has announced. \"He was injured in a tragic accident whilst observing Ukrainian forces test a new defensive capability, away from the front lines,\" it said in astatementon Tuesday. The individual's family has been informed, it added,and there were no other British casualties as a result of the incident. Prime Minister Sir Keir Starmer said he sent his \"deepest sympathy and condolences to the family of the member of our armed forces who sadly lost their life today\". \"Their service and sacrifice will never be forgotten,\" he said in a statement. Defence Secretary John Healey said he was\"devastated by the death of a UK service person in Ukraine\". \"My thoughts are with their family, friends and colleagues as they grieve for a loved one.\" It is not known which service the individual served in or what his role was. The BBC understands the incident is not thought to have been caused by hostile fire. The MoD said it would not comment further. The UK government has never confirmed the number of service people in Ukraine, but has previously acknowledged a small number in the country to support Ukraine's armed forces and provide security to diplomatic personnel. It is the first death of a UK service member in Ukraine since Russia launched its full-scale invasion of the country in February 2022. The chairman of the Defence Committee, Tanmanjeet Singh Dhesi, said: \"This tragic incident is a stark reminder of the risks faced by those who serve our country, even when operating away from the front lines. I pay tribute to their professionalism and commitment.\" Shadow defence secretary James Cartlidge said he was \"deeply saddened to hear the tragic news that a member of the UK armed forces died this morning in Ukraine\". \"My sincere condolences to his family and friends at this difficult time.\" Fighting has raged in Ukraine since Russia launched a full-scale invasion more than three years ago in February 2022. Efforts to negotiate an end to the war have intensified in recent weeks, including a visit by Ukraine's President Volodymyr Zelensky to Downing Street on Monday where Sir Keir pledged the UK's support for Kyiv in achieving \"a just and lasting ceasefire\". The meeting was part of a push by Zelensky to deter the US from backing a peace deal which includes major concessions from Kyiv, and which allies fear would leave it vulnerable to future invasion, with Ukraineset to present alternative proposals to the White House. Twenty-three vehicles were already taken out of use after soldiers fell ill from noise and vibration. The body of Lance Corporal George Hooley, 28, has been repatriated to the UK after his death last week. Families who lost loved ones in the 1994 Chinook helicopter crash met government ministers for the first time in London. Twelve of the 30 jobs that the maintenance contract will support will be based in Oxford. The application was made by lawyers acting for two families whose relatives were killed in the mid-1970s by the so-called Glenanne gang. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cg7vdd115vjo",
        "title": "Ukraine prepares new peace plan as Zelensky rules out giving up land",
        "content": "Ukraine is preparing to present a revised peace plan to the White House, as it seeks to avoid making territorial concessions to Russia. Kyiv is set to propose alternatives after President Volodymyr Zelensky again ruled out surrendering land, saying he had \"no right\" to do so under Ukrainian or international law. He made the comments after meeting European and Nato leaders on Monday, part of a push to deter the US from backing a peace deal which includes major concessions for Ukraine, and which allies fear would leave it vulnerable to a future invasion. The Ukrainian president told a news conference his team could send a new proposal to the Americans as soon as Tuesday, AFP news agency reported. Zelensky'songoing diplomatic tour of Europefollows intensive talks between US and Ukrainian negotiators over the weekend which failed to produce a deal to which Kyiv could agree. On Sunday, Trump indicated that he viewed Zelensky as the main obstacle to securing a peace deal, something he has made a key foreign policy goal and which the president claimed he would be able to achieve rapidly during the 2024 presidential election campaign. He told reporters that Russia was \"fine\" with the peace plan outlined to both sides by the US, but that he was a \"little disappointed that Zelensky hasn't read it\". Almost simultaneously, Zelensky said he was waiting to briefed by his chief negotiator Rustem Umerov following three days of discussions with his US counterparts in Miami. \"Some issues can only be discussed in person,\" said Zelensky, ahead of a meeting in London attended by UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz. The summit was widely viewed as a show of support for Ukraine as it seeks to resist White House pressure. Trump called Europe's leaders \"weak\" inan interview with Politicopublished on Tuesday. On whether Europe could help end Russia's war with Ukraine, the US president said: \"They talk, but they don't produce, and the war just keeps going on and on.\" No 10 said there had been an agreement that the US-led talks represented a \"critical moment\" to ramp up support for Ukraine, and repeated calls for a \"just and lasting peace... which includes robust security guarantees\". But it is not yet clear what form that would take. While the UK and France have proposed deploying international troops in Ukraine, several key defence players in Europe, including Germany and Italy, have expressed scepticism about that idea. It is also not clear to what extent the US would be willing to underpin any future defence arrangements for Ukraine. Following talks in London, Zelensky flew to Brussels to meet Nato chief Mark Rutte and EU chief Ursula von der Leyen, and will meet Prime Minister Georgia Meloni in Italy on Tuesday. On the subject of surrendering land, Zelensky said: \"Russia is insisting that we give up territories, but we don't want to cede anything.\" He continued: \"We have no legal right to do so, under Ukrainian law, our constitution and international law. And we don't have any moral right either.\" Zelensky has long maintained that any changes to Ukraine's borders would need to be authorised by a public referendum. On Tuesday, Russia's chief of general staff, Valery Gerasimov, said the country's forces were advancing along Ukraine's front line and were targeting Myrnohrad, close tothe strategically important city of Pokrovsk. Russia claims to have captured Pokrovsk, which would nudge Putin closer to taking full control of Ukraine's Donbas, made up of the neighbouring regions of Donetsk and Luhansk. Ukraine has denied this, and a command centre showed the BBC live video of Ukrainian soldiers still fighting in the city during a recent visit. Zelensky told reporters that the initial 28-point plan proposed by the US - and rejected by Kyiv and European leaders as being too favourable to Russia - had been cut down to 20 points, according to Interfax-Ukraine news agency. He said no \"pro-Ukrainian\" points had been removed from the draft, though there had also been no \"compromise\" on the subject of territory. Zelensky singled out control of the eastern Donbas region and the Zaporizhzhia nuclear power plant as being among the \"most sensitive\" issues. The original leaked version of the US-backed plan proposed that Ukraine hand over total control of the Donbas to Russia, despite the fact that Kremlin forces have been unable to capture it in full after almost four years of war. Energy produced at Zaporizhzhia, the largest nuclear power plant in Europe, would be split between Russia and Ukraine, the draft plan said. Meanwhile, the city of Sumy in north-west Ukraine was left without power overnight after a Russian drone attack. The region's governor said more than a dozen drones had hit power infrastructure, the latest in Russia's nightly attacks. Authorities are checking for casualties. Elsewhere, the death toll from one of Russia's deadliest attacks in the Ternopil region continued to rise. Ternopil's police chief said two more bodies had been found following a Russian missile strike on the west Ukrainian city last month, taking the total fatalities to 38, including eight children. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c2k4z9nwz4yo",
        "title": "Critical moment to ramp up support for Ukraine, European allies say",
        "content": "European leaders have said \"now is a critical moment\" to ramp up support for Ukraine and put pressure on Russia to bring an end to the war. Ukrainian President Volodymyr Zelensky met UK Prime Minister Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz in London on Monday to discuss the latest version of a peace plan, drafted between Ukrainian and US officials last week. The European leaders said more work was needed to obtain security guarantees for Ukraine, as the US puts pressure on Kyiv to agree a swift deal with Russia. Zelensky, who travelled on to Brussels to meet Nato officials, said that Ukraine would share a revised plan with the US on Tuesday. Last week, Ukrainian officials spent three days with the US negotiating team in Florida pushing for changes to a US-backed peace proposal which has been widely considered favourable to Russia. Answering questions from journalists after Monday's meeting in London, Zelensky said that the \"most certainly anti-Ukrainian points have been removed\"from the initial deal proposed in November. But the Ukrainian president acknowledged that there were some outstanding concerns about ceding territory and a compromise had \"not yet been found there\". The US has proposed that Ukraine pulls its forces entirely out of eastern regions which Russia has attempted to take by force, but has been unable to capture in full. In return, the US says Russia would withdraw elsewhere and there would be a cessation of fighting. But this is an unpalatable option for Zelensky, who refuses to reward Moscow for its aggression and who has repeatedly warned that Russia would use any foothold in the eastern regions to launch future assaults on Ukraine. \"Americans are inclined, in principle, to finding a compromise,\" Zelensky said on Monday. He added that the issue of security guarantees - which Ukraine wants to ensure Russia would be deterred from carrying out future attacks in the event of a peace deal - had yet to be resolved. A spokesperson for the UK prime minister's office said: \"The leaders all agreed that now is a critical moment and that we must continue to ramp up support to Ukraine and economic pressure on Putin to bring an end to this barbaric war. \"The leaders discussed the importance of the US-led peace talks for European security and supported the progress made,\" the statement said. Leaders also \"underscored the need for a just and lasting peace in Ukraine, which includes robust security guarantees\", it added. Ahead of the talks he hosted at Downing Street, Starmer said there needed to be \"hard-edged security guarantees\" in a peace deal for Ukraine. Merz stated he was \"sceptical\" about some of the details of the potential plan coming from the US side. \"But we have to talk about it. That's why we are here,\" he added. Following the meeting, France said work would be \"intensified\" to provide security guarantees for Ukraine. There is nervousness in Kyiv and across Europe that the US could end its support of Ukraine over frustration with the slow progress of negotiations. \"We can't manage without Americans, we can't manage without Europe and that is why we need to make some important decisions,\" Zelensky said in London. Although the White House has been pushing Kyiv and Moscow to swiftly agree to a multi-point plan to end the war, there has been little sign of a breakthrough. A five-hour meeting between US envoy Steve Witkoff and Russian President Vladimir Putin in Moscow last week failed to yield tangible results. Those talks were followed by three days of discussions between Zelensky's chief negotiator Rustem Umerov and his US counterparts in Miami, which resulted in vague but positive statements of \"progress\" from both sides. However, on Sunday Trump accused Zelensky of not having read the draft of the revised deal. \"I'm a little disappointed that President Zelensky hasn't yet read the proposal,\" he said, while insisting Russia's Vladimir Putin was \"fine with it\". Almost simultaneously, Zelensky stated that he expected to be briefed on the negotiations by Umerov either in London or Brussels on Monday. \"Some issues can only be discussed in person,\" he said. The talks in London were the latest attempt by Ukraine's European allies to carve out a role in the US-led efforts to end the war, which they fear will undercut the long-term interests of the continent in favour of a quick resolution. Despite significant economic pressure and sustained battlefield losses, the Kremlin has shown little sign that it is willing to compromise on its key demands, including ruling out any future path to Ukraine joining the Nato military alliance. Last week, Putin also restated his willingness to continue fighting until his forces take full control of the Donetsk and Luhansk regions, 85% of which is currently occupied by the Russian army. As talks in the US and Europe continue, so does the war. Between Sunday and Monday a total of 10 people were killed and 47 were injured as Russian forces attacked nine regions using drones, glide bombs and missiles. Russia's full-scale invasion of Ukraine began in February 2022. Since then, thousands of civilians and soldiers have been killed or injured, with Ukraine's cities continuing to come under fire on an near-nightly basis. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/crew8y7pwd5o",
        "title": "How much have Europe and the US given to Ukraine?",
        "content": "Talks on the war in Ukraine have taken place in London, with the leaders of the UK, France and Germany reaffirming their support for President Volodymyr Zelensky. US President Donald Trump has said he is \"disappointed\" that President Zelensky has not read his latest proposal to end the conflict. President Trump has, in the past, been critical of the amount of support European countries have given to Ukraine, comparing it unfavourably with his own country's contribution. BBC Verify has been taking a closer look at how much Europe and the US have been spending on Ukraine since Russia's full-scale invasion in February 2022. The US spent a total of $130.6bn (£98bn) between 24 January 2022 and 31 August 2025,according to the Kiel Institute, a Germany-based think tank that tracks international support for Ukraine. The US government has provided its own figure looking at all spending on Operation Atlantic Resolve -a response to Russia's invasion of Ukraine. It says$187bn has been \"appropriated\"- a figure that covers US military training in Europe and replenishment of US defence stocks. This total runs to 30 June 2025, making it less up to date than the Kiel Institute's estimate - though notably higher. In July, Trump announceda new plan under which NATO allies would pay for US weapons and transfer them to Ukraine. In February, when he was hosting France's President Macron, Trump claimed: \"We've spent more than $300bn and Europe has spent about $100bn - that's a big difference\" BBC Verify looked at the claim at the time andconcluded Trump's numbers did not add upas the published numbers - from both Kiel and the US government - showed the US had spent a lot less than $300bn. This remains the case ten months on. It is true that the US is, by some margin, the largest single donor to Ukraine. But Europe combined has spent more money than the US, according to the Kiel Institute. Between January 2022 and the end of August 2025, Europe as a whole spent $201.7bn on Ukraine, compared to the US's $130.6bn over the same period, according to Kiel Institute calculations. The figure includes aid directly from the European Union (EU), but also from bilateral deals from European countries, both inside and outside the EU. It includes military, financial and humanitarian aid. Trump has previously claimed Europe would get its money back as it was \"loaning\" it to Ukraine. This prompted Macron - who was sat next to the US president in their Oval Office meeting in February - to intervene, saying both Europe and the US had given a mixture of grants and loans. President Macron is correct, according to Kiel figures specifically on financial aid. But the institute's figures also suggest President Trump has a point - the US has sent more grants, while the EU sent more loans. However, again, there are different figures out there. As of 19 November,the EU says its members have provided about $197bn so far, with loans making up 35% of the total. Like the US government, the EU has used a broader definition of what counts as aid to Ukraine. EU loans will have been on generous terms - so Ukraine will be repaying less interest than it would normally. In some cases, Ukraine isn't expected to pay anything, with repayments coming from revenues from frozen Russian assets. What we can say is that aid to Ukraine has beena mixture of loans and grants. The UK is one of the biggest individual state donors to Ukraine with $21.2bn in support, according to the Kiel Institute. The UK government has a higher figure - $29bn -which includes money spent and future commitments. The only countries to have spent more are the United States and Germany, according to Kiel data. However, the UK and Germany's contributions are much smaller than those of the US. Additional reporting: Thomas Spencer, Christine Jeavans, Daniel Wainwright and Tamara Kovacevic What do you want BBC Verify to investigate? The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. The only abortion clinic in town is fighting an eviction notice and other efforts to shut it down. High-profile figures, including Bill Clinton and Michael Jackson, can be seen in the long-awaited files. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cz680jx511no",
        "title": "Ukrainian city hit by 'massive' strike as peace talks in US conclude",
        "content": "Russian air strikes on Ukraine have continued overnight, hours after Ukrainian President Volodymyr Zelensky said he had a \"very constructive\" phone call with Donald Trump's negotiating team following three days of talks in Florida. Early on Sunday the mayor of Kremenchuk, a major industrial hub in central Ukraine, said the city had been repeatedly struck in a \"massive\" attack. No deaths have been confirmed so far. Meanwhile, Russia said it had shot down 77 Ukrainian drones in several locations. Aerial assaults have persisted even as efforts to negotiate an end to the war have intensified, including detailed Ukraine-US talks in Miami aimed at drafting a peace settlement acceptable to both sides. Zelensky said on Saturday that he was \"determined\" to continue working with the US after speaking to Trump's envoy, Steve Witkoff, and the US president's son-in-law, Jared Kushner, at the conclusion of those negotiations. He added that they had discussed how to ensure Russia stuck to any potential deal to end the war. Hours later, Kremenchuk Mayor Vitaliy Maletsk said his city had sustained a \"massive combined strike\" on its infrastructure. The extent of the damage was unclear as of Sunday morning but the mayor said water, electricity and heating had been cut off for some. The city, which is roughly halfway between Kyiv and the frontline in the east, has been repeatedly targeted since Russia launched its full-scale invasion in February 2022. The White House has pushed Kyiv and Moscow to agree to a multi-point plan to end the war but there has been little sign of a breakthrough, despite both sides engaging with the US-led process. \"Ukraine is determined to keep working in good faith with the American side to genuinely achieve peace,\" Zelensky said on X. \"We covered many aspects and went through key points that could ensure an end to the bloodshed and eliminate the threat of a new Russian full scale invasion.\" The Russian strikes in the early hours of Sunday followed a wider attack 24 hours earlier, which drew condemnation from Kyiv's European allies. In a social media post, French President Emmanuel Macron said he had spoken to Zelensky and offered his \"full solidarity\". \"France is determined to work with all partners to secure de-escalation measures and to impose a ceasefire,\" Macron added. Macron, Zelensky, UK Prime Minister Sir Keir Starmer and German Chancellor Friedrich Merz are due to hold in-person talks in London on Monday. European leaders have pushed back against early versions of the US-led peace plan and have sought to win support from the White House for their own proposals, such as comprehensive security guarantees for a post-war Ukraine, including the possibility of a peacekeeping force. Sir Keir has led the push for a so-called \"coalition of the willing\", a loose collection of Ukrainian allies who are committed to continuing to underwrite Kyiv's defence in the event of a ceasefire to deter a second invasion. He has called that proposal \"vital\" for Ukraine's long-term security. Russian PresidentVladimir Putin has rejected the idea of such a force, saying any troops deployed to Ukraine would be \"legitimate targets\". Also on Saturday, US and Ukrainian negotiators urged Russia to show a \"serious commitment to long-term peace\". The joint statement was issued days after Witkoff returned from talks with Putin at the Kremlin which failed to produce a breakthrough. Witkoff and Rustem Umerov, newly installed as Zelensky's most senior negotiator, said they had \"agreed on the framework of security arrangements\" and \"discussed necessary deterrence capabilities to sustain a lasting peace\". The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. The move comes after US President Donald Trump ordered a \"blockade\" of sanctioned oil tankers entering and leaving Venezuela. The New York congresswoman, a Trump ally, cited a tough gubernatorial primary campaign and her young son as reasons for her decision. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/clydxj7my84o",
        "title": "Russia hits Ukraine as US reports progress in talks with Kyiv",
        "content": "Russia has launched a major aerial bombardment against Ukrainian infrastructure targets as talks between the US and Ukraine in Florida are set to enter a third day. Overnight Russia launched 653 drones and 51 missiles, most of which were downed, authorities said. One strike hit a railway hub at the town of Fastiv southwest of Kyiv, destroying the main station building and damaging rolling stock. Russia says it targeted military-industrial sites, and energy and port infrastructure. Condemning the new attacks, French President Emmanuel Macron announced he would go to London on Monday for a meeting with Ukrainian, British and German leaders aimed at putting pressure on Moscow. \"We must continue to put pressure on Russia to force it towards peace,\" Macron posted on X. He said he would meet Ukrainian President Volodymyr Zelensky, UK Prime Minister Sir Keir Starmer and German Chancellor Friedrich Merz in London to take stock of the ongoing negotiations being mediated by the US. Earlier US and Ukrainian negotiators urged Russia to show a \"serious commitment to long-term peace\" after talks in Moscow failed to produce a breakthrough. Moscow has intensified attacks on Ukraine's energy sector and infrastructure in recent weeks. On Saturday Ukraine's energy ministry said Russian attacks had hit energy facilities in eight regions, causing blackouts. Zelensky said the attack on the rail hub had been \"meaningless from a military point of view, and the Russians could not have been unaware of this\". Meanwhile the UN's nuclear watchdog said the Russian-controlled Zaporizhzhia nuclear power plant had temporarily lost all external power overnight - the 11th time this has happened since Russia's full-scale invasion of its neighbour. While it is not currently producing electricity, it needs power to keep the nuclear material cool and avoid a meltdown. In Florida, a statement posted by US special envoy Steve Witkoff said two days of talks with Rustem Umerov, secretary of Ukraine's national security council, had been \"constructive\". Witkoff and Umerov \"agreed on the framework of security arrangements\" that could such an agreement and \"discussed necessary deterrence capabilities to sustain a lasting peace\", their statement said without giving details. The prospect of ending the war depended on Russia's readiness to take \"steps towards de-escalation and cessation of killing\", the statement added. The negotiations, which are also attended by US President Donald Trump's son-in-law Jared Kushner, will continue for a third day on Saturday. The Florida talks saw Ukraine's team briefed on a recent meeting between Witkoff, Trump's most senior overseas envoy, and Russian President Vladimir Putin. Witkoff spent almost five hours with Putin in Moscow on Tuesday, after which the Kremlin said \"no compromise\" had been reached on a draft US peace plan. The Kremlin said Putin was ready to continue meeting the Americans \"as many times as needed\", but Ukraine and its allies in Europe have called into question the Russian leader's commitment to ending the war. On Friday, Zelensky said he wanted to \"obtain full information about what was said in Moscow and what other pretexts Putin has come up with to drag out the war\". Kyiv pushed for revisions to the initial US peace plan, which was widely seen as favourable to Moscow when an initial version leaked to the media. An updated version has not been shared publicly. Major points of contention remain between the two sides, including security guarantees for Ukraine post-war and territorial concessions. Russia currently controls roughly one-fifth of Ukraine's territory, including swathes of the Donbas area in the east – made up of the Donetsk and Luhansk regions. Inan interview with India Todayon Friday, Putin warned Ukrainian troops to withdraw fully from the region this week, saying Russia would otherwise \"liberate these [Donbas] territories by force\". Kyiv and its European allies believe the most effective way to deter Russia from attacking again in the future would be to grant Ukraine membership of Nato, or to provide comprehensive security guarantees. Russia is staunchly opposed, while Trump too has repeatedly signalled he has no intention of letting Ukraine join the military alliance. The prospect of Ukraine joining Nato was a \"key question\" that was tackled in Moscow, the Kremlin said on Wednesday. Trump said those talks were \"reasonably good\", but it was too soon to say what would happen as \"it does take two to tango\". Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. The chair of the Social Mobility Commission has called on the prime minister to set out a clearer strategy. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cpq4e21nr5vo",
        "title": "What latest Ukraine talks reveal about Putin's state of mind",
        "content": "What does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood and intentions? For starters, that he's not ready to sign a peace deal. At least, not right now. And certainly not the deal (or deals) on the table. \"No compromise version has yet been found,\" commented Kremlin foreign policy aide Yuri Ushakov after five hours of talks in Moscow involving Putin, US envoy Steve Witkoff, and Donald Trump's adviser and son-in-law Jared Kushner. No compromise is no real surprise, considering the Kremlin leader's uncompromising comments in recent days. In various statements he has condemned the Ukrainian leadership as a \"thieving junta\", accused European leaders of trying to sabotage peace efforts, and insisted that Russia holds the initiative on the battlefield. On a couple of recent occasions Russian TV showed Putin in military fatigues, studying maps of the front line and trumpeting military gains, many of which Ukraine and international observers have denied. After nearly four years of Russia's full-scale invasion of Ukraine, despite the heavy losses Russia has suffered on the battlefield and the damage to the Russian economy, President Putin seems convinced that he is winning this war and that now is not the moment to stop. At least, that is what he would like the West to believe: that nothing can stop him now from achieving his goals. I've said before that, in many ways, Vladimir Putin reminds me of a car with no brakes, no steering wheel and no reverse gear; a vehicle careering full speed down the motorway. Nearly four years after the full-scale invasion of Ukraine there is still no sign of the \"Putinmobile\" turning off, turning back, or coming to a halt. He certainly wants his opponents to think that nothing or no one can force him to change direction: neither European leaders, nor the Trump administration, nor President Zelensky. But cars need fuel (a constant supply). And, to fight a war, countries need money (a constant supply). For now, despite international sanctions, Russia's government is still able to finance the \"special military operation\" - its war on Ukraine. But economic pressures are building: revenues from oil and gas have been falling, the budget deficit growing. Even Putin admits there are problems, referring to \"imbalances\" in the economy. \"In several sectors, production output not only failed to increase this year but actually decreased,\" Putin said this week. \"Are we satisfied with such trends? No.\" The big unknown: at what point, if at all, will economic concerns start to influence the Kremlin's calculations on the battlefield? Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cz7n95wzl9lo",
        "title": "Belgium urges Europe to drop plan for frozen Russian assets to aid Ukraine",
        "content": "Belgium has accused the EU of \"downplaying\" its concerns over a plan to use frozen Russian assets held in Europe to support Ukraine. \"We keep on pleading for an alternative, namely the EU borrowing the amounts needed on the markets,\" says Belgian Foreign Minister Maxime Prévot. The EU's proposal, which has been championed by the German Chancellor, Friedrich Merz, would see €140bn (£123bn) of Russian state assets held in Belgium transformed into a \"reparations loan\" to support Kyiv financially next year. The majority of EU countries support the plan and some have criticised the Belgians for blocking it. Belgium argues such a move would imperil a peace deal in the short term and risk legal action by Russia in the future. Russia has condemned the proposal and one of its top bankers has threatened the EU with 50 years of litigation if the idea becomes reality. The European Commission is set to put forward ways of resolving the impasse, but Maxime Prévot has complained the text being tabled on Wednesday does \"not address our concerns in a satisfactory manner\". EU countries have already used profits generated from around €210bn of frozen Russian assets to fund Ukraine's ongoing defence following the full-scale invasion in February 2022. But using the assets themselves has proved far more controversial. EU leaders are set to vote on the reparations loan at a summit in Brussels later this month, but it is far from clear that an agreement will be reached. Belgium has been the most vocal critic of the scheme because most of the assets frozen by the EU - €185bn - are held at Euroclear, the Brussels-based central securities depositor. The Belgian government argues it would bear the brunt of any Russian legal action if future problems emerged from an EU loan to Ukraine funded with these assets. Maxime Prévot says the risks are clear: \"If Russia takes us to court it will have every chance of winning and we, Belgium, will not be able to repay those €200bn, because that represents the equivalent of an entire year of the federal budget.\" \"It would mean bankruptcy for Belgium.\" Prime Minister Bart De Wever has already written to European Commission President Ursula von der Leyen, complaining that the plan is  \"fundamentally wrong\". And, in a seemingly co-ordinated move, the head of Euroclear, Valérie Urbain, has made a similar argument. De Wever, a Flemish nationalist, said fellow EU countries had to give Belgium a legally binding guarantee that the risk would be shared if the loan to Ukraine collapsed or if sanctions on Russia were to be lifted. That may be difficult as the European Central Bank has said it would not be able to act as a lender of last resort. The Belgian prime minister has proposed that the EU provides a €45bn loan to Ukraine for next year by using provisions that can tapped into as part of the 27 member states' existing shared budget. But Chancellor Merz of Germany believes that is not the best way forward. He has said the using frozen Russian assets to support Ukraine is \"increasingly urgent\" and urged his fellow leaders to rally round the idea. \"Ukraine needs our support. Russian attacks are intensifying. Winter is approaching, or rather, we are already in winter. And in this regard, I hope that we can come to a joint solution within the European Union,\" he added. EU's foreign policy chief Kaja Kallas agrees. A reparations loan would strengthen Europe's position against Moscow, she argues, and would serve as an incentive for President Vladimir Putin to come to the peace table. Veerle Colaert, professor of financial law at KU Leuven University, told the BBC she believed Belgium was justified in its concerns. \"Euroclear has a contractual obligation to pay back the money to the Russian central bank on first demand. The only reason it's not doing it is the sanctions,\" she said. \"If sanctions are lifted and at that moment Euroclear hasn't got the money because it's being lent to the EU, Belgium would have to step in, but the amount involved is simply too large. That's why Belgium wants legally binding, on-demand guarantees from the other member states to share the risk.\" The prospect of foreign reserves held in Europe being tapped for other uses could seriously dent confidence in Europe's financial system, Ms Colaert added. She argued the better option would be to raise a loan for Kyiv on the markets. Of the two possible paths she said: \"In both cases Europe has to reimburse the money. The advantage of taking the money from Euroclear's frozen funds is that it's interest free but it is not risk free.\" Russia has promised to retaliate if the European Union uses frozen Russian sovereign assets for a loan to Ukraine. One of its most prominent bankers, Andrei Kostin, said Moscow would unleash half a century of litigation, should the plan be agreed by the EU. Mr Kostin, who is president-chairman of Vneshtorbank (VTB) – one of the leading state-owned banks in Russia – said it was unacceptable that such funds be give to Ukraine. \"As for the seizure of our money, in the end, we can manage without it\" he said. \"The only problem is that this money might be used for war, not peace.\" Back in October, EU leaders failed to agree on a plan. Ursula von der Leyen said at the end of November that the Commission was preparing to present a legal text to the 27 EU countries to outline how the reparations loan would work. The expectation was that it would have happened by now, but public disagreements seem to have delayed the process. While Washington and Moscow appear to be dictating the pace of talks, Europe's member states are still struggling to reach a deal on funding their beleaguered ally. Additional reporting by Bruno Boelpaep Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cn41jzw9eyko",
        "title": "Ireland to give €125m to Ukraine as Zelensky visits Dublin",
        "content": "The Irish government has approved an extra €125m (£110m) in support for Ukraine in a Cabinet meeting on Tuesday. It comes after the Ukrainian President Volodymyr Zelensky arrived in Dublin in the Republic of Ireland for an official one-day visit. Taoiseach (Irish Prime Minister) Micheál Martin made the announcement at a press conference with Zelensky. Martin said it was an honour to welcome Zelensky and the first lady Olena Zelenska on the first official visit of a Ukrainian president to Ireland. They left later on Tuesday night where Tánaiste (Irish deputy prime minister) Simon Harris said it had been an \"honour to have them both in Ireland\". Martin said Ireland would continue to support Ukraine for as long as was needed. He said the visit came at a \"critical moment\" for Ukraine and for Europe and underlined the value he placed in \"the friendship between Ukraine and Ireland\". \"Our is a relationship built on shared values, freedom, democracy, the right of all states to determine their own future - values the people of Ukraine have sacrificed to defend and protect,\" he added. Martin said Ireland was \"open to contributing to peacekeeping and peace monitoring in Ukraine\". He said Ireland would also be willing to help in post-war construction in Ukraine. President Zelensky said Ireland was a \"neutral country\" but not an \"indifferent country\". \"We are grateful to it. \"You are helping us and we appreciate it... Ireland's interests really matter because it is the influence of a large global community.\" He said Ireland and Ukraine had signed a roadmap for a partnership between the countries for at least the next five years. \"We hope that during this period, Ukraine will become a member of the European Union,\" he said. He also expressed his gratitude to the Irish government, Irish communities and \"every Irish home\" that has sheltered Ukrainians. Earlier, a guard of honour took place as Zelensky visited Government buildings in Dublin, where the Ukrainian and Irish anthems were played. It is understood Zelensky was also updated on the peace talks by a Ukrainian delegation in Dublin during the visit. Ukrainian and US negotiators held meetings in Florida in recent days in an effort to revise a peace deal viewed as favouring Russia. US President Trump's special envoy Steve Witkoff isis meeting Russian President Vladimir Putinin Moscow later. Zelensky also visited Aras an Uachtarain on Tuesday, where he was greeted by Irish President Catherine Connolly, and signed the visitors book in her study. \"We greatly appreciate Ireland's generosity in providing temporary shelter to displaced Ukrainians,\" he wrote in the book. Irish ministers signed off on an extra €100m (£88m) in funding for non-lethal military support for Ukraine and a further €25m (£22m) for the country's urgent energy needs. Martin said on Tuesday that to date Ireland had provided €340m (£299m) in financial support to Ukraine, including more than €173m (£152m) in humanitarian supports, and €166m (£146m) in non-lethal military assistance. The proposals were brought to the meeting, which took place in Dublin, by Foreign Affairs and Trade Minister Helen McEntee. McEntee also proposed Ireland's participation in an International Claims Commission for Ukraine. The commission will be responsible for determining claims for damage, loss or injury caused by Russian internationally wrongful acts committed by the Russian federations against Ukraine, an Irish government source said. Zelensky also addressed both Irish houses of parliament - the Dáil and the Seanad. Speaking before the address, Ceann Comhairle (Speaker) Verona Murphy said the Good Friday Agreement was \"born from decades of pain and division\". \"Yet it proved that even the deepest wounds can heal when people choose negotiation over violence. \"That lesson gives us hope for Ukraine,\" Murphy said. In his address, Zelensky said Ukrainian and Irish people are among \"the few in Europe who spent centuries fighting for the right to remain themselves\". \"Ireland has stood firmly and clearly for our independence and for a just end to this war so thank you for your steadfast support for these years of standing with us,\" he added. The Ukrainian leader was given a standing ovation after the address. He later attended the inauguration of the Ireland-Ukraine Economic Forum, alongside Harris and McEntee. More than 120,000 Ukrainian refugees have sought refugee status in Ireland since the outbreak of war in Ukraine in February 2022. Some have returned and about 80,000 are estimated to be still living in Ireland. Ukrainian refugee Uriivna Olena is one of a group of women who attend Ukrainian Mass every Sunday in north Dublin and prays for the war to end. The women are hopeful peace talks currently under way will be successful to end the war. \"We go every Sunday to church to pray and we pray for children, for humans, for soldiers, for all of people and we wish war would end soon,\" she told BBC News NI after a Mass service finished last Sunday. \"It's very hard for us.\" \"All of us are paying for peace in Ukraine. We hope that this terrible war is finally ended,\" said Tetiana Bilous, who is also a Ukrainian refugee. She said the war starting has been \"very difficult\" and \"understanding someone can have aggression against us, we are just people, citizens.\" \"We were living a normal life and suddenly everything was interrupted, everything was ended.\" Ms Bilous said she is very grateful for the support from Ireland. Mykhaylo Fedynshyn has been living in Ireland for more than  20 years and he also attended Mass. \"My relatives still work in Ukraine and I hope they will get back to normal life, as it was before the war. So no missile, no sirens, no explosions.\" He said he is hopeful peace talks would be successful. \"[I am hopeful] because Ukrainian people fighting so hard for independence, for freedom, so it has to be ended at some stage. But I believe it will be in Ukrainian favour, we will get the victory over our enemy.\" An Garda Síochána (Irish police) said those travelling to Dublin Airport, should allow additional time to arrive at the airport due to possible rolling road closures, particularly on Tuesday evening. Traffic restrictions will be in place on: The public can also expect localised road closures to facilitate events and temporary rolling road closures to facilitate security escorts over the course of Tuesday. A chamber inside the ancient burial tomb is illuminated by sunrise on the shortest day of the year. Pte Seán Rooney died after his armoured UN vehicle came under fire while travelling to Beirut on in December 2022. Ireland's 'LeBron James' of Microsoft Excel has won the 2025 world championship in Las Vegas. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". Padraig Casey has been found guilty of five counts relating to the seizure of cannabis and cocaine in June 2020. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/ce8ng3yjenpo",
        "title": "Putin and Trump's envoy set for key Ukraine talks in Moscow",
        "content": "Russian President Vladimir Putin will meet US special envoy Steve Witkoff in Moscow on Tuesday, after the White House said it was \"very optimistic\" about reaching a deal to end the Ukraine war. US President Donald Trump's son-in-law Jared Kushner, who has acted as an outside adviser in diplomatic talks, is also expected to attend. The summit comes after two days of negotiations in Florida between Ukrainian and US officials, including Witkoff and Kushner, aimed at refining a US-backed peace plan which had been viewed as favourable to Russia. Ukrainian President Volodymyr Zelensky described the talks as \"constructive\", but said there were \"some tough issues that still have to be worked through\". Witkoff's meeting with Putin will be during the second half of Tuesday, Kremlin spokesman Dmitry Peskov said. Speaking after a meeting with French President Emmanuel Macron in Paris on Monday, Zelensky said Kyiv's priorities in peace talks were maintaining Ukraine's sovereignty and securing strong security guarantees. Zelensky said the \"territorial issue is the most difficult\" element of the peace deal, with the Kremlin continuing to push for Ukraine to cede territory in the east which it still controls - something Kyiv has long-maintained it will never do. The talks in Moscow on Tuesday come hours after Russian officials claimed to have captured the key strategic town of Pokrovsk in eastern Ukraine, referred to by Russia by its Soviet-era name Krasnoarmeysk, and the north-eastern Ukrainian border town of Vovchansk. Ukrainian officials made no acknowledgement that either city had fallen to Russia and open-source intelligence projects monitoring the front lines of the war suggested neither Vovchansk nor Pokrovsk had yet been fully captured by the Russian army. The head of Ukraine's centre for countering disinformation, Andriy Kovalenko, said it seemed Russia's main aim was to ensure all the pressure in the US peace plan was put on Ukraine. Russia has spent almost a year and a half trying to capture Pokrovsk and released a video showing Putin visiting a command post at the weekend in which he was quoted as saying Russia had made progress in \"an important area, we all understand just how important\". Ahead of his trip to Moscow, Witkoff also held talks with UK Prime Minister Sir Keir Starmer, Zelensky and Ukraine's new chief negotiator Rustem Umerov, while several key European leaders virtually joined the Zelensky-Macron meeting. Speaking on Monday, White House Press Secretary Karoline Leavitt said the draft peace deal had \"been very much refined\", adding: \"I think the administration feels very optimistic.\" She continued: \"But as for the details, I will let the negotiators negotiate. But we do feel quite good, and we're hopeful that this war can finally come to an end.\" Last week, Putin said he had seen a draft peace plan proposed by the US, and that it could become the \"basis\" for a future agreement to end the war. However, Kremlin officials later cast doubt over whether it would accept the proposal after Kyiv and European allies said they had secured changes to it. Theinitial US-Russia draft peace plancirculated in November sparked consternation in Kyiv and around Europe. As well as being heavily slanted towards Moscow's demands, it also dictated how several billion infrozen Russian assetscurrently held in European financial institutions should be invested, as well as setting the terms for Ukrainian market access in Europe. Speaking on Monday, Macron said there was currently \"no finalised peace plan to speak of\", and insisted that any such proposal could only be worked out with input from Ukraine and Europe. Macron said the question of territorial concessions could \"only be finalised by President Zelensky\", and pointed out that questions around frozen Russian assets, security guarantees, and Ukraine's accession to the EU needed to involve European nations. The French leader also praised efforts by the Trump administration to end the conflict, which began in 2014 with Russia's illegal annexation of Crimea, followed by a full-scale invasion of Ukraine in 2022. Kaja Kallas, the EU's foreign policy chief, said this week could be \"pivotal\", but that Moscow only wanted to negotiate \"with those who are just offering them something on top of what they already have\". She continued: \"I'm afraid all the pressure will be put on the weaker side because that is the easier way to stop this war when Ukraine surrenders, but this is not in anybody's interest.\" In recent months Moscow has at times appeared to engage with US attempts to mediate an agreement to end the war, but several of its demands directly counter Ukraine's sovereignty and are seen as unacceptable by Kyiv. While the question of territory is the major sticking point, the issue of security guarantees for Kyiv has also proved contentious. Kyiv and its European partners are keen for Ukraine to be given security guarantees - such as Nato membership - that would protect it from being attacked again. But Russia vehemently opposes this and Trump has also ruled out allowing Ukraine to join the military alliance. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cp9ky5z2gx0o",
        "title": "Ukraine hits tankers in Black Sea in escalation against Russia",
        "content": "Ukrainian naval drones hit two oil tankers from Russia's so-called \"shadow fleet\" as they travelled through the Black Sea, Ukrainian officials have said. Footage verified by the BBC shows waterborne drones speeding through the waves into the vessels, before detonating into a ball of flame, sending black smoke into the air. The targeted tankers were named by Turkish authorities as the Kairos and Virat, both flagged to the Gambia. Both were hit off the Turkish coast on Friday, with the Virat reportedly struck again on Saturday. No casualties were reported. The attacks appear to be an escalation by Kyiv as it tries to hit Russia's oil revenues, which are critical for funding its war in Ukraine. The two ships are reportedly part of Russia's \"shadow fleet\" - a term that refers to the hundreds of tankers used by Russia to bypass Western sanctions imposed after its full-scale invasion of Ukraine in 2022. The shadow fleet is largely made up of aged tankers, many with obscure ownership or insurance. The Kairos was struck in the south-west area of the Black Sea and the Virat in a central area further east. Both are on a list of ships subject to sanctions, according to London Stock Exchange data. The attack employed Sea Baby drones - a type of naval drone produced by Ukraine's security services, known as the SBU. Turkish authorities said they had been assisting the vessels, and released footage showing two Turkish boats trying to extinguish the fire on the Kairos. The attacks are seen as a warning by Ukraine, suggesting that ships carrying Russian oil in the Black Sea face the risk of direct attack, not just Western sanctions. Separately, a major consortium transporting oil from the Caspian region said it had suspended loading in the Russian Black Sea port of Novorossiysk, after an attack by unmanned boats overnight. The Caspian Pipeline Consortium said the attack had caused significant damage to a mooring point. Russia and Kazakhstan are major stakeholders in the company, which is also part-owned by Western firms including Exxon Mobil, Chevron and Shell. Kazakhstan's Foreign Minister Aibek Smadiyarov expressed his indignation with the attack, which he said was the third of its kind. He said Kazakhstan attached particular importance to ensuring a \"stable and uninterrupted\" energy supply. The incident had harmed relations between his country and Ukraine, Smadiyarov added, calling on Kyiv \"to take concrete measures to prevent the recurrence of such situations\". Meanwhile, Ukrainian President Volodymyr Zelensky said on Saturday that a delegation led by top security official Rustem Umerov was on its way to the US to continue talks on an agreement to end the war. Umerov is set to lead the Ukrainian delegation as the previous lead negotiator, Zelensky's influential chief of staff Andriy Yermak, resigned after anti-corruption detectivessearched his apartmenton Friday. The Ukrainian delegation is expected to meet US officials in Florida on Sunday. Steve Witkoff, US President Donald Trump's overseas envoy, will hold talks in Moscow next week. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cp84nl57v0lo",
        "title": "Putin doubles down on demands for Ukrainian territory ahead of talks with US in Moscow",
        "content": "President Vladimir Putin has doubled down on his core demands for ending the war in Ukraine, saying Russia will lay down arms only if Kyiv's troops withdraw from territory claimed by Moscow. Putin has long pushed for legal recognition of the Ukrainian territories Russia has seized by force. They include the southern Crimean peninsula, annexed in 2014, and the eastern Donbas region, which Moscow now occupies for the most part. For Kyiv, which has ruled out relinquishing the parts of the Donbas it still holds, rewarding Russia for its aggression is a non-starter. Speaking after Putin's address, Ukraine's President Volodymyr Zelensky said that Russia \"scorned\" efforts \"to truly end the war\". Speaking to reporters during a trip to Kyrgyzstan, Putin accused Kyiv of wanting to fight \"to the last Ukrainian\" - which he said Russia was \"in principle\" also ready to do. He repeated his view that Russia has the initiative on the battlefield and the fighting would only end when Ukrainian troops withdrew from Donbas, which is made up of the Luhansk and Donetsk regions. \"If they don't withdraw, we'll achieve this by force of arms,\" he said. Yet Russia's slow gains in eastern Ukraine have come at significant cost of manpower. According to the US-based Institute for the Study of War, at this rate it would take Moscow almost two more years to seize the rest of the Donetsk region. Thursday's remarks were the first time that Putin addressed the hectic diplomatic moves of the last week, which saw the US and Ukraine hold intense discussions over a peace plan reportedly drafted in October by American and Russian officials. The plan, which was heavily slanted towards Moscow's demands, was subsequently revised during talks between Ukrainian and US negotiators in Geneva. European representatives were also in the Swiss city. But it is thought it does not address the issue of the occupied territories which - alongside security guarantees for Ukraine - is the biggest sticking point between Moscow and Kyiv. Putin said that new draft plan has now been shown to Russia, and that it could become the \"basis\" for a future agreement to end the war. However, he added it was \"absolutely necessary\" to discuss \"certain specific points that need to be put in diplomatic language\". Asked about the possibility of Crimea and the Donbas being recognised as under Russiande factocontrolbut not legally, Putin said: \"This is the point of our discussion with our American counterparts\". A US delegation including special envoy Steve Witkoff was expected in Moscow in the first half of next week, he confirmed. US President Donald Trump told reporters that Witkoff may be joined in Moscow by the president's son-in-law Jared Kushner. Zelensky said in a video address late on Thursday that Ukrainian and US delegations would meet \"to translate the points we secured in Geneva into a form that puts us on the path to peace and security guarantees.\" The Ukrainian president did not mention any names, but his chief of staff Andriy Yermak had said US Army Secretary Dan Driscoll was due to visit Kyiv later in the week. On Wednesday Trump said there were \"only a few remaining points of disagreement\" between Russia and Ukraine – indicating that any meeting with Ukraine's President Volodymyr Zelensky to discuss these points was contingent on a peace deal being agreed upon. During his comments to reporters Putin again expressed his contempt for the Ukrainian leadership, which he said he considered illegitimate. There was therefore \"no use\" signing any documents with them, he added. Ukraine has been under martial law since the start of Russia's full-scale invasion in February 2022 and has therefore been unable to hold scheduled elections. Earlier this year, the Ukrainian parliament voted unanimously to affirm the legitimacy of President Zelensky, whose term in office ended in the spring. Putin also dismissed warnings by European leaders that Russia could attack the European continent within the next decades. \"That sounds laughable to us, really,\" he said. The White House and Donald Trump have sounded optimistic about the recent diplomatic push for peace talks, but Europeans have repeatedly expressed their scepticism over whether Putin truly intended to end the war. On WednesdayEuropean Commission chief Ursula von der Leyen accused Russia of upholding a post-World War Two mindsetand of seeing the European continent as a \"sphere of influence\" in which sovereign nations could be \"carved up\". Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cly0jjv2lg1o",
        "title": "Where peace stands in Ukraine after frantic diplomacy",
        "content": "Are we any closer to peace in Ukraine? After a frantic, often confusing few days of diplomacy, Donald Trump seems to think so. \"We're getting very close to a deal,\" he told reporters on Tuesday. For his part, Ukraine's President, Volodymyr Zelensky, who had looked and sounded grim over the weekend, said there were now \"many prospects that can make the path to peace real\". \"There are significant results,\" he said, after reviewing the results of Sunday's key discussions in Geneva, \"and there is still much work to be done.\" But from the Russians, apart from some discontented mutterings about European involvement and unauthorised leaks, the response has been somewhat muted. Kremlin aide Yuri Ushakov said on Wednesday that Moscow viewed some elements of the latest draft positively but \"many require special discussions among experts\". Separately, President Vladimir Putin's spokesman, Dmitry Peskov, said it was \"premature\" to think that a deal was close. Given the gulf that exists between Ukraine and Russia on so many key issues – including territory, Nato membership, who should pay for Ukraine's reconstruction and how will those involved in war crimes be held accountable – it is hard to see all the necessary pieces falling into place anytime soon. Last Wednesday already seems like aeons ago. That is when a leaked draft of a 28-point US plan to end the war first emerged. The plan, whose references to Ukraine giving up territory and limiting the size of its military led some to describe it as a \"Russian wish list\", caused consternation in Kyiv and sent European diplomats scrambling to limit the perceived damage. In some ways, it felt like a re-run of events in August, when anxious European leaders rushed to Washington to bend Trump's ear after the American president rolled out the red carpet to Putin in Alaska. By the weekend, the Europeans had drafted a counter-proposal, also 28 points long, which replaced the blunt territorial concessions of the US plan with \"negotiations on territorial swaps\" and stiffened the language on security guarantees, a key concern of Kyiv. But how much influence the Europeans had over Sunday's talks in Geneva remains unclear. A joint US-Ukrainian statement, issued after the talks wrapped up, spoke of \"highly productive\" discussions, saying any future agreement must deliver a \"sustainable and just peace\". Sir Keir Starmer was one of several European leaders who seized on the words \"sustainable and just\" as indicating that progress had been made. Ukrainian officials sounded relieved too. The First Deputy Foreign Minister, Sergiy Kyslytsya, said the latest version of the plan had been slimmed down to just 19 points, with the most contentious issues – territory and Ukraine's future relations with Nato – put off for Trump and Zelensky to decide. Amid recriminations over how the original 28-point version had been leaked (with fingers pointing in multiple directions), a tight veil of secrecy has been drawn around the latest version. Despite talks in Abu Dhabi involving the US army secretary, Dan Driscoll (a new addition to Trump's Ukraine team), Ukraine's military intelligence chief, Kyrylo Budanov, and Russian officials, Ushakov says the plan has still not been discussed in detail. With Trump's envoy Steve Witkoff due in Moscow next week and talk of Zelensky paying another visit to the White House, it seems the pace of diplomacy is not about to let up. \"We are now on a fast track to something,\" says Daniel Fried, former US assistant secretary of state for European and Eurasian affairs. \"To a failure or a fast track to a success, I can't say, but it's moving fast.\" Ambassador Fried says last week's 28-point US plan was a \"hot mess\" but that the impetus behind it is real. \"To the Trump administration's credit, it's pushing hard for a settlement.\" The sense of dread which settled over Kyiv last week - which caused Zelensky to observe that Ukraine was facing one of the most difficult moments in its history – has lifted. \"In Geneva, Ukraine's delegation was very satisfied,\" says Myroslava Gongadze, a non-resident senior fellow at the Atlantic Council's Eurasia Center, speaking from Kyiv. \"The point of the exercise was not exactly to make an agreement but to throw out that 28-point plan and put some Ukrainian interest in that possible negotiation and show that Ukraine is really willing to discuss and negotiate.\" But if Kyiv feels it has successfully countered some of the worst of what was being demanded – and we still do not know how much – there are plenty of lingering concerns. Chief among them: what sort of security guarantees can it expect to receive if it finally strikes a deal with the country that launched an unprovoked invasion of its territory and still seems to covet more? \"The essential question we must ask here is security guarantees,\" says Gongadze. \"Who will be giving those guarantees, who is being held accountable and which border would not be violated? \"If the answers are weak, then it's setting up Ukraine for another crisis.\" In response to the original US document's rather vague promise to offer \"reliable security guarantees\", European leaders spoke of a US guarantee that \"mirrors Article 5\", a reference to Nato's principle of collective defence. Last week, the Axios news website reported the existence of a separate US paper, presented to Ukraine, which outlines \"security assurance modelled on the principles of Article 5 of the North Atlantic Treaty, adapted to the circumstances of this conflict\". This critical aspect of the plan is clearly still a work in progress. Following Tuesday's virtual meeting of the UK-French led Coalition of the Willing, participants agreed with the US Secretary of State, Marco Rubio, to \"accelerate joint work with the United States to take forward the planning on security guarantees\". Sir Keir Starmer says operational plans for a multinational \"reassurance force\" for Ukraine are fully formed but until the Trump administration indicates what, if any, backup it is willing to provide, those plans remain largely theoretical. \"Security guarantees are going to have to be fleshed out,\" says Ambassador Fried. \"The Coalition of the Willing is a great idea, but it hasn't landed on any result to date, partly because they are waiting to see whether the Americans will back them and partly because they're waiting to see what they're going into.\" Where we are on territory is another big unknown. Last week's 28-point plan stated, bluntly, that Crimea, Luhansk and Donetsk would be \"recognised as de facto Russian\", and that Ukrainian forces would withdraw from the heavily contested parts of the Donetsk region still under Kyiv's control. All this language vanished in the European counter-proposal. Ukraine, it said, would commit \"not to recover its occupied sovereign territory through military means\". All territorial negotiations, it said, would \"start from the Line of Contact\" – the current front lines. It is not known the extent to which Europe's approach informed the document that emerged after the talks in Geneva. The joint US-Ukrainian communique offered only an oblique insight, saying the two sides \"reaffirmed that any future agreement must fully uphold Ukraine's sovereignty\". The word \"fully\" appeared to be carrying a lot of weight. Given Trump's mercurial approach to the war in Ukraine, Putin's lingering ambitions and Zelensky's domestic difficulties - the current round of diplomacy takes place in the midst of a corruption scandal that is undermining his domestic standing - it is extremely difficult to know where this process goes next. But it might be overly optimistic to think we are near the end. \"We're still in the middle of this process,\" says Leslie Shedd, another of the Atlantic Council's non-resident fellows. \"There's certainly a long way to go still.\" But for all the apparent chaos surrounding the Trump administration's efforts, including a constantly shifting – and possibly competing – cast of characters, Shedd believes the administration is serious. \"It appears that the president… [is] truly prioritising finding a peace in Ukraine. And I think that is actually really important.\" Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. The move comes after US President Donald Trump ordered a \"blockade\" of sanctioned oil tankers entering and leaving Venezuela. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/c17x0x2qrejo",
        "title": "Who is Trump's 'drone guy' Dan Driscoll, taking key role in Ukraine talks?",
        "content": "When talks to end the Russia-Ukraine war took an unexpected turn last week, with the leak of a peace plan said to come from the US, the Trump administration dispatched an unlikely figure to attend a flurry of overseas meetings. The youngest-ever army secretary, 39-year-old Dan Driscoll, is often referred to as President Donald Trump's \"drone guy\" for his embrace of emerging battlefield technologies. Until recently, he was mostly known for discussions of budgets, supplies and staff issues in the military's largest branch. Driscoll does not appear to have a long history of dealing with Russia and Ukraine, or experience in international diplomacy, and has never held public office. So, who is this increasingly prominent figure within the administration? It is Driscoll's relationship with the now-vice president, JD Vance, that brought him into Trump's orbit. Driscoll has a similar background to his friend Vance. Driscoll attended a public university, before joining the US Army, and then earned his law degree at the prestigious Yale University. Vance served in the US Marine Corps before attending a public university and then Yale Law School. Both men also worked in finance after graduating. During his military career, Driscoll became an officer in 2007, led a cavalry platoon and deployed to Iraq for several months in 2009. He has told the story of meeting Vance through a veterans' student group at law school, during which Vance reassured new students that they would at first feel as if they did not belong, but would excel at classes after a few months. Soon, Vance became Driscoll's friend and mentor. Driscoll was on holiday with his family in Switzerland in the summer of 2024 when Vance called to tell him he was going to be Trump's running mate and asked him to join the campaign. The next day, Driscoll flew back to the US, bought a suit at an outlet mall, and took an Uber to the Republican National Convention, he told the alumni magazine for the University of North Carolina, Chapel Hill - the institution where he was an undergraduate. Once Trump returned to office, Driscoll was swiftly approved as army secretary in his Senate confirmation vote. His sphere of influence expanded after he became a key figure in Trump's deployment of the National Guard to US cities. Afterwards, he also took over the role of acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives. Driscoll has often spoken about the war in Ukraine - pointing to Ukrainian drones as a relatively cheap, mass-produced technology that is good for fighting. But after being nominated for the army secretary job, he did not initially appear to be involved in negotiations to end the war. Trump was instead relying on his special envoy, Steve Witkoff, to work on a plan for a ceasefire. When details of a 28-point plan drafted by the US and Russiawere leaked last week, Ukraine immediately voiced concern at some of its key points - and its European allies followed suit. Driscoll then made an unannounced visit to Ukraine along with other high-ranking Pentagon figures, the most senior military group to travel to Kyiv since Trump took office in January. The purpose, according to a US Army spokesman, was to meet Ukrainian officials and discuss efforts to end the war. Driscoll met Zelensky and was then, according to Politico, feted at a reception at the US ambassador's residence. In subsequent days, Driscoll participated in more discussions with Ukrainian officials in Geneva alongside Secretary of State Marco Rubio, Witkoff and Trump's son-in-law Jared Kushner, and helped draw up an\"updated and refined peace framework\". He went on to hold talks with Russian officials in Abu Dhabi, according to the BBC's US partner, CBS News. In a social media post on Tuesday, Trump said in an effort to finalise the peace plan, he had directed his envoy Steve Witkoff to meet with Russian President Vladimir Putin in Moscow. He said Driscoll would meet with the Ukrainian side. In nominating Driscoll as his army secretary, Trump wrote he had a \"powerful combination of experiences to serve as a disruptor and change agent\". Some in Washington are wondering if those qualities and his recent appearance on the world stage mean that Driscoll could one day replace Pete Hegseth, if Hegseth ever steps down as defence secretary. While he has never held public office, Driscoll worked in Congress as an intern for the Senate's veteran affairs committee, and in 2020 he made an unsuccessful bid for a House seat in North Carolina. A former professor has suggested Driscoll aimed \"to serve in the military, go to law school and be in politics\". There is also the possibility Driscoll could step officially into the role of negotiating with Ukraine when Trump's special envoy to the country, Keith Kellogg, leaves in January. Or he could stay as the head of hundreds of thousands of troops in the US Army. Driscoll has previously highlighted that his father and grandfather served in the military before him, and he often speaks about his vision of transforming the Army. Days before heading to Ukraine, Driscoll described to The Conversation podcast how he imagined the near future, when \"every infantryman...will carry a drone into battle\" and soldiers would rely on artificial intelligence because human brains will not be able to \"keep up\" with the pace of action. \"Our window to change is right now,\" he said in a speech in October. \"And we will win with silicon and software, not our soldiers' blood and bodies.\" Correction 11 December: This story has been amended to say that Vance's previous role was in the US Marine Corps, not the US Army Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. The only abortion clinic in town is fighting an eviction notice and other efforts to shut it down. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cn4d27dx80no",
        "title": "Updated peace plan could be a deal Ukraine will take - eventually",
        "content": "Donald Trump wants a peace deal in Ukraine very badly. Kyiv wants peace even more, just not at any cost. That's why when the US began pushing it to agree to a deal by Thanksgiving on what looked close to surrender terms, Ukraine pushed back. It scrambled senior officials to talks in Geneva and all of Sunday we saw delegates from the US and Ukraine shuttling back and forth between the two main venues in black limousines with darkened windows. They were joined by national security advisers from Germany, France and the UK. The onlytime I glimpsedAndriy Yermak, heading the negotiating team from Kyiv, he looked stony-faced. No wonder: the starting proposal on the table was so skewed towards Russia's demands,the talks began with the US Secretary of State Marco Rubio having to deny it had been written by the Kremlin. But Donald Trump had been clear that Ukraine needed to sign up fast or face unspecified consequences. So Kyiv had to engage. On Sunday night, Marco Rubio declared there'd been \"tremendous progress\" in the talks with just a \"couple of things\" still outstanding. When pressed, he wouldn't be more specific, calling the situation \"delicate\". But a joint Ukraine-US statement says there's now a whole new deal in play, which it calls an \"updated and revised framework document\". We haven't seen that yet. The Financial Times newspaper quotes one of the delegates, though -Ukraine's deputy foreign ministerSergiy Kyslytsya - who talks of a new 19-point plan with \"very little left\" from the original draft. That new document likely incorporates at least some of the amendments proposed by the Europeans and published by Reuters news agency that point to something far more palatable for Kyiv. In that version, an automatic veto on future Ukrainian Nato membership is gone - as well as a cap on troop numbers for the country's armed forces. It says no Western troops would be deployed to Ukraine permanently, but that's not an all-out ban. On the sensitive question of territory – land Ukrainian soldiers have been fighting and dying to defend for 11 years – there would be no handover of the rest of the Donbas region to Russia for free, and Ukraine would aim to recover occupied areas through exclusively diplomatic means. That's something Ukrainian President Volodymyr Zelensky previously accepted. The full amnesty for war crimes is deleted, too. But most critically, there's reference to security guarantees. Several officials, including the UK Prime Minister Sir Keir Starmer, have talked about Ukraine getting Article 5-style protection, meaning the US would be bound to come to its defence if Russia ever invaded again. That's the key issue which Ukraine says it can't negotiate on. We don't know how many of these European ideas have made it into the new proposal, but Germany's Chancellor Friedrich Merz calls the deal \"significantly modified\" – in a positive sense. So how did we get from a pro-Russian deal to this in just a day? It's hard to be sure, with US hawks like President Trump's envoy Steve Witkoff in the room. The initial Kremlin-friendly plan was rooted in Witkoff's own visit to Russian President Vladimir Putin this spring, when he returned quoting Russia's controversial narratives almost verbatim. Instead, this plan seems like something Ukraine might sign up to – eventually. Which must be why Trump has gone from berating officials in Kyiv, again, for supposedly showing him \"zero gratitude\", to proclaiming that \"something good\" may be coming. But how good? There is still no sign that Russia is ready to give up fighting unless it's forced to. \"Putin is much more self-confident militarily, right now,\" Tatiana Stanovaya of the Carnegie Russia Eurasia Center believes. She points to a corruption scandal and political crisis in Kyiv, problems mobilising soldiers there, and military gains for Russian forces on the ground – all driving Putin's thinking. At best, some suggest Trump's demand for a deal has injected new momentum into efforts to find peace, which Ukrainians, under fire, desperately want. But it's hard to escape the sense that these days of frantic diplomacy have only brought us back to where we started \"Russia's position is, 'we have laid out our demands, so do you take them or not?' Stanovaya said. \"'If so, we will stop the war – if not, we'll just wait until you're ready.'\" Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. The US has ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. It was one of several removed from the justice department website because of concerns from victims, said a US official. The move comes days after President Donald Trump said that he was ordering a blockade of sanctioned oil tankers entering and leaving Venezuela. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cde6yld78d6o",
        "title": "What we know about leaked US draft plan to end Russia's Ukraine war",
        "content": "Talks in Geneva aimed at discussing a US-backed draft peace plan to end the war in Ukraine have concluded after a day. US and Ukrainian teams reportedly went through the 28-point proposal drafted by American and Russian officials last month. Ukraine is likely to have pushed back on some particularly contentious elements - namely those concerning territorial issues and security guarantees for Ukraine. Russia has said it has not seen any updated plan off the back of talks between the US and Ukraine. The original iteration of the plan proposed to hand over those areas of Ukraine's industrial eastern Donbas region still under Ukrainian control to thede factocontrol of Russian President Vladimir Putin - an unpalatable option for Ukraine. The plan also called for Kyiv to cut the size of its armed forces to 600,000 people. On the face of it, several of the plan's 28 key points could be acceptable to Ukraine. Others come across as vague and imprecise. Ukraine's sovereignty would be \"confirmed\"and there would be a\"total and complete comprehensive non-aggression agreement between Russia, Ukraine and Europe\", with robust or reliable\"security guarantees\"for Kyiv and a demand for snap elections in 100 days. If Russia were to invade Ukraine a\"robust co-ordinated military response\"is proposed along with a restoration of sanctions and a scrapping of the deal. Although elections are impossible in Ukraine as there is martial law in place, they could theoretically be held if a peace deal is signed. But on security guarantees, there is no detail on who would provide them and how robust they might be. This falls well short of a Nato-style Article Five commitment to  treat an attack on Ukraine as an attack on all. Kyiv would want more than a vague promise if it were to sign up. Among the most contentious proposals are Ukraine handing over its own unoccupied territory and cutting the size of its armed forces. \"Ukrainian forces will withdraw from the part of Donetsk Oblast [region] that they currently control, and this withdrawal zone will be considered a neutral demilitarised buffer zone, internationally recognised as territory belonging to the Russian Federation. Russian forces will not enter this demilitarised zone.\" Ceding territory where at least a quarter of a million Ukrainians live - the Donetsk \"fortress belt\" cities of Slovyansk, Kramatorsk and Druzhkivka - will not be acceptable to most Ukrainians. Russia has spent well over a year trying to capture the town of Pokrovsk - Ukraine is unlikely to hand over such important strategic hubs without a fight. \"The size of the Ukrainian Armed Forces will be limited to 600,000 personnel.\" Ukraine's military was estimated last January at about 880,000 active personnel, up from 250,000 at the start of the full-scale invasion in February 2022. While 600,000 might seem a potentially acceptable number in peacetime, that kind of limitation would infringe on Ukrainian sovereignty. It might also be too big a number for Russia to accept. \"Our red lines are clear and unwavering,\" Ukrainian representative Khrystyna Hayovyshyn told the UN security Council: \"There will never be any recognition formal or otherwise of Ukrainian territory temporarily occupied by the Russian Federation as Russian. Ukraine will not accept any limits on its rights to self defence or on the size or capabilities of our armed forces.\" The draft also proposes that \"Crimea, Luhansk and Donetsk will be recognised as de facto Russian, including by the United States\". In other words Ukraine and other countries would not need to recognise Russian control by law. That could enable Kyiv to accept such phrasing, as it would not impinge on Ukraine's constitution that says its borders are \" indivisible and inviolable\". Elsewhere, in the southern regions of Kherson and Zaporizhzia, the front lines would be frozen and Russia would relinquish areas it has occupied elsewhere in Ukraine - a reference to the north-eastern Kharkiv and Sumy regions, as well the Mykolaiv region in the south. On Monday Zelensky said allowing Moscow to seize land by force would set a dangerous precedent. Giving legal recognition to the territories \"stolen\" by Russia would \"break the principle of territorial integrity and sovereignty\", he said. The draft proposes significant commitments on Ukraine's strategic future: \"Ukraine agrees to enshrine in its constitution that it will not join Nato and Nato agrees to include in its statutes a provision that Ukraine will not be admitted in the future.\" \"Ukraine is eligible for EU membership and will get short-term preferred market access to the European market while this issue is being evaluated.\" There is little chance of Ukraine joining Nato any time soon and Russia has in recent months softened its stance on Ukraine's candidacy for EU membership. The document appears to offer Kyiv access to EU markets while ignoring the views of 27 European countries. Joining both the EU and Nato are part of Ukraine's constitution and another of Khrystyna Hayovyshyn's red lines at the UN was: \"Nor will we tolerate any infringement on our sovereignty including our sovereign right to choose the alliances we want to join.\" Other draft proposals are that Nato agrees not to station troops in Ukraine and that European fighter jets will be stationed in neighbouring Poland. Kyiv would also have to commit to being a\"non-nuclear state\". That appears to reject the West's Coalition of the Willing's plans led by the UK and France to help police any future deal. Several points refer to Russia being brought back from isolation with\"Russia to be re-integrated into the global economy\"and invited back into the G8 group of powers. That seems a long way off for now, with Putin under an arrest warrant from the International Criminal Court. Russia was thrown out of the G7 after it seized and then annexed Crimea in 2014 and Trump tried to bring Putin back into the fold six years later. If the UK, Canada, France, Germany, Italy and Japan were reluctant before the full-scale invasion, there's even less chance of that happening now. The draft proposes that $100bn (€87bn; £76bn) of frozen Russian assets should be invested\"in US-led efforts to rebuild and invest in Ukraine\", with the US receiving 50% of the profits and Europe adding $100bn in investment for reconstruction. This is reminiscent of the US minerals deal with Ukraine earlier this year, extracting an American price for involvement, and it also leaves the European Union with nothing but hefty bills. The sums it mentions may not be sufficient, either: earlier this year the total cost of reconstruction in Ukraine was put at $524bn. Some €200bn in Russia frozen assets are largely held by Euroclear in Belgium, and the European Union is currently working on a plan to use the money to fund Kyiv financially and militarily. The rest of those frozen assets would go to a\"US-Russian investment vehicle\", under the draft, so Russia would see some of its money come back, but again there would be a financial benefit for the US. Several commentators have pointed out that the plan does not require weapons limitations on Ukraine's military or its arms industry, even though there is a provision saying: If Ukraine fires a missile at Moscow or St Petersburg then the security guarantee will be considered null and void. But it does not place an restriction on the long-range weapons Ukraine has been developing - such as its Flamingo and Long Neptune missiles. \"There's still some work to be done,\" US Secretary of State Marco Rubio admitted late on Sunday, after his team's crisis talks with Ukrainian and European negotiating delegations in Geneva, Switzerland. \"But we are much further ahead today at this time than we were when we began this morning and where we were a week ago, for certain,\" America's top diplomat added. He refused to go in details on what main sticking points remained. Rubio also said that any new plan had to be agreed with Russia, which has not publicly commented on the latest developments. Meanwhile, several media outlets reported and published what they said was an alternative plan from Ukraine's European allies led by the UK, France and Germany. But Rubio said he was \"unaware\" of any European counter-proposals to the US plan. The US was initially keen to press ahead fast under an \"aggressive timeline\" with its proposals, giving Ukraine until 27 November to agree to it. However, Trump later said it was not his \"final offer\" for Kyiv, after Ukrainian allies voiced concerns over the plan. Rubio said a deal may be reached by Thanksgiving, or before or even after the US holiday. Russian special envoy Kirill Dmitriev is known to have spent as long as three days with Trump's special envoy Steve Witkoff discussing this plan, raising suggestions of a stitched-up deal to suit Moscow. A group of US senators have said they were told by Rubio that the plan was not an American proposal - that it represented the Russian position and was leaked by a representative for Moscow. This contradicts the position of the White House, which says the plan has been endorsed by President Donald Trump, having been drawn up by his officials. Rubio later said the peace proposal had been \"authored by the US\". \"It is offered as a strong framework for ongoing negotiations. It is based on input from the Russian side. But it is also based on previous and ongoing input from Ukraine.\" Russia's response has so far been cautious but Putin has said itcould be the \"basis\" for a peace settlement. The handover of Ukrainian territory to Russia, even in a demilitarised zone, is the biggest sign of a slant towards Russia's narrative, but freezing the front lines in the south could prove difficult for the Kremlin which has annexed both Kherson and Zaporizhzhia in its constitution. One of the proposals is for the lifting of sanctions to be\"agreed upon in stages and on a case-by-case basis\"- which Moscow will probably see as far too slow. However, a plan for a\"full amnesty\"for all parties will go down well in Moscow and very badly in Kyiv and European capitals. Commentators have pointed out that while there do appear to be major concessions to Putin, some of the requirements for Nato might be too vague for Kremlin tastes. Russia has also consistently demanded that a peace plan would need to eliminate what it sees as \"the root causes\" of the war. One of those root causes is halting Nato expansion in Eastern Europe, which the draft appears to deal with. Some of the other 28 points of the draft also nod to Russia's claims of discrimination against Ukraine's Russian-speaking population without explicitly endorsing them. One point is explicit but even-handed:\"Both countries will agree to abolish all discriminatory measures and guarantee the rights of Ukrainian and Russian media and education.\" Another apparent attempt to be even-handed comes from a proposal to distribute electricity generated by the Russian-occupied Zaporizhzhia nuclear power plant - the biggest in Europe -\"equally between Russia and Ukraine\". Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader said during a TV marathon that claims that an attack on Europe was planned were \"nonsense\". BBC Russia editor Steve Rosenberg had the opportunity to ask Vladimir Putin about his plans for the future of the country. How Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months. Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "source": "BBC",
        "url": "https://www.bbc.com/news/articles/cwy170jkekdo",
        "title": "Ukraine to get up to 100 French-made Rafale fighter jets",
        "content": "Ukraine will receive up to 100 of France's Rafale F4 fighter jets as well as advanced air defence systems in a major deal to boost Kyiv's ability to protect itself against deadly Russian attacks. Ukrainian President Volodymyr Zelensky hailed the move as \"historic\", after signing the letter of intent with his French counterpart Emmanuel Macron at an air base near Paris. Deliveries of the Rafale F4s are planned to be completed by 2035, while the joint production of interceptor drones is starting this year. Financial details are yet to be worked out, but reports say France plans to attract EU financing and also accessfrozen Russian assets - a controversial move that has split the 27-member bloc. \"This is a strategic agreement which will last for 10 years starting from the next year,\" Zelensky said at a joint briefing with Macron on Monday. Ukraine will also get \"very strong French radars\", eight air defence systems and other advanced weaponry, he added. Zelensky stressed that using such advanced systems \"means protecting someone's life... this is very important\". Russia has in recent months increased its drone and missile attacks on Ukraine, targeting energy and rail infrastructure and causing massive blackouts across the country. Dozens of civilians have been killed in the strikes, in what Kyiv and its Western allies describe as war crimes. In the latest overnight Russian missile attack, three people were killed and 15 injured in the north-eastern city of Balakliya, local officials said. Speaking alongside Zelensky, Macron said: \"We're planning Rafales, 100 Rafales - that's huge. That's what's needed for the regeneration of the Ukrainian military.\" The French president added that he wanted to help Ukraine prepare for whatever was coming next. These fighter jets are seen as crucial to protecting Ukraine's skies, because the country is almost powerless in preventing long-range air strikes on its border towns and cities. \"The Russians are using 6,000 glide bombs per month,\" Serhiy Kuzhan, a Ukrainian defence analyst, told the BBC. \"It would be important to have a French air-to-air system, with a 200km range, because Russians have their own system with a range of 230km.\" While this announcement between Kyiv and Paris is sizeable, Justin Bronk from the Royal United Services Institute (Rusi) pointed out: \"The difference they'll make will depend on the timeframe and the missiles that come with them.\" This is a long-term political agreement rather than a detailed purchase order, so few are expecting this announcement to dramatically change the dynamics of Russia's grinding invasion. The promises of Western military hardware are also only as effective as the training and logistics they come with. Whether it's a German-made Leopard 2 tank or an American F-16 fighter jet, they all require intensive training, sizable support crews and a lot of spare parts. With the Rafales, further complexities arise around the question of who pays. It's thought France will dip into its own budget contributions for Kyiv, as well as look at joint EU borrowing mechanisms to help pay for the deal. But what you hear privately admitted in EU's corridors of power in Brussels is that the money is slowing running out. The bloc has agreed to help support Ukraine's battered economy for the next two years, but there is less consensus on whether to unlock €140bn ($162bn; £123bn) of frozen Russian assets to help support Ukraine financially and militarily. The proposals are currently illegal under international law, and some members are nervous about the prospect of having to pay Russia back when the war ends. Ukraine's air force is already using France's Mirage warplanes as wellas US-made F-16s. Kyiv has also recently provisionally agreed to obtain Swedish Gripen fighter jets. After France, Zelensky will travel to Spain to seek further military and other support for Ukraine. Over the weekend, he secured a gas deal with Greece.Vital supplies of US liquefied natural gas are now expected to start flowing into Ukraine this wintervia a pipeline across the Balkans. Russian President Vladimir Putin launched a full-scale invasion of Ukraine in February 2022. Moscow currently controls about 20% of Ukraine's territory. Russian troops have been making slow advances along the vast front line - despite reported huge combat casualties. Fanil Sarvarov was the head of the armed forces' operational training department, Russia's Investigative Committee said. A group of Ukrainian performers tell the story of what it is like to be far from home at Christmas. Donald Trump's special envoy, Steve Witkoff, issued a statement with the top Ukrainian negotiator after discussing the latest peace plans. As some West African nations choose to cement old ties with France or a new ally in Russia, Togo wants both. Russia's leader told our Russia editor that claims an attack on Europe was planned were \"rubbish\". Copyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites.Read about our approach to external linking."
    }
]